[
    {
        "title": "IBM",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4346130337",
        "reason": "The job explicitly requires 'Englisch + Deutsch fließend' (English + German fluent), which the user has specified they do not want to see if both languages are required.",
        "body": " IntroductionWir suchen Dich als Teil unseres Security Leadership Teams. Unterstütze uns ein Jahr lang in strategischen und administrativen Themen und erhalte umfassende Einblicke, wie ein Security Bereich in einer globalen Consulting-Organisation geleitet wird. Danach kannst du mit diesem Geschäftsverständnis als IT Security Consultant bei uns durchsteigen. Idealerweise bringst du ein Verständnis für das Consultinggeschäft mit. In dieser Rolle verbindest du kaufmännische und fachliche Themen und kannst deine Ideen einbringen.In dieser Rolle arbeitest du im IBM Client Innovation Center Germany (CIC), wo wir tiefgehendes technisches Know-how und Industriekenntnisse in einer breiten Palette an Kundenprojekten im öffentlichen und privaten Sektor zum Einsatz bringen. Unser CIC bietet lokal ansässigen Unternehmen technische Expertise um Innovation voran zu treiben und neue Technologien zu implementieren.Your Role And Responsibilities Ausarbeiten von neuen, strategischen Security-ThemenMitwirken bei der Gestaltung des PortfoliosUnterstützung in der Zusammenarbeit mit PartnernSupport bei administrativen Aufgaben, Tracking von GeschäftszahlenPreferred EducationBachelor's DegreeRequired Technical And Professional Expertise Bachelor-Studium in BWL, Wirtschaftsinformatik oder technisch mit Inhalten zu Consulting, analytisches Denken, starke KommunikationsfähigkeitErste Erfahrungen mit IT Security Excel/PP Englisch + Deutsch fließendPreferred Technical And Professional Experience Fundierte Erfahrung in einem Security-BereichErfahrung in Angebotserstellung ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Henkel",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4335305310",
        "reason": "The job is an 'Intern' role, which matches the user's preference for entry-level/intern jobs. It requires being a Master's student, which aligns with the user currently studying for a Master's (and having a Bachelor's). It's a corporate job at Henkel, fitting the user's career interest. Crucially, it only explicitly requires 'Excellent English language skills' and does not mention German, satisfying the language preference. It is not a dual study program.",
        "body": " About This PositionAs a Customer Data &amp; CRM Master Data Intern, you will support different projects in executing key initiatives related to CRM master data migration and customer data transformation projects. You will play a critical role in ensuring data quality, consistency, and governance during the migration process and contribute to enhancing customer data structures and ownership frameworks.What You´ll Do Become a team member of the Global Adhesives Sales Excellence team responsible for driving business activities, tools, and processes to support the best execution of the sales strategy and shaping our ideal salesforce Assist the implementation of data governance frameworks, policies, standards, and procedures Support data cleansing and migration activities for CRM migration - data mapping, cleansing, transformation, reconciliation and validation to ensure accuracy and consistency Facilitate change management activities towards a vast user community for ongoing projects and initiativesConduct analyses to support data-driven decision-making for customer segmentation or CRM optimization Prepare and maintain documentation, user guides, communication content and training materials to support data management processesAssist with reporting, KPIs, and dashboards to track data quality and governance progress Support and contribute to maintaining and improving customer master data quality, ensuring accuracy, completeness, and consistency across systems through data validation and enrichment activities using defined business rules What makes you a good fit (Master) student who has successfully passed first semesters, ideally in business management studies, data analytics, information technologies and other data related studies Practical or international experience in multinational companies, e.g. by former internships or semester abroad, is advantageous Excellent English language skills Advanced MS Office skills (PowerPoint, Excel, SharePoint, etc); knowledge in ERP, CRM and other data management platforms and tools (e.g., Power BI, Tableau) is a plus Strong interest in customer data management, CRM systems, and data governance, good understanding of master data management (MDM) concepts and data models Excellent communication and collaboration skills paired with strong organizational abilities, attention to detail, and effective multitaskingAbility to work at high independence, adaptability and eagerness to learn in a fast-paced environment, with a proactive attitude towards new challenges Self-motivated, result-oriented and dedicated team-player with a strong sense of accountability and ownership Availability as of January 2026 for 6 months Some perks of joining Henkel Flexible work scheme with flexible hours, hybrid work modelDiverse national and international growth opportunitiesGlobal wellbeing standards with health and preventive care programsAttractive RemunerationGlobal ExperienceInterns CommunityWe offer you an attractive salary between € 1050-2270. The exact amount of the remuneration depends on the desired duration, the type of internship (voluntary or mandatory) and existing degrees.At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different genders, origins, cultures, religions, sexual orientations, generations and disabilities. If there are any specific accommodations or adjustments you require for the interview process or your on-site appointment, please inform us, and we'll do our best to accommodate your requests. ",
        "job_sum": "- **Job Title:** Customer Data & CRM Master Data Intern\n- **Responsibilities:** Support CRM master data migration and customer data transformation projects, ensure data quality/consistency, assist with data governance, cleansing, migration, facilitate change management, conduct analyses, prepare documentation, assist with reporting/KPIs, and contribute to data quality improvement.\n- **Requirements:** (Master) student who has successfully passed first semesters (ideally in business management, data analytics, IT), practical/international experience (advantageous), excellent English skills, advanced MS Office skills, knowledge in ERP/CRM/data management platforms (plus), strong interest in customer data management/CRM/data governance, good understanding of MDM concepts, excellent communication/collaboration, strong organizational skills, attention to detail, multitasking, high independence, adaptability, eagerness to learn, proactive attitude, self-motivated, result-oriented, dedicated team-player. Availability as of January 2026 for 6 months.\n- **Location:** Not explicitly mentioned in job description.\n- **Language Needs:** Excellent English language skills.",
        "is_match": true
    },
    {
        "title": "AOK Systems GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344492549",
        "reason": "The job is for a 'Werkstudierende' (working student), which matches the user's preference for entry-level roles. It is a corporate job within AOK Systems GmbH's development area, fulfilling the 'corporate jobs' preference. The user is currently pursuing a Master's degree, which satisfies the 'Laufendes Studium' (ongoing studies) requirement, and having a Bachelor's degree is also compatible. The job does not explicitly state that it is a dual study program. Finally, regarding language, the job description does not explicitly state that German language proficiency is a requirement. Per the user's instruction, 'The job requires german only if it explicitly says that it does. Otherwise, you can show me.', this job is considered a match despite the description being in German.",
        "body": " Deine AufgabenZur Unterstützung unseres Entwicklungsbereichs suchen wir zwei engagierte Werkstudierende, die uns bei der Überführung unserer bestehenden Dauerdokumentation aus dem Intranet in ein modernes Redaktionssystem begleiten.Die technische Migration ist nur teilweise automatisierbar – deshalb braucht es Sorgfalt, Struktur und ein gutes Verständnis für Dokumentationsprozesse. Die Aufgabe erfordert eine enge Abstimmung mit verschiedenen Entwicklungseinheiten und bietet damit einen fundierten Einblick in die Abläufe professioneller Softwareentwicklung im GKV-Umfeld.Deine Aufgaben sind v.a.: Übernahme und Strukturierung bestehender Dokumentationsinhalte aus dem IntranetDurchführung der manuellen und teilautomatisierten Migration in das neue RedaktionssystemAbstimmung mit Entwicklungseinheiten zur Klärung fachlicher Inhalte und zur Sicherstellung einer einheitlichen DokumentationsqualitätMitarbeit bei der Qualitätssicherung der migrierten InhalteDein Profil Laufendes Studium, idealerweise in (Wirtschafts-)Informatik, Technischer Redaktion, Kommunikationswissenschaften oder einem vergleichbaren Studiengang Sorgfältige, strukturierte Arbeitsweise und ausgeprägtes Qualitätsbewusstsein Sicherer Umgang mit digitalen Tools; erste Erfahrungen mit Redaktions- oder Dokumentationssystemen sind von Vorteil Kommunikationsstärke und Bereitschaft zur Abstimmung mit verschiedenen FachbereichenDas bieten wir DirWir bieten Dir die Möglichkeit, eigeninitiativ und kreativ tätig zu sein, Deine Ideen einzubringen und mit uns die GKV stark zu machen. Bei uns erwartet Dich ein attraktives, kooperatives und flexibles Arbeitsumfeld (u.a. Möglichkeit zur Remote-Arbeit, Gleitzeit-Konto) mit abwechslungsreichen Aufgaben. Du kannst Dich bei uns auf agile Vorgehensweisen, moderne Hardware und ein leistungsorientiertes Gehaltssystem freuen.Unsere Leistungen im Überblick: Aus- und Weiterbildung Firmenlaptop Flexible Arbeitszeiten Hybrides Arbeiten Mitarbeiterevents Mitarbeiterrabatte Sehr gute Übernahmechancen Konkurrenzfähige Vergütung Klingt gut?Judith Marques FelixFalls Du noch Fragen zu der Position hast, melde Dich unter bewerbung@sys.aok.deAnsonsten freuen wir uns über Deine Bewerbung über den Bewerben - Button! Um Dir das Lesen zu erleichtern, verwenden wir in unseren Anzeigen männliche Bezeichnungen. Bei uns sind alle Menschen gleich willkommen - unabhängig von Geschlecht, Nationalität, ethnischer und sozialer Herkunft, Religion/Weltanschauung, Behinderung, Alter sowie sexueller Orientierung.Zurück Bewerben ",
        "job_sum": "- **Job Title:** Working Student (Werkstudierende) in Development Support\n- **Responsibilities:** Support the development department by transferring and structuring existing documentation from the intranet into a new editorial system. This includes manual and partially automated migration, coordination with development units to clarify content, ensure quality, and assist with quality assurance of migrated content.\n- **Requirements:** Ongoing studies, ideally in (Business) Informatics, Technical Redaction, Communication Sciences, or a comparable field. Requires a careful, structured work ethic, strong quality awareness, proficiency with digital tools (experience with editorial/documentation systems is a plus), and strong communication skills with a willingness to coordinate across departments.\n- **Location:** Not explicitly stated in the job description.\n- **Language Needs:** Strong communication skills are required. While the job description is in German and communication within the company would likely be in German, it does not explicitly state 'German language skills' as a requirement.",
        "is_match": true
    },
    {
        "title": "TEDi",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4346065115",
        "reason": "This job is an 'Ausbildung' (apprenticeship) program, which involves full-time vocational training combined with attendance at a Berufskolleg (vocational college). This type of program is fundamentally incompatible with someone currently pursuing a Master's degree, similar to the user's stated preference against dual study programs. Additionally, the role requires a 'good Realschulabschluss' (secondary school leaving certificate), which is for school leavers, not for someone who has already completed a Bachelor's degree and is pursuing a Master's.",
        "body": " Das Erwartet Dich Du arbeitest bei der Analyse von Anforderungen, Konzeption und Entwicklung von maßgeschneiderten Anwendungen mitDeine Aufgaben beinhalten das Testen und Dokumentieren von Softwareanwendungen sowie die Beseitigung von Fehlern (Debugging)Du bekommst Einblicke in die agile Softwareentwicklung (Scrum, Kanban) und arbeitest an Projekten mitDu unterstützt bei der Pflege und Weiterentwicklung bestehender SoftwareprodukteDu lernst bestehende Anwendungen anzupassen und zu erweiternDu bist für die Wartung, die Dokumentation, die Fehlerbehebung und das Testen der Software zuständigDu durchläufst während Deiner Ausbildung alle relevanten Abteilungen der IT und programmierst dabei von Beginn an produktiv und nicht nur in TestsystemenDie theoretischen Inhalte für die IHK-Prüfung werden Dir an ein bis zwei Tagen pro Woche am Hellweg Berufskolleg in Unna vermitteltDas Bringst Du Mit Du hast die Schule mindestens mit einem guten Realschulabschluss beendetDu begeisterst Dich für IT, Technik und ProgrammierungDu hast bereits erste Erfahrungen in Programmiersprachen wie Java, C#, Python oder anderenAnalytisches Denken, Problemlösungsfähigkeiten und eine strukturierte Arbeitsweise zeichnen Dich aus Eigeninitiative, Freude am Lernen sowie Teamfähigkeit sind für Dich keine FremdworteUnd Dafür Gibt's Ein attraktives Gehalt in Höhe von 1.000 Euro brutto im ersten Lehrjahr, 1.100 Euro brutto im zweiten Lehrjahr und 1.200 Euro brutto im dritten LehrjahrFlexible ArbeitszeitenAzubi-EventsCorporate BenefitsAbwechslungsreiche Tätigkeiten und die Möglichkeit, eigene Ideen einzubringenVerantwortungsvolle und „echte“ AufgabenIntensive Betreuung durch feste Ansprechpartner und regelmäßige Feedbackgespräche ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "winkler Unternehmensgruppe",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328720803",
        "reason": "The job explicitly requires 'Fließende Deutschkenntnisse in Wort und Schrift' (Fluent German skills in spoken and written word). The user stated they do not know German. Additionally, the user requested 'only entry jobs like working student or intern jobs,' but this position is a professional role requiring a completed qualification and initial experience, rather than a working student or intern position.",
        "body": " Ihre AufgabenAls Helpdesk / IT-Support Mitarbeiter (m/w/d) bei der Rheinwohnungsbau GmbH sind Sie die erste Anlaufstelle für alle IT-bezogenen Anfragen und Probleme unserer Mitarbeitenden. Sie arbeiten in einem hybriden Umfeld, das sowohl Büro- als auch Remote-Arbeit ermöglicht, und tragen dazu bei, dass unsere IT-Infrastruktur reibungslos funktioniert. Erste Ansprechperson für IT-Anfragen und -Probleme des TeamRWB. Analyse und Behebung von Hard- und Softwareproblemen. Installation und Konfiguration von IT-Equipment. Unterstützung bei der Verwaltung von Benutzerkonten und Zugriffsrechten. Mitarbeit an IT-Projekten zur Verbesserung der internen Systeme. Dokumentation von Supportfällen und Erstellung von Berichten. Schulung und Unterstützung der Mitarbeiter bei der Nutzung neuer Software und Technologien. Unsere AnforderungenWir suchen einen engagierten und lösungsorientierten IT-Support Mitarbeitenden, mit folgenden Qualifikationen: Abgeschlossene Ausbildung im IT-Bereich oder vergleichbare Qualifikation. Erste Berufserfahrung im IT-Support oder Helpdesk. Gute Kenntnisse in Windows-Betriebssystemen und MS Office. Erfahrung mit Netzwerktechnologien und IT-Sicherheit. Ausgeprägte Problemlösungsfähigkeiten und analytisches Denken. Gute Kommunikationsfähigkeiten und Kundenorientierung. Fließende Deutschkenntnisse in Wort und Schrift. Wir bietenDie Rheinwohnungsbau GmbH bietet Ihnen ein attraktives Arbeitsumfeld mit zahlreichen Vorteilen: Befristete Anstellung (24 Monate), mit Aussicht auf Festanstellung. 37 Stunden Woche und die Möglichkeit zum hybriden Arbeiten. Individuelle Weiterbildungs- und Entwicklungsmöglichkeiten. Ein kollegiales und unterstützendes Arbeitsklima. Moderne IT-Ausstattung und ergonomische Arbeitsplätze. Attraktive Vergütung und betriebliche Altersvorsorge. JobRad, Firmenticket &amp; weitere BenefitsRegelmäßige Team-Events und Firmenveranstaltungen. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Deloitte",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4262632240",
        "reason": "The job explicitly requires 'Deutsch und Englisch sehr gut in Wort und Schrift' (very good German and English skills in spoken and written word). The user specifically stated, 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!'",
        "body": " Deloitte bietet führende Prüfungs- und Beratungsleistungen in Audit &amp; Assurance, Tax &amp; Legal, Consulting und Advisory - für nahezu 90 % der Fortune Global 500® und zahlreiche private Unternehmen. Wir liefern innovative Denkansätze, lösen komplexe Herausforderungen und fördern nachhaltiges Wachstum. Mit rund 470.000 Mitarbeitenden weltweit eröffnen wir hervorragende Karrierechancen - getragen von einem starken „Wir“ und einer Vielfalt an Perspektiven und Fähigkeiten.Du willst im Bereich Audit &amp; Assurance - IT Audit &amp; IT Assurance zu Transformationsprozessen und verlässlicher Informationsverarbeitung prüfen und beraten? Unser Team schafft Vertrauen in die IT-Risikomanagementlösungen und IT-Governance-Systeme unserer Mandanten. Sichere unseren gemeinsamen Erfolg und mach mit uns den Unterschied: als Praktikant / Werkstudent IT Audit &amp; IT Assurance - Data Analytics (m/w/d).Standorte: Berlin, Düsseldorf, Frankfurt (Main), Hamburg, Hannover, Köln, Mannheim, München, Nürnberg und Stuttgart.Dein Impact:Als Werkstudent / Praktikant IT Audit &amp; IT Assurance - Data Analytics (m/w/d) bringst du dich in eine große Bandbreite spannender Themen ein - von Risikomanagement und IT-Prüfungen über Prozessoptimierung und Treasury Management bis hin zu digitaler Transformation, Prozessüberwachung oder der bilanziellen Abbildung von Finanzinstrumenten. Analysen: Du unterstützt unser Team bei der Erarbeitung und Durchführung anspruchsvoller Datenanalysen.Hands-on-Einstieg: Dabei führst du selbstständig Auswertungen durch.Konzepte: Auch bei der Ausarbeitung von Lösungskonzepten stehst du uns tatkräftig zur Seite.Teamwork: Schnell wirst du dabei zum festen Teil eines multidisziplinären Teams.Dein Skillset: Student:in eines Studiengangs mit wirtschaftswissenschaftlicher bzw. informationstechnischer AusrichtungGutes Verständnis betriebswirtschaftlicher Zusammenhänge Ausgeprägter Teamgeist und Spaß an komplexen AufgabenHohe Kommunikationsstärke sowie Deutsch und Englisch sehr gut in Wort und SchriftDeine Chance: Echte Verantwortung für eigene Aufgabenpakete innerhalb unserer Projekte, die du selbständig bearbeitestPersönliche:r Mentor:in in deinem Team, der/die dir mit Rat und Tat zur Seite steht und dich mit umfassendem Know-how unterstütztEin chancenreiches und internationales Umfeld, das dir einmalige Einblicke in die Arbeit des weltweit größten Prüfungs- und Beratungsunternehmens bietetWork-Life-Balance in einem innovativen Unternehmensumfeld, das dir Gesundheitstage, Mitarbeiter:innen-Events und vieles mehr bietetBereichsübergreifendes Networking im Deloitte Student Network mit exklusiven Vorträgen und regelmäßigem Austausch beim Praktikant:innen-StammtischVielfältige Gestaltungsspielräume und aktive Förderung einer inklusiven Unternehmenskultur – u. a. durch unsere Diversity &amp; Inclusion Mitarbeiter:innen-NetzwerkeDeine Verfügbarkeit:Als Praktikant:in / Werkstudent:in bist du idealerweise ab 01.01.2026 für einen Zeitraum von mindestens 3 Monaten verfügbar.Gleiche Chancen für alle: Wir freuen uns über Bewerbungen von Menschen, die so vielfältig sind wie wir - unabhängig von Alter, Behinderung, ethnischer Herkunft und Nationalität, Geschlecht, Religion, sexueller Orientierung oder sozialer Herkunft. Noch Fragen? Alle Infos zu unserem Bewerbungsprozess findest du in unseren Bewerbungs-FAQs.Bewerbungsfrist: Solange der Job angezeigt wird, kannst du dich schnell und bequem online bewerben. Jobs werden häufig an verschiedenen Standorten mehrfach besetzt und du kannst flexibel jeden Monat beginnen - sofern nicht im Stellentext genannt, gibt es keinen Bewerbungsschluss.Dein Kontakt bei Fragen rund um KarrierethemenUnser Team Talent Acquisition – Aleksandra, Anja, Julia, Lea, Lisa, Silja und ihre Teams – unterstützt dich gerne bei allen Fragen rund um deine Karriere bei Deloitte. Du erreichst uns per E-Mail unter career@deloitte.de oder telefonisch unter +49 211 87724111.Job-ID: 49013 ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Westnetz",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344815244",
        "reason": "The job explicitly states a requirement for both 'sattelfest in deutscher Sprache' (proficient in German) and 'gute Englischkenntnisse' (good English skills). The user specifically requested not to be shown jobs that require both German and English because they do not know both languages.",
        "body": " Du. Mit uns? Für unser Team Digitalisierung, Standort Dortmund, Essen, Münster, Osnabrück oder anderer Westnetz-Standort, suchen wir zum nächstmöglichen Zeitpunkt engagierte Verstärkung.Deine Arbeit sollte sinnstiftend sein und Du willst Dich mit all Deinen Facetten einbringen? Dann bist Du bei uns richtig. Wie Du bist, was Du fühlst: Wir sehen Dich.Die Westnetz GmbH, eine 100-prozentige Tochter der Westenergie AG, ist der größte Verteilnetzbetreiber Deutschlands. Mit über 6.000 Mitarbeiter*innen und unserer offenen Unternehmenskultur stellen wir die zuverlässige Versorgung unserer Kundinnen und Kunden sicher – rund um die Uhr, an 365 Tagen im Jahr. Wenn Du mit uns die Energiewende mitgestalten, die Lebensqualität von Menschen verbessern und die regionale Infrastruktur stärken willst, findest Du bei uns Raum zur Verwirklichung.Nichts verändert unsere Zeit mehr als die Digitalisierung. Die technologischen Entwicklungen sind rasant und verändern die Art, wie wir kommunizieren, arbeiten, lernen und leben. Mit dem Team „Digitalisierung“ schaffen wir durch Zusammenarbeit mit unseren Fachbereichen unter Einsatz von agilen Methoden und digitalen Kompetenzen Mehrwerte für die Westnetz. Wir begleiten die Fachbereiche und Kernprozesse durch Data Science Lösungen auf Ihrem Weg in die Zukunft und durch die Energiewende.Dafür stehst Du auf: Du führst, unterstützt von Deinen Kolleg*innen, komplexe Datenanalysen durch, um relevante Erkenntnisse und Muster zu identifizieren und prädiktive Modelle zu entwickelnDu arbeitest mit großen Datensätzen und integrierst Daten aus verschiedenen Quellen z.B. mit SQLDu bereinigst große Datensätze und erstellst Datenmodelle mit der Programmiersprache PythonDu visualisierst Daten auf ansprechende Weise in gängigen Visualisierungslösungen wie z.B. PowerBI, um sie für Entscheidungsträger und andere Stakeholder verständlich zu machenDu arbeitest eng mit anderen Teams wie Ingenieuren, Entwicklern und Entscheidungsträgern zusammen und kommunizierst die Ergebnisse Deiner Analysen und Modelle Das bringst Du mit: Du studierst an einer Hochschule oder Universität in den Bereichen Data Science, Datenanalyse, Datenmanagement, Informatik, (Wirtschafts-, Elektro-) Ingenieurswesen, Mathematik, Statistik oder einem vergleichbaren StudiengangDeine Begeisterung für IT und digitale Technologien treibt Dich anDu bringst Erfahrungen in der Programmierung in Python und SQL, der Versionsverwaltung in git sowie gängigen IT-Systemen mitIdealerweise bringst du Grundkenntnisse in Azure und Databricks mitEigeninitiative, Teamgeist und die Bereitschaft, sich für das Gesamtergebnis einzusetzen, zeichnen Dich ausDu bist sattelfest in deutscher Sprache und kannst gute Englischkenntnisse vorweisen Was wir Dir bieten: Egal ob Klausurenphase oder Semesterferien, bei uns kannst Du Deine Arbeitszeiten flexibel gestalten und so Unialltag und Berufseinstieg miteinander kombinieren. Nach der Einarbeitungsphase ist das Arbeiten auch aus dem Home-Office möglichEin junges und motiviertes Team, das Dir jederzeit mit Rat und Tat zur Seite stehtDie Möglichkeit, Dich sowohl persönlich als auch fachlich zu entwickeln, Netzwerke aufzubauen und erste Kontakte in der Arbeitswelt zu knüpfenInteressante und anspruchsvolle Aufgaben in einem wachsenden Aufgabenfeld mit sich stets weiterentwickelnden Technologien und der Möglichkeit einen echten Mehrwert für das Unternehmen zu schaffen und einen aktiven Part in der Energiewende zu übernehmenBist Du interessiert?Dann bewirb Dich bitte ausschließlich online (Anzeigencode: 241986).Mit unserer offenen und wertschätzenden Unternehmenskultur heißen wir alle Menschen willkommen. Denn wir sind davon überzeugt, dass uns Unterschiede bereichern – sei es in Herkunft, Geschlecht, Alter, Lebens- und Arbeitsstilen, Talenten, Fähigkeiten und Einschränkungen.Wir freuen uns auf Deine vollständige und aussagekräftige Bewerbung mit Lebenslauf und relevanten Zeugnissen. Um Dir den Bewerbungsprozess zu erleichtern, verzichten wir auf ein Anschreiben.Westnetz GmbH Johanna Fitze, +49 231 438-1194Deine Fragen beantworten wir auch gerne unter johanna.fitze@westnetz.deWir sind ein Top-Arbeitgeber!Überzeuge Dich selbst:https://www.kununu.com/de/westnetzWas du sonst noch wissen solltest:Beschäftigungsart: BefristetArbeitsmodell: HybridBeschäftigungsgrad: TeilzeitGesellschaft: Westnetz GmbH ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=3733043030",
        "reason": "The job explicitly requires 'sehr guten Deutsch- und guten Englischkenntnisse' (very good German and good English skills), which the user specified they do not want to see if both are required. Furthermore, the role asks for 'Erfahrung in der Prozessanalyse und Implementierung von SAP CDC und idealerweise SAP CDP' (experience in process analysis and implementation of SAP CDC and ideally SAP CDP), indicating it is not an 'entry job like working student or intern' as the user prefers, but rather requires prior professional experience.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Beratung: Du unterstützt Kunden bei der Entwicklung von Datenmanagementkonzepten und maßgeschneiderten Lösungen.Workshops: Du leitest Workshops, um technische Konzepte gemeinsam mit den Kunden zu erarbeiten.Implementierung: Du übernimmst das Customizing in SAP CDC und SAP CDP während der Umsetzung.SAP-Projekte: Du wirst Teil spannender SAP-Renommée-Projekte und arbeitest mit erfahrenen Kollegen zusammen.Karrierepfad: Du besuchst Weiterbildungen und entwickelst dich kontinuierlich innerhalb des Teams.DEIN PROFIL Studium: Du hast ein Studium der (Wirtschafts-)Informatik oder eine vergleichbare Qualifikation abgeschlossen.Erfahrung: Du hast Erfahrung in der Prozessanalyse und Implementierung von SAP CDC und idealerweise SAP CDP.Kundenorientierung: Du arbeitest direkt mit Kunden zusammen und findest kreative Lösungen.Lernbereitschaft: Du bist neugierig weitere SAP CX Lösungen, wie SAP Sales Cloud, SAP emarsys, SAP Service Cloud, kennenzulernen und dich stets weiterzuentwickeln.Kommunikationsstärke: Deine Kommunikationsstärke zeichnet dich aus und du entwickelst gerne Lösungen für Datenmanagement.Sprachkenntnisse: Deine sehr guten Deutsch- und guten Englischkenntnisse ermöglichen dir eine sichere Kommunikation.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "opta data",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4306601207",
        "reason": "The job explicitly states a requirement for 'Berufserfahrung' (professional experience) in IT consulting and project implementation. The user specified they are only looking for 'entry jobs like working student or intern jobs' and to 'dont show something like senior developer'. An IT Consultant role requiring professional experience is not an entry-level position like an intern or working student.",
        "body": " Essen, HybridEssen, HybridIT-Consultant (m/w/x)opta data Stiftung &amp; Co. KG | Essen | VollzeitIn der Corporate IT dreht sich alles um den Betrieb und die Integration von IT-basierten Services innerhalb der opta data Gruppe. Wir betreiben zwei Rechenzentren, mehrere hundert Serversysteme und betreuen ca. 3.000 Arbeitsplätze. Als agile Organisation arbeiten wir in virtuellen Produktgruppen mit flachen Hierarchien und vielen Gestaltungsmöglichkeiten.Deine Aufgaben Analyse und Bewertung von IT-AnforderungenBeratung von internen Kund:innen über die Nutzung und Weiterentwicklung von IT-ServicesEntwicklung neuer IT-Services und Erarbeitung von technischen KonzeptenPlanung und Steuerung von IT ProjektenDein Profil Abgeschlossene Ausbildung zum Fachinformatiker/in Systemintegration, ein abgeschlossenes Studium im IT Bereich oder ein vergleichbarer AbschlussBerufserfahrung in der Beratung und Umsetzung von IT ProjektenFundiertes technisches VerständnisAusgeprägte Kommunikationsfähigkeit, Übersetzer zwischen IT und AnwenderEine selbstständige, strukturierte Arbeitsweise und Teamfähigkeit runden dein Profil abUnsere Benefits Flexibilität: flexible Arbeitszeiten, mobiles Arbeiten und moderne Büros im opta data CampusVitalität: deutschlandweites Sport- und Gesundheitsprogramm, Dienstradleasing sowie frisches Obst und GetränkeGestaltungsspielraum: umfangreiches Ideenmanagement zur Verwirklichung deiner IdeenWeiterbildung: eigene opta data Akademie zur fachlichen und persönlichen WeiterentwicklungErholung: 30 Tage Urlaub im JahrVielseitigkeit: ganzheitliche Aufgaben, viel Eigenverantwortung und kreative MitgestaltungsmöglichkeitenSicherheit: Arbeitsplatz im expandierenden Familienunternehmen mit langjähriger TraditionFamilienfreundlichkeit: eigene U3 Kindergroßtagespflege und Kinder Ferienbetreuung während der SommerferienDeine Kontaktperson ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Deloitte",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4334150847",
        "reason": "The job explicitly requires 'Deutsch und Englisch sehr gut in Wort und Schrift' (very good German and English in spoken and written word). The user explicitly stated: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!' This directly contradicts the user's language preference.",
        "body": " Deloitte bietet führende Prüfungs- und Beratungsleistungen in Audit &amp; Assurance, Tax &amp; Legal, Consulting und Advisory - für nahezu 90 % der Fortune Global 500® und zahlreiche private Unternehmen. Wir liefern innovative Denkansätze, lösen komplexe Herausforderungen und fördern nachhaltiges Wachstum. Mit rund 470.000 Mitarbeitenden weltweit eröffnen wir hervorragende Karrierechancen - getragen von einem starken „Wir“ und einer Vielfalt an Perspektiven und Fähigkeiten.Du willst im Bereich Audit &amp; Assurance - IT Assurance bei abwechslungsreichen und spannenden IT-Projekten dabei sein? Unser Team stellt die Verlässlichkeit der IT- und Transformationsprozesse durch Prüfung und Beratung sicher und schafft damit Vertrauen in die zugrundeliegenden IT-Prozesse und -Systeme. Sichere unseren gemeinsamen Erfolg und mach mit uns den Unterschied: als Praktikant / Werkstudent IT Assurance - Administrative Koordination (m/w/d).Standorte: Berlin, Düsseldorf, Hamburg, Hannover, Köln, München und Stuttgart.Dein Impact:Als Praktikant / Werkstudent IT Assurance - Administrative Koordination (m/w/d) bringst du dich in eine große Bandbreite spannender Themen ein - von Prozessoptimierung bis hin zu digitaler Transformation, Prozessüberwachung und Ressourcenplanung. Unterstützung bei der Ressourcenplanung: Du hilfst bei der Planung und Verteilung von Ressourcen, um sicherzustellen, dass Projekte effizient und erfolgreich umgesetzt werden.Organisation und Koordination: Bei der administrativen Koordination ist dein Können gefragt. Dabei unterstützt du deine Kolleg:innen bei organisatorischen Aufgaben, z.B. übernimmst du Aufgaben im Engagement-Lifecycle und tauschst dich hierzu mit internationalen Kolleg:innen aus.Mitarbeit an Konzepten: Auf deine Ideen kommt es an, denn bei der Erstellung von Konzepten unterstützt du das Team und bringst dich aktiv ein.Teamwork: Als wertvoller Teil unseres Teams arbeitest du eng mit erfahrenen Kolleg:innen zusammen.Unterstützung bei der Prozessoptimierung: Im Rahmen deiner Position identifizierst du Verbesserungspotenziale in unseren Arbeitsabläufen und hilfst bei der Umsetzung effizienter Lösungen.Analysen: Auch die Datenanalyse gehört zu deinen Aufgabenspektrum.Dein Skillset: Student:in der Wirtschaftswissenschaften, (Wirtschafts-) Informatik, Technologie, Mathematik, (Wirtschafts-) Ingenieurwesen oder vergleichbarer Studiengang ab dem 3. BachelorsemesterHohe Kommunikationsstärke sowie eine proaktive und verantwortungsbewusste ArbeitsweiseSehr gute Kenntnisse mit Microsoft Office (Outlook, Excel, PowerPoint etc.)Ausgeprägter Teamgeist und Spaß an komplexen AufgabenDeutsch und Englisch sehr gut in Wort und SchriftDeine Chance: Echte Verantwortung für eigene Aufgabenpakete innerhalb unserer Projekte, die du selbständig bearbeitestPersönliche:r Mentor:in in deinem Team, der/die dir mit Rat und Tat zur Seite steht und dich mit umfassendem Know-how unterstütztEin chancenreiches und internationales Umfeld, das dir einmalige Einblicke in die Arbeit des weltweit größten Prüfungs- und Beratungsunternehmens bietetWork-Life-Balance in einem innovativen Unternehmensumfeld, das dir Gesundheitstage, Mitarbeiter:innen-Events und vieles mehr bietetBereichsübergreifendes Networking im Deloitte Student Network mit exklusiven Vorträgen und regelmäßigem Austausch beim Praktikant:innen-StammtischVielfältige Gestaltungsspielräume und aktive Förderung einer inklusiven Unternehmenskultur – u. a. durch unsere Diversity &amp; Inclusion Mitarbeiter:innen-NetzwerkeDeine Verfügbarkeit:Als Praktikant:in / Werkstudent:in bist du ab sofort idealerweise für einen Zeitraum von (mindestens) 6 Monaten verfügbar.Gleiche Chancen für alle: Wir freuen uns über Bewerbungen von Menschen, die so vielfältig sind wie wir - unabhängig von Alter, Behinderung, ethnischer Herkunft und Nationalität, Geschlecht, Religion, sexueller Orientierung oder sozialer Herkunft. Noch Fragen? Alle Infos zu unserem Bewerbungsprozess findest du in unseren Bewerbungs-FAQs.Bewerbungsfrist: Solange der Job angezeigt wird, kannst du dich schnell und bequem online bewerben. Jobs werden häufig an verschiedenen Standorten mehrfach besetzt und du kannst flexibel jeden Monat beginnen - sofern nicht im Stellentext genannt, gibt es keinen Bewerbungsschluss.Dein Kontakt bei Fragen rund um KarrierethemenUnser Team Talent Acquisition – Aleksandra, Anja, Julia, Lea, Lisa, Silja und ihre Teams – unterstützt dich gerne bei allen Fragen rund um deine Karriere bei Deloitte. Du erreichst uns per E-Mail unter career@deloitte.de oder telefonisch unter +49 211 87724111.Job-ID: 49833 ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Zurich Insurance",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328947346",
        "reason": "The job explicitly requires 'Verhandlungssichere Deutschkenntnisse in Wort und Schrift' (fluent German skills in spoken and written word). The user has indicated that they do not know German.",
        "body": " Bist du bereit, mit dem Besten zu rechnen? Bei Zurich leben wir Versicherung neu. Um die Wünsche unserer Kunden noch besser zu erfüllen, gehen wir neue Wege, denken kreativ, arbeiten agil. Unsere Unternehmenskultur schenkt dir in jeder Hinsicht mehr Flexibilität – und viel Freiraum, dich optimal zu entfalten. Think big – und gerne auch international! Denn deine Entwicklungsmöglichkeiten kennen bei uns keine Grenzen. Bereit, die Zukunft in die Hand zu nehmen?Das erwartet dich Bei der Zurich Gruppe Deutschland unterstützt du den Bereich „Input Management”, die zentrale Serviceeinheit für die Annahme, Verarbeitung und Bereitstellung von Dokumenten sowie Informationen aus analogen und digitalen Eingangskanälen. Mit modernster Technologie – im Zusammenspiel von Mensch und KI – bilden wir das intelligente Bindeglied zwischen Kunden und Fachbereichen. Ein wesentlicher Bestandteil deiner Tätigkeit ist der Aufbau neuer Datenprozesse in Databricks (primär Python und SQL) als Grundlage für Analysen, Berichte und ModelleDu unterstützt bei Analyse- und Reportingprozessen sowie bei der Bearbeitung von ad-hoc-AnfragenDu hilfst bei der Weiterentwicklung und Neugestaltung unserer Reports und DashboardsAußerdem wirkst du an der Erstellung von Präsentationen zu Analyseergebnissen und Erkenntnissen mitDas bringst du mit Zuallererst deine Persönlichkeit: Wir suchen eine zielstrebige und organisierte Person, die durch ihre strukturierte Arbeitsweise ihren Arbeitsalltag eigenständig und gewissenhaft steuert Außerdem bist du Vollzeit immatrikuliert, vorzugsweise in einem Studiengang mit naturwissenschaftlicher, mathematischer oder technischer Ausrichtung (MINT)Du punktest mit Programmiererfahrung in einer imperativen, funktionalen oder objektorientierten Programmiersprache, bspw. PythonDu bringst ein Grundverständnis über Datenbanken mit und du hast Erfahrung mit SQLWünschenswert sind Erfahrungen mit Programmen von Microsoft (PowerBI, Office)Du bist interessiert daran, Neues zu lernen und kannst dich eigenständig in neue Tools und Technologien einarbeitenVerhandlungssichere Deutschkenntnisse in Wort und Schrift runden dein Profil abDeine BewerbungsunterlagenBitte reiche uns mit deiner Bewerbung folgende Unterlagen ein: Aktueller LebenslaufMotivationsschreiben / Anschreiben Bitte gib hier an, wie lange dein Studium circa noch dauern wirdImmatrikulationsbescheinigung (nach9 BAföG, mit Info ob Voll- oder Teilzeitstudium)Bewerbungen von Personen, die ein berufsbegleitendes oder berufsintegriertes Teilzeitstudium absolvieren, können nicht berücksichtigt werden.LeistungsnachweiseZeugnisse Ggf. BachelorurkundeDas bieten wir dir Work-Life-Balance durch ein flexibles ArbeitsmodellZahlreiche Trainings- und Lernangebote, um fit für den Arbeitsalltag zu bleiben und eine individuelle Weiterentwicklung zu ermöglichen Eine moderne, offene und transparente Arbeitsumgebung, die Kreativität und die teamübergreifende Zusammenarbeit fördert Ob Fitness in der Gruppe vor Ort oder virtuelles Achtsamkeitstraining von zu Hause: unser vielfältiges Gesundheitsangebot unterstützt eine gesunde Work-Life Balance Zusätzliche Informationen Standort: KölnPensum: Teilzeit – 16 bis 19 Stunden Kontakt: Laura WeissenhornGehaltsangabe: Bachelorstudierende 1.734€ bei 19 Std./Woche / Masterstudierende 1.899€ bei 19 Std./Woche Laura Weissenhorn freut sich auf deine Bewerbung.Willkommen in deiner Zukunft55.000 Kolleginnen und Kollegen in 215 Ländern und Gebieten. Gemeinsam auf dem Weg, Versicherung jeden Tag neu zu denken – und die Zukunft für alle zu gestalten. Willkommen in einer starken Gemeinschaft, in der du von Anfang an etwas bewegst. Gemeinsam entwickeln wir uns weiter!https://www.zurich.de/de-de/ueber-uns/ihre-karriere ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4203245100",
        "reason": "The job explicitly states that fluent German and English are required ('Du beherrschst Deutsch und Englisch verhandlungssicher'), which goes against your preference of not showing jobs that require both. Additionally, it asks for prior project experience ('Du hast bereits Erfahrungen in Projekten gesammelt') and an additional professional qualification (e.g., bank clerk apprenticeship) beyond a university degree, indicating it is not an entry-level position like a working student or intern, which is your preference.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Analyse und Innovation: Du analysierst bestehende Geschäftsprozesse und die IT-Systemunterstützung unserer Kunden aus dem Bereich Banken und Finanzdienstleister. Dabei entwickelst du innovative, digitale Lösungen und koordinierst deren Umsetzung in die IT-Systeme.Projektarbeit: Du arbeitest in Projekten mit, die neue Fachanwendungen einführen oder alte ersetzen, insbesondere im Bereich von Kernbankensystemen und Portalen.Fachliche Unterstützung: Du unterstützt unsere Kunden im Tagesgeschäft.Vielseitige Rollen: Du kannst verschiedene Rollen übernehmen, wie beispielsweise Businessanalyst, Testanalyst oder Tester oder schlüpfst in die eine der Rollen im agilen Projektvorgehen.Vertrieb und Fachwissen: Du unterstützt unser Vertriebsteam als fachliche Ansprechperson und bringst dein Wissen ein, um unsere Kunden bestmöglich zu beraten.DEIN PROFIL Akademische und berufliche Ausbildung: Du hast ein Studium in Wirtschaft oder Informatik abgeschlossen sowie eine Ausbildung zum Bankkaufmann, Bankfachwirt oder Bankbetriebswirt absolviert. Alternativ bildet eine vergleichbare Qualifikation deine Basis für diese Rolle.Projekterfahrung: Du hast bereits Erfahrungen in Projekten gesammelt, sei es in der Business Analyse, der Erstellung von Fachkonzepten oder im Testumfeld.Bankfachliche Kenntnisse: Du hast gute Kenntnisse in bankfachlichen Prozessen, zum Beispiel im Kreditgeschäft, Bausparen, Zahlungsverkehr oder der Umsetzung regulatorischer Anforderungen.Interesse an IT-Themen: Du hast ein starkes Interesse an IT-gestützten Services und Technologien und bist daran interessiert, dein Wissen in diesem Bereich kontinuierlich zu erweitern.Soft Skills: Deine Arbeitsweise ist kommunikativ, strukturiert und aufgeschlossen. Du magst den persönlichen Kontakt und bist bereit, projektbedingt innerhalb Deutschlands zu reisen.Sprachkenntnisse: Du beherrschst Deutsch und Englisch verhandlungssicher.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "E.ON Digital Technology",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4289611711",
        "reason": "The job explicitly requires 'Sehr gute Kommunikationsfähigkeiten in Deutsch und Englisch' (Very good communication skills in German and English), which contradicts your preference to not show jobs that require both languages because you don't know German.",
        "body": " Du bist kreativ, kommunikativ und hast Lust, deine Skills in digitalen Technologien, IT-Prozessen oder innovativen Tools einzubringen? Dann bist du bei uns genau richtig!Dann bewirb dich jetzt initiativ und zeig uns, was du drauf hast! Wir suchen ständig motivierte Werkstudenten (m/w/d), die unsere Teams in Data &amp; AI, Cybersecurity, Automation, Projektmanagement, Software Development, Finance und mehr verstärken. Worauf wartest du? Werde zum Playmaker unseres Teams und mach' den Unterschied!Wir spielen eine Schlüsselrolle bei der Gestaltung der Energiewende, indem wir die digitale Transformation von E.ON in ganz Europa vorantreiben. Wir entwickeln kreative Ideen, gehen neue Wege, lassen Visionen Wirklichkeit werden und erwecken innovative Technologien zum Leben. Unser Ziel ist die Entwicklung und Bereitstellung nachhaltiger Technologielösungen, denn…… it‘s on us to make new energy work! Deine mögliche Rolle – sinnhaft &amp; wertvollI IT-Projektmanagement und Prozessautomatisierung Mitarbeit an Cybersecruity-Implementierungen Entwicklung von Power BI-Lösungen und Unterstützung im Full Stack DevelopmentMitarbeit an SAP-Projekten und FinanzdigitalisierungTeilnahme an Nachhaltigkeits- und DigitalisierungsprojektenDatenanalyse und Finanzreporting zur KPI-VerfolgungDein Profil – authentisch &amp; neugierig Eingeschriebener Student (m/w/d) in Informatik, MINT, Wirtschaftsinformatik, Wirtschaftswissenschaften, BWL mit IT-Schwerpunkt oder einem vergleichbaren StudiengangErste Erfahrungen in IT-Projekten, Datenanalyse oder Cybersecurity sind von VorteilKreativität, analytisches Denken und Interesse an der Arbeit mit digitalen Medien und TechnologienSelbstständige, strukturierte und proaktive Arbeitsweise sowie TeamgeistInteresse an nachhaltigen Themen und der digitalen TransformationSehr gute Kommunikationsfähigkeiten in Deutsch und EnglischUnsere Benefits – vielseitig &amp; durchdachtFreue dich auf Flexibilität: Bei uns kannst du Büroarbeit und Homeoffice miteinander kombinieren. Dank flexiblen Arbeitszeiten kannst du Uni und Job leicht vereinbaren. Entfalte deine Talente: Wir wachsen und möchten, dass du mit uns wächst. Wir bieten spannende Aufgaben und individuelle Lernmöglichkeiten.Genieße eine gerechte Bezahlung: Wir honorieren deine Leistung mit einer marktüblichen Vergütung.Vernetze dich: Nutze die Gelegenheit, dich in unseren Digital Empowerment Communities für Zusammenarbeit, Lernen und Netzwerkbildung zu engagieren.Tanke neue Energie: Bei uns hast du 30 Tage Urlaub pro Jahr plus Heiligabend und Silvester frei.Bewerbungsprozess:Um Teil unseres Talentpools bei der E.ON Digital Technology GmbH zu werden, schick uns bitte deinen Lebenslauf und deine aktuelle Immatrikulationsbescheinigung. Wenn du keine EU-Bürgerin bist, füge bitte auch deine gültige Arbeits- und Aufenthaltserlaubnis bei. Erzähle uns in deiner Bewerbung von deinen wichtigsten Fähigkeiten, Erfahrungen, Interessensgebieten und was du bei uns einbringen kannst. Wir prüfen deine Unterlagen sorgfältig und behalten sie bis zu drei Monate in unserem Talentpool, um dich bei passenden Stellen zu berücksichtigen. Dies umfasst auch Positionen, die aktuell noch nicht veröffentlicht sind, jedoch zu einem späteren Zeitpunkt ausgeschrieben werden. Sollten wir eine passende Stelle haben, senden wir dir eine Einladung zur Bewerbung auf diese Stelle zu.Sollten wir in diesem Zeitraum keine passende Position finden, erhältst du anschließend ebenfalls eine Rückmeldung.Hast Du noch Fragen?Für weitere Informationen wende Dich bitte an unser Postfach: EDT_Talent_Acquisition@eon.comBitte habe Verständnis dafür, dass wir aus datenschutzrechtlichen Gründen ausschließlich über unser Portal eingereichte Bewerbungen annehmen können. Bewerbungsunterlagen, die uns per E-Mail erreichen, können wir leider nicht berücksichtigen.Was Du sonst noch wissen solltest:Stellen-ID: 232606Beschäftigungsart: BefristetBeschäftigungsgrad: TeilzeitGesellschaft: E.ON Digital Technology GmbHArbeitsort: Essen, Hannover, München, Berlin, Würzburg, HamburgFunktionsbereich: Assistenz/Kaufmännische Angestellte; Agiles Arbeiten/Transformation; Beratung; Corporate Digital Technology; Cyber Security; Data / IoT; E-Mobility; Energiemanagement; Erneuerbare Energien; Finanzen/Rechnungswesen/Steuern; IT Infrastructure &amp; Services; IT Strategy &amp; Architecture; IT/Digitalisierung; Projektmanagement; System-/Netzführung/Störungsannahme; Telekommunikation/Nachrichtentechnik ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4221254915",
        "reason": "The job explicitly requires proficiency in both German and English ('sowohl auf Deutsch als auch auf Englisch'), which contradicts your preference to not show jobs requiring both languages. Furthermore, the role asks for 'Projektpraxis vorhanden' (existing project practice) and experience in administration projects, indicating it is not an entry-level working student or intern position as you requested.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4203244336",
        "reason": "The job explicitly requires both 'very good German and good English skills', which goes against your preference to exclude jobs requiring both. Additionally, it asks for 'practical experience' and 'professional experience' in the insurance industry, indicating it's not an entry-level 'working student' or 'intern' position.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Berate Kunden: Du berätst unsere Kunden im Bereich Versicherungen bei der Optimierung ihrer Kernprozesse im Rahmen der Einführung von in|sure Kernanwendungen. Steuere Anforderungen: Du verstehst die Kundenanforderungen und ermittelst Abweichungen zur Funktionsweise der Kernanwendungen aus technischer Sicht. Manage Schnittstellen: Auf Basis des Projektziels definierst du die Anpassungsbedarfe an Schnittstellen und kümmerst dich um die Umsetzung, um die Durchgängigkeit zwischen Anwendungen zu ermöglichen. Teste gewissenhaft: Dein Beitrag zu Integrations- und Systemtests ist entscheidend. Du agierst als Trusted Advisor im Abnahmetest des Kunden. Neues entdecken: Es macht dir Freude, dich beim Aufbau eines neuen Geschäftsfelds zu engagieren und kontinuierlich dein Wissen zu vertiefen. DEIN PROFIL Fundierte Ausbildung: Studium der Informatik oder Wirtschaftsinformatik; auch ein anderer Hintergrund ist möglichBerufserfahrung: Praktische Erfahrung in der Versicherungsbranche sowie gute Kenntnisse der Geschäftsprozesse einer Versicherung oder deren IT-Systeme und Schnittstellen helfen dir in deiner Consulting Rolle. Technologieaffinität: Freude an Technologien und IT, idealerweise Erfahrung bei der Einführung von Softwaresystemen in der Versicherungsbranche Konzeptionelle Fähigkeiten: Um tragfähige Lösungen in interdisziplinären Teams zu erarbeiten helfen dir deine ausgeprägten konzeptionellen und analytischen Fähigkeiten. Projektbegeisterung: Du hast Freude an Herausforderungen in Projekten, zudem Überzeugungskraft und Gestaltungswille. Sprachkenntnisse: Sehr gute Deutsch- und gute EnglischkenntnisseUnser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Research Center Trustworthy Data Science and Security",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4345751917",
        "reason": "The job explicitly requires 'good English and German skills (spoken and written)', which goes against your preference of not showing jobs that require both German and English.",
        "body": " Die Technische Universität Dortmund ist eine dynamische forschungsorientierte Universität mit 17 Fakultäten in den Natur- und Ingenieurwissenschaften sowie Gesellschafts- und Kulturwissenschaften. Auf unserem internationalen Campus leisten rund 6 700 Beschäftigte täglich einen Beitrag, um drängende Fragen der Gegenwart und der Zukunft zu lösen. Offenheit und Vielfalt prägen nicht nur das Miteinander in Forschung und Lehre, sondern auch in Technik und Verwaltung.Fachinformatiker*in / IT-Administrator*inDiese Stelle ist am Research Center Trustworthy Data Science and Security (RC Trust) zum nächstmöglichen Zeitpunkt unbefristet zu besetzen. Die Tätigkeit wird nach Entgeltgruppe 11 TV-L vergütet. Es handelt sich um eine Vollzeitstelle. Eine Beschäftigung in bzw. Reduzierung auf Teilzeit ist grundsätzlich möglich.Als Teil der Forschungsallianz Ruhr bietet das Research Center Trustworthy Data Science and Security die Expertise seiner Universitäten, um die Lücken zwischen Psychologie &amp; Sozialwissenschaften, Künstlicher Intelligenz &amp; Maschinellem Lernen, Data Science &amp; Statistischem Lernen sowie Cybersecurity &amp; Privacy zu schließen.Ihre Aufgaben Installation, Konfiguration und Administration von Soft- und Hardware einer Clusterumgebung inklusive Anbindung für verschiedene Betriebssysteme (Linux, MacOS, Windows)technischer Support für die Mitarbeitenden des RC Trust auf Deutsch und EnglischAuswahl, Bestellung und Testung benötigter Hardwarekomponenten (z. B. GPUs)Installation und Verwaltung von Spezialsoftwarepaketen sowie deren Optimierung, z. B. das GPU-Computing wie CUDA, PyTorch, TensorFlowVerwaltung der Fotos, Videos, Audioaufnahmen und Lichttechnik sowie Administration von Webseiten (TYPO3)Weiterentwicklung und Verwaltung von Open-Source-Projekten der Arbeitsgruppen (z. B. mit Python, R, GitHub)Management von ForschungsdatenWir bieten eine innovative Aufgabe an Forschungsprojekten in einem international anerkannten Forschungsumfeld im Bereich der zuverlässigen und vertrauenswürdigen Klein flexibles Arbeitszeitmodell für eine ausgewogene und familienfreundliche Work-Life-Balanceeine Position, mit der Sie Ihre Zukunft aufbauen können: als öffentliche Arbeitgeberin im Bereich Bildung bietet die TU Dortmund zukunftssichere Arbeitsplätzeein inklusives, faires und motivierendes Arbeitsklima mit einem technisch hochwertig ausgestatteten ArbeitsplatzIhre Qualifikationen ein abgeschlossenes Hochschulstudium der Informatik oder in einem verwandten Fach oder eine abgeschlossene Berufsausbildung im IT-Bereich und darauf aufbauende, mindestens dreijährige Berufserfahrunggute Englisch- und Deutschkenntnisse in Wort und SchriftDas bringen Sie idealerweise mit umfassende Kenntnisse in der Administration von Linux-ServernErfahrung mit Container-Technologien (z. B. Docker) und Job-Schedulern (z. B. Slurm)Know-how im Bereich der Netzwerkinfrastruktur und der Nutzerverwaltunghardwarenahe Kenntnisse (z. B. ESP32, Raspberry Pi, Robotik)Erfahrung in der Verarbeitung von Video-, Bild- und Tondateneine strukturierte, analytische und selbstständige Arbeitsweiseausgeprägte Team- und KommunikationsfähigkeitVielfalt willkommenWir fördern Vielfalt und Chancengleichheit. Überzeugen Sie uns mit Ihrer Persönlichkeit und Ihren Fachkenntnissen. Bewerbungen von Frauen werden entsprechend der gesetzlichen Regelungen bevorzugt behandelt. Zur Berücksichtigung einer Schwerbehinderung weisen Sie diese bitte durch geeignete Unterlagen nach.Mehr Informationen Finden Sie unter https://jobs.tu-dortmund.de/job/view/2175/fachinformatiker-in-it-administrator-in.Bei Interesse bewerben Sie sich bitte unter Angabe der Ref.-Nr. 127/25e mit Anschreiben, Lebenslauf und Zeugnissen über unser Bewerbungsportal (https://jobs.tu-dortmund.de/application/applicantRegisterCvAnalyzerGenerator/upload/2038?page_lang=de).Fragen? Beantwortet Ihnen Karolina Bihr gern unter der Tel. +49 (0) 231/755-8249Weitere Stellen finden Sie unter: https://karriere.tu-dortmund.deWas Sie darüber hinaus noch erwarten dürfen? – Hier finden Sie weitere Benefits der TU Dortmund Die Technische Universität Dortmund ist eine dynamische forschungsorientierte Universität mit 17 Fakultäten in den Natur- und Ingenieurwissenschaften sowie Gesellschafts- und Kulturwissenschaften. Auf unserem internationalen Campus leisten rund 6 700 Beschäftigte täglich einen Beitrag, um drängende Fragen der Gegenwart und der Zukunft zu lösen. Offenheit und Vielfalt prägen nicht nur das Miteinander in Forschung und Lehre, sondern auch in Technik und Verwaltung.Fachinformatiker*in / IT-Administrator*inDiese Stelle ist am Research Center Trustworthy Data Science and Security (RC Trust) zum nächstmöglichen Zeitpunkt unbefristet zu besetzen. Die Tätigkeit wird nach Entgeltgruppe 11 TV-L vergütet. Es handelt sich um eine Vollzeitstelle. Eine Beschäftigung in bzw. Reduzierung auf Teilzeit ist grundsätzlich möglich.Als Teil der Forschungsallianz Ruhr bietet das Research Center Trustworthy Data Science and Security die Expertise seiner Universitäten, um die Lücken zwischen Psychologie &amp; Sozialwissenschaften, Künstlicher Intelligenz &amp; Maschinellem Lernen, Data Science &amp; Statistischem Lernen sowie Cybersecurity &amp; Privacy zu schließen.Ihre AufgabenWir bietenIhre QualifikationenoderDas bringen Sie idealerweise mitVielfalt willkommenWir fördern Vielfalt und Chancengleichheit. Überzeugen Sie uns mit Ihrer Persönlichkeit und Ihren Fachkenntnissen. Bewerbungen von Frauen werden entsprechend der gesetzlichen Regelungen bevorzugt behandelt. Zur Berücksichtigung einer Schwerbehinderung weisen Sie diese bitte durch geeignete Unterlagen nach.Mehr Informationen Finden Sie unter https://jobs.tu-dortmund.de/job/view/2175/fachinformatiker-in-it-administrator-in.Bei Interesse bewerben Sie sich bitte unter Angabe der Ref.-Nr. 127/25e mit Anschreiben, Lebenslauf und Zeugnissen über unser Bewerbungsportal (https://jobs.tu-dortmund.de/application/applicantRegisterCvAnalyzerGenerator/upload/2038?page_lang=de).Fragen? Beantwortet Ihnen Karolina Bihr gern unter der Tel. +49 (0) 231/755-8249Weitere Stellen finden Sie unter: https://karriere.tu-dortmund.deWas Sie darüber hinaus noch erwarten dürfen? – Hier finden Sie weitere Benefits der TU Dortmund",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "OGE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344679699",
        "reason": "The job explicitly requires 'sehr gute Deutschkenntnisse, mindestens Level C1 oder vergleichbar' (very good German skills, at least C1 level or comparable), and the user has stated that they do not know German.",
        "body": " UnternehmensbeschreibungSeit über 25 Jahren zählt GasLINE zu den führenden LWL-Infrastrukturanbietern in Deutschland. 1996 erfolgte die Gründung der GasLINE durch zahlreiche Fern- und Regionalgasgesellschaften. Die Basis: Ein hochmodernes Glasfasernetz, das über weite Strecken im Schutzstreifen der Gashochdruckleitungen der Gründungsgesellschafter verläuft und damit besonders sicher vor physischen Gefahren ist. GasLINE bietet unbeschaltete Glasfaserkapazitäten. In 2025 sind es 65.000 Kilometer Netzinfrastruktur, die vermarktet wird. Bis 2029 werden weitere 5.000 Kilometer Backbone ausgebaut.StellenbeschreibungAls Werkstudent (m/w/d) in der IT unterstützt du unser Team bei zentralen Aufgaben rund um Datenmanagement, Datenpflege, Dokumentation im SharePoint sowie im Lizenz- und Testmanagement. Du arbeitest eng mit den IT‑Fachbereichen zusammen und trägst dazu bei, unsere Systeme und Prozesse effizient und aktuell zu halten. Dabei übernimmst du folgende Aufgaben: Pflege, Strukturierung und Validierung von Daten in internen SystemenDurchführung von Analysen zur Sicherstellung einer hohen DatenqualitätErfassung, Prüfung und Aktualisierung von Stammdaten im ERP-SystemRegelmäßige Qualitätschecks zur Sicherstellung von Konsistenz und VollständigkeitMitarbeit bei der Optimierung von Datenprozessen und WorkflowsUnterstützung bei der Verwaltung von Softwarelizenzen, Dokumentation und Nachverfolgung von Lizenzbeständen, sowie HardwarekomponentenMitarbeit bei Softwaretests (z. B. Funktions‑, Integrations‑ oder Regressionstests), sowie deren Auswertung und NachbereitungAktualisierung bestehender Betriebshandbücher und technischer Dokumentationen im SharePointQualifikationen Du bist immatrikulierter Student (m/w/d) mit Affinität zu IT-Systemen.Du verfügst über sehr gute MS Office Kenntnisse und setzt diese gekonnt ein.Eine gewissenhafte Arbeitsweise zeichnet Dich aus und ist insbesondere für die ausgeschriebene Stelle unentbehrlich.Mit Deiner eigenverantwortlichen, strukturierten und sorgfältigen Arbeitsweise wirst Du schnell zu einer guten Unterstützung und bringst Dich ein.Du arbeitest gerne im Team und unterstützt Deine Kolleg:innen bei anfallenden Aufgaben.Du bringst sehr gute Deutschkenntnisse, mindestens Level C1 oder vergleichbar, mit.Zusätzliche InformationenUnsere Benefits für Dich: Faire Konditionen: Dein Einsatz bei uns soll der beruflichen Orientierung dienen und Dich auf den Berufseinstieg vorbereiten Flexible Arbeitszeiten, um den Unialltag und Berufseinstieg miteinander zu kombinierenGute fachliche Einarbeitung und ein sympathisches, engagiertes und kollegiales TeamGasLINE-UnternehmenseventsMobile Office MöglichkeitenDer obligatorische Obstkorb inkl. Wasser und Kaffee für das leibliche Wohl Und viele weitere Benefits findest Du hier: gasline.de/karriere Wir begrüßen die Bewerbung von Menschen mit Behinderung, deren Integration uns ein besonderes Anliegen ist.Wir freuen uns auf deine Bewerbungsunterlagen und darauf, gemeinsam die Welt zu einem besseren Ort zu machen. Für jede eingegangene Bewerbung pflanzen wir einen Baum mit Plant-My-Tree und setzen ein Zeichen für eine grünere Zukunft. GasLINEBereich PersonalAmanda Kosmrlipersonal@gasline.deKlicke auf den Button unten, um den Bewerbungsprozess zu starten.Du hast Fragen zum Bewerbungsprozess? Dann wende Dich gerne an uns.Hier bewerben ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4283067886",
        "reason": "The job explicitly requires both German and English language skills ('sowohl auf Deutsch als auch auf Englisch'), which contradicts your preference of not showing jobs that require both. Additionally, the role's responsibilities and requirements (e.g., 'Projektpraxis vorhanden', 'Strategie beraten', 'IT-Lösungen entwickeln') suggest a professional level beyond an entry-level working student or intern position, which you are seeking.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Kaiserswerther Diakonie",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4329282305",
        "reason": "The job is for an 'enrolled student', aligning with the preference for entry-level working student/intern roles. It is not a dual study program and involves corporate-like administrative tasks. Crucially, while the description is in German, it does not explicitly state that German language skills are required, thus meeting the user's specific language preference.",
        "body": " Unsere Pluspunkte Eine strukturierte EinarbeitungEin vielseitiges Aufgabengebiet in einem engagierten TeamMöglichkeit zur fachlichen und persönlichen WeiterentwicklungWas Sie erwartet Sie wirken bei der Vorbereitung von Weiterbildungsveranstaltungen: z.B. Vorbereitung und Pflege von E-didaktik Räumen mitSie unterstützen bei der Durchführung von Weiterbildungen, z.B. Rechnungsversand, Zertifikatserstellung &amp; Versand sowie DatenpflegeSie unterstützen bei der Erstellung und Auswertung der Evaluation von WeiterbildungsangebotenSie helfen bei der Vorbereitung, Durchführung und Nachbereitung von FachtagungenWas Sie mitbringen Sie sind eingeschriebene:r Student:inSie verfügen über Kenntnisse im Umgang mit MS-Office AnwendungenSie besitzen eine gute Kommunikations-, Organisations- und TeamfähigkeitEine sorgfältige und zuverlässige Arbeitsweise zeichnet Sie ausSie haben Fragen zur Ausschreibung?FrauVarinija HoltschmidtReferentin für Personal, IT und interne KommunikationTelefon+49 211 409 3225 ",
        "job_sum": {
            "Job Title": "Student Assistant / Working Student (implied)",
            "Responsibilities": [
                "Assist with the preparation of further training events (e.g., preparing and maintaining e-didactic rooms).",
                "Support the execution of further training (e.g., invoice dispatch, certificate creation & dispatch, data maintenance).",
                "Assist with the creation and evaluation of further training offers.",
                "Help with the preparation, execution, and follow-up of specialist conferences."
            ],
            "Requirements": [
                "Enrolled student.",
                "Knowledge of MS Office applications.",
                "Good communication, organizational, and teamwork skills.",
                "Careful and reliable working style."
            ],
            "Location": "Not specified in the job description (Kaiserswerther Diakonie is located in Düsseldorf, Germany).",
            "Language Needs": "Not explicitly stated as a requirement, but the job description is in German."
        },
        "is_match": true
    },
    {
        "title": "Amadeus Fire",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344659294",
        "reason": "The job explicitly states that 'Sichere mündliche und schriftliche Kommunikationsfähigkeiten in Deutsch und Englisch sind erforderlich (Mindestens B2-Niveau)' (Secure oral and written communication skills in German and English are required (at least B2 level)). This directly contradicts your preference of not showing jobs that require both German and English.",
        "body": " Referenz 16-235830Auf der Suche nach einer neuen beruflichen Herausforderung? Möchten Sie Ihre Fähigkeiten und Talente in einem dynamischen Unternehmen einbringen? Dann haben wir genau das Richtige für Sie!Für ein Unternehmen aus der Dienstleistungsbranche suchen wir im Düsseldorfer Raum im Rahmen der direkten Personalvermittlung in Festanstellung einen engagierten IT Support Specialist (m/w/d) in Düsseldorf.Ihre Benefits Eine sichere Festanstellung in Vollzeit mit Zusatzleistungen (z. B. Bezuschussung des Deutschland-Tickets)Für Ihre Fitness pflegen wir eine Firmenkooperation mit Sport- und FitnessanbieternEine hervorragende Work-Life-Balance durch flexible Arbeitszeiten und einem Homeoffice-AnteilSehr gute Arbeitsbedingungen und ein offenes ArbeitsklimaFür Ihre Entwicklung bieten wir regelmäßige Schulungen und Weiterbildungen anAbschluss einer betrieblichen Altersvorsorge, damit Sie für Ihre Zukunft vorsorgen könnenAttraktives Jahresgehalt von bis zu 47.000 EuroIhre Aufgaben Aktive Unterstützung der Anwender bei Anwendungen (remote und vor Ort)Bearbeitung von Service-Desk-Anfragen per Telefon und E-MailDurchführung von Einführungs- und SchulungssegmentenErstellung, Pflege und Weiterentwicklung von Prozess- und Systemdokumentationen, Handbüchern und NutzungsleitfädenÜberwachung, Priorisierung und Eskalation von TicketsSystematische Erfassung und Klassifizierung von Hardware- und Software-StörungenIhr Profil Erfolgreich abgeschlossene Ausbildung/ Studium im Bereich IT oder eine vergleichbare QualifikationFundierte Kenntnisse von Windows 10/11, Microsoft-Services und ProzessautomatisierungSehr gutes Verständnis verschiedener Cloud-Dienste und -TechnologienBevorzugt vorhandene Microsoft-Zertifizierungen wie MCSA oder MCSE bzw. ähnliche nachweisbare KompetenzenSichere mündliche und schriftliche Kommunikationsfähigkeiten in Deutsch und Englisch sind erforderlich (Mindestens B2-Niveau)Weitere Details Vertragsart: Personalvermittlung, (40 Stunden/Woche)Branche: RechtKarrierestufe: Entry LevelGehaltsrahmen: 40.000 bis 47.000 EUR/JahrHomeoffice-OptionDie Amadeus Fire AG ist Ihr spezialisierter Personaldienstleister im kaufmännischen und IT-Bereich. An über 20 Standorten bundesweit finden täglich Fach- und Führungskräfte mit unserer Hilfe eine neue berufliche Herausforderung.Ihre Vorteile In Der Zusammenarbeit Mit Amadeus Fire Ohne Anschreiben einfach bewerbenPersönliche Betreuung und CoachingEine Bewerbung, zahlreiche Möglichkeiten35 Jahre Erfahrung100% kostenlos für BewerberFür einen ersten vertraulichen Kontakt steht Ihnen Monika Merz (Tel +49 (0) 211 828934-21) gerne zur Verfügung. Wir freuen uns auf Ihre Bewerbung per Online-Formular oder unter Angabe der Referenznummer 16-235830 per E-Mail an: it.duesseldorf@amadeus-fire.deAmadeus Fire AGNiederlassung DüsseldorfBennigsen-Platz 140474 Düsseldorf#Supporter ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "HENDRICKS, ROST & CIE. GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4345992460",
        "reason": "The job explicitly requires both fluent German and confident English, which the user does not know. Additionally, it requires 'at least two years' of experience in Microsoft SQL Server modeling and 'very good knowledge' in BI solution implementation, making it not an entry-level, working student, or intern position as preferred by the user.",
        "body": " Bist du auch immer zwei Sachen in einem? Technologieaffin &amp; visionär? Leidenschaftlich in der Entwicklung &amp; bei klarem Verstand? Kreativ &amp; dennoch mit unternehmerischer Denke? Organisiert &amp; trotzdem improvisationsstark? Jeder Mensch hat unterschiedliche Talente und Eigenschaften, die einen großen Mehrwert darstellen, wenn man sie richtig nutzt und zusammenstellt. So wie bei uns. Denn hier gilt: Das &amp; entscheidet.WIR – Wer wir sind? Die Experten für Information &amp; Organisation!HENDRICKS, ROST &amp; CIE. – Wir sind die Experten für Information &amp; Organisation. Wir sind die Düsseldorfer Unternehmensberatung für Business Intelligence, Prozessberatung &amp; Organisationsentwicklung. Wir unterstützen unsere Kunden dabei, die Chancen der Digitalisierung wirkungsvoll zu nutzen und so eine langfristig erfolgreiche Marktposition zu erreichen. Dazu arbeiten wir mit technologischen Spitzenprodukten von namhaften Herstellern wie z.B. Microsoft, IBM, Jedox, Apliqo – für eine zielgerichtete und bessere Entscheidungsfindung.AufgabenDU &amp; WIR – Was du bei uns machst? Business &amp; Intelligence! Du begleitest unsere Kunden vor Ort in vielfältigen Projekten und branchenübergreifend bei der Einführung von Planungs-, Analyse- &amp; Reporting-Lösungen.Du übernimmst die technische wie auch kaufmännische Projektleitung von Projekten.Darüber hinaus konzipierst du ETL-Schnittstellen und modellierst Datenmodelle.Neben der Konzeption von Datenmigrationsstrategien und der Entwicklung der entsprechenden ETL-Strecken zur Datenübernahme / Migration der Daten in ein neues Bestandssystem, übernimmst du Designs und Entwicklung der ETL-Stecken.Mit deinem Team und dem Kunden gestaltest du gemeinsam fachliche und technische Konzepte, die anschließend von euch umgesetzt werden.Dabei erarbeitest du Schnittstellen zu Vorsystemen, erstellst kundenindividuelle OLAP-Modelle und aussagekräftige Reports.Du schaffst mit deinem Team einen spürbaren Mehrwert für das Kundenunternehmen.Nicht zuletzt bringst du kontinuierlich innovative Impulse aus dem Markt in deinen Arbeitsalltag ein und sicherst damit unsere Zukunftsfähigkeit.QualifikationDU – Was dich ausmacht? Kompetenz &amp; Persönlichkeit! Du hast dein Studium der Wirtschaftswissenschaften / -informatik oder Informationstechnik erfolgreich abgeschlossen oder verfügst über eine vergleichbare Ausbildung.Du verfügst über sehr gute Kenntnisse in der Implementierung von Business Intelligence (BI)-Lösungen.Du hast bereits Erfahrungen (mindestens zwei Jahre) mit Microsoft SQL-Server-Modellierung sammeln können.Du bringst gute ETL-Kenntnisse in den gängigen BI-Plattformen mit, wie z.B.: MS SQL inkl. SSIS oder vergleichbare Technologien (z.B. Talend, Theobald).Erfahrung mit OLAP-Datenbanken, wie Planning Analytics (TM1) und Jedox, sind wünschenswert.Du bist wissensdurstig, teamfähig und neugierig, wie Unternehmen und Geschäftsmodelle funktionieren.Die Digitalisierung siehst du als Chance und möchtest Unternehmen dabei unterstützen, ihre Daten entscheidungsrelevant zu nutzen.Du teilst dein Wissen gerne mit anderen und bringst die notwendige Bereitschaft zur Mobilität in Kundenprojekten mit.Du sprichst fließend Deutsch. Auch Englisch beherrschst du sicher.BenefitsWIR &amp; DU – Was wir dir bieten? Zusammenhalt &amp; Entwicklung! Wir bieten dir eine individuelle Einarbeitung und Entwicklung als Mensch und Berater.Bei uns hast du einen Ansprechpartner, der immer für dich da ist.Wir bieten dir finanzielle Sicherheit durch einen unbefristeten Arbeitsvertrag.Wir sorgen für individuelle Weiterbildungs- &amp; Entwicklungsmöglichkeiten im Unternehmen.Mit unserer digitalen Essensmarke bieten wir dir einen Zuschuss zum Mittagessen.Bleib flexibel dank mobiler Arbeit, Firmenfahrrad &amp; BahnCard.Feier mit uns auf Firmenveranstaltungen, wie den jährlichen Entscheidungswegen, der Late Summer Party &amp; unseren Strategietagen.Werde Teil eines kollegialen und loyalen Teams, in dem das Arbeiten Spaß macht.Arbeite in angenehmer Atmosphäre in unserem modernen Büro direkt am Rhein, das im Sommer klimatisiert ist.Was uns gemeinsam antreibt: Neugier &amp; Wissen!Wir glauben an den Dreiklang aus Technologie, Fachlichkeit und Organisation. Jeder unserer Mitarbeiter verfügt über ganz spezielles Wissen und Know-how. Durch heterogene Teamkonstellationen und maximale Kooperationsbereitschaft wird ein Höchstmaß an unterschiedlichem Wissen eingebracht, das den Projekterfolg beschleunigt. Einzel-Expertentum beflügelt bei uns das große Ganze.Wie du nun Teil unseres Teams wirst? Bewerben &amp; überzeugen!Melde dich bei uns. Erzähle uns von deinen Zielen und lass uns deine berufliche und persönliche Entwicklung gemeinsam gestalten!Dein Ansprechpartner Johannes Harzheim freut sich auf deine aussagekräftige Bewerbungsunterlagen.Für Fragen stehen wir dir jederzeit auch telefonisch zur Verfügung unter:+49 211 545 546 090. Bist du auch immer zwei Sachen in einem? Technologieaffin &amp; visionär? Leidenschaftlich in der Entwicklung &amp; bei klarem Verstand? Kreativ &amp; dennoch mit unternehmerischer Denke? Organisiert &amp; trotzdem improvisationsstark? Jeder Mensch hat unterschiedliche Talente und Eigenschaften, die einen großen Mehrwert darstellen, wenn man sie richtig nutzt und zusammenstellt. So wie bei uns. Denn hier gilt: Das &amp; entscheidet.WIR – Wer wir sind? Die Experten für Information &amp; Organisation!HENDRICKS, ROST &amp; CIE. – Wir sind die Experten für Information &amp; Organisation. Wir sind die Düsseldorfer Unternehmensberatung für Business Intelligence, Prozessberatung &amp; Organisationsentwicklung. Wir unterstützen unsere Kunden dabei, die Chancen der Digitalisierung wirkungsvoll zu nutzen und so eine langfristig erfolgreiche Marktposition zu erreichen. Dazu arbeiten wir mit technologischen Spitzenprodukten von namhaften Herstellern wie z.B. Microsoft, IBM, Jedox, Apliqo – für eine zielgerichtete und bessere Entscheidungsfindung.DU &amp; WIR – Was du bei uns machst? Business &amp; Intelligence!DU – Was dich ausmacht? Kompetenz &amp; Persönlichkeit!WIR &amp; DU – Was wir dir bieten? Zusammenhalt &amp; Entwicklung!Was uns gemeinsam antreibt: Neugier &amp; Wissen!Wir glauben an den Dreiklang aus Technologie, Fachlichkeit und Organisation. Jeder unserer Mitarbeiter verfügt über ganz spezielles Wissen und Know-how. Durch heterogene Teamkonstellationen und maximale Kooperationsbereitschaft wird ein Höchstmaß an unterschiedlichem Wissen eingebracht, das den Projekterfolg beschleunigt. Einzel-Expertentum beflügelt bei uns das große Ganze.Wie du nun Teil unseres Teams wirst? Bewerben &amp; überzeugen!Melde dich bei uns. Erzähle uns von deinen Zielen und lass uns deine berufliche und persönliche Entwicklung gemeinsam gestalten!Dein Ansprechpartner Johannes Harzheim freut sich auf deine aussagekräftige Bewerbungsunterlagen.Für Fragen stehen wir dir jederzeit auch telefonisch zur Verfügung unter:+49 211 545 546 090.",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "DLL",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4345599410",
        "reason": "The job requires proven experience and specific advanced skills such as 'Proven experience in supporting an organization to become more data literate', 'Proven experience in translating and setting up a framework', a 'Process Management mindset (preferably BlackBelt)', and 'Proven change management skills'. This indicates it is not an entry-level position like a working student or intern, which goes against your preference for only entry-level jobs.",
        "body": " Job DescriptionData and Process Mining AnalystResponsibilitiesAs a Data and Process Mining Analyst you will be part of the Transformation Group EU reporting to one of the Area Leads. The Transformation Group EU is responsible for the transformation related to process, product and systems in the region Europe and will work closely with the markets to achieve goals: Deliver new strategic capabilities aligned with strategic priorities Improve and Standardize processes, products, data and technology Ensure Business Continuity Lifecycle Management, Information Security, regulatory compliance As a Data and Process Mining Analyst you will support the Area in having fact-based insights in the performance of the processes and related KPIs. In this role, you work closely together with analysts and ops managers in our local markets. You get insight in their reporting needs, and can create value by delivering (process mining) analysis and dashboards based on these needs. You collaborate with the squads to ensure that the appropriate data can be derived from the source systems and ultimately be presented in an understandable way.Moreover, you support the area and squads in interpreting the data and advise them on process improvement opportunities. Next to this, your focus will be on supporting not only the area and squads but also the local markets in using the data to enable business improvements.Find out more here about how you can unleash your full potential at DLLDay To Day Translate EU Group KPI's into Process measurement points Advise and support system teams within the Area on applying clearly defined and uniform system measurement logs (time stamps) Form a (virtual) Community of Practice around data analysis and process mining with relevant stakeholders from the Market OPS functions and build governance around the use and adoption of the tools for this CoP. Ensure measurement can take place across the entire life cycle of a contract (from quote to application to contract until end-of-lease) Analysis of data in support of decision making on products and services in the context of further standardization and removing non-value add variances Cooperate with Business Change &amp; Process Owners and Product Owners on continuous measurement processes and creating insight in process flows. Cooperate with Financial Product Management on creating insights into actual usage of specific products &amp; service variances. Cooperate with Market OPS functions on creating insights in actual usage of process flows deviating from the designed flow, including root cause analysis. Cooperate with Market IT stacks not being part of the formal EU Group structure and support measurements and analysis across their specific Product, Service and Process chains. Connect and align with other user groups within DLL and Rabobank on specific analysis tooling (a.o. Celonis, PowerBI) As a member of the Data Analysis and Process Mining scrum team, deliver value based on quarterly goals. All members enjoy Two working days per year volunteering for a local charity. Health and Wellness program including healthy food, free health checks, fun health &amp; vitality activities. Flexible hours with possibility to work from home Career development opportunities: online learning, member development programs. Click this link for an overview of all the benefits in your region. We are creating a group of talents and will transform business and technology into one business-oriented organization with best use of technology and superb customer and members satisfaction.Essentials A skilled and enthusiastic Business Intelligence professional Proven experience in supporting an organization to become more data literate Proven experience in translating and setting up a framework in which the ‘global’ strategic KPIs are translated into operational KPIs for the teams in the markets and for the squads. Strong ability to design and implement dashboards from an end-user perspective. Ability to analyze data and presents it in a way that it tells a story. Excellent Analytical skills and Helicopter view Good verbal communication skills Fluent English (Lean and SixSigma) Process Management mindset (preferably BlackBelt) Proven change management skills and able to enthusiastically drive and lead a CoP. Extras Knowledgeable of financial industry and especially of vendor finance business model Experience working in an international environment. Experience working with Celonis (or any other process mining tool) and/or PowerBI Choose wellbeingDLL’s wellbeing ambition is to educate, equip and empower members to build connections, manage their mental, emotional, physical and financial wellness and maintain balance between work and the other priorities that make up their lives.Our Four Wellbeing Categories Are As Follows Connection – Build meaningful connections with other DLL members Health – Manage mental, emotional and physical health Finance – Provide learning opportunities to help members achieve personal financial health Lifestyle – Maintain balance between work and life priorities These are the things that matter to our members and the wellbeing of our members matters to DLLGood To Know Deadline for application: January 31st (Due to high volume of applications this requisition may close prior to posted close date) The selection process may involve an assessment Applications via email will not be reviewed. Please apply online via our career website DLL’s referral program applies For more information, please contact our Talent Acquisition Partner Omnia Hassan via omnia.hassan@dllgroup.com DLL appreciates the time you spend applying to our openings. We advise only those who qualify for an interview will be contacted. Hiring subject to successful completion of a background check.DLL is an equal opportunity employer. We are committed to inclusive, barrier-free recruitment and selection processes and work environments. If contacted for an employment opportunity, please advise Human Resources if you require accommodation in accordance with our values and all applicable legislation.About UsDLL, a great place to build your careerDLL is a global asset finance company that partners with manufacturers, dealers, distributors, and end users to facilitate access to equipment and technology. Headquartered in Eindhoven, the Netherlands, we operate in over 25 countries, offering financial solutions across various industries. We are also a 100% subsidiary of our parent company Rabobank, one of the world’s largest financial companies. Join our community of over 6.000 members from 75 nationalities! At DLL, our unique culture — shaped by our values (We put our customers first -Together we achieve more-You can count on me - I challenge myself and others to grow) and behaviors that define us — is at the heart of everything we do.We offer exciting job opportunities where you feel welcomed, respected and empowered to be your authentic self and share your best ideas. At DLL, we believe in the strength of our diverse perspectives and experiences, which make our global community thrive.You’ll receive competitive pay, generous benefits, health and wellbeing support, and manage your work-life balance through our hybrid working flexibility.Our global operations offer you a variety of development opportunities and we encourage you to take on new challenges across our departments, businesses and regions.Our company strategy emphasizes our commitment to sustainable business and making social impact is part of that as well. Together, we’ll “Partner for a better world” to make a positive impact. Joining DLL, means joining a company that consistently scores higher than the industry average in Employee Engagement surveys. This is also being acknowledged through many Great Place to Work certificates. People who work at DLL, like DLL.Join us in Partnering for a better world! ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Henkel",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328749827",
        "reason": "The job is an entry-level internship/working student position, which aligns with the user's request for 'entry jobs like working student or intern jobs'. It requires a student currently pursuing a bachelor's or master's degree, which the user fits as they have a bachelor's and are pursuing a master's. The responsibilities clearly indicate a corporate role focused on sustainability and data analysis, not cleaning or bar staff. The language requirement explicitly states 'Excellent written and verbal communication skills in English language' and does not mention German, which is acceptable per the user's preference. It is not a dual study program.",
        "body": " About This Position What you´ll do Advise, support and train bus partners and requesters on reduction potentials in line with methodological standards and towards circularity and packaging topics Collect and collate data, conduct checks and aggregate KPIs, according to regulations/standards and internal Henkel policies Provide feedback and enable data owners on data accuracy, completeness and quality by creating awareness and direction Define calculation methodologies, ensuring compliance with international accounting, reporting standards and internal strategy Prepare KPIs to reporting schedules and reports that offer insights to help stakeholders make informed decisions Work in gremium and engage in advocacy efforts to drive ESG data initiatives with internal and external stakeholders Provide subject matter expertise for the development of automation and visualization tools Support transversal projects and duties in the field of data analytics. What makes you a good fit Student currently pursuing a bachelor´s or master’s degree in topics related to sustainability and data analysisInterest and prior exposure to sustainability, reporting frameworks, sustainability accounting and regulatory complianceStrong analytical and problem-solving skills, with the ability to interpret complex data and translate it into actionable insightsExcellent written and verbal communication skills in English languageFirm knowledge in data alaysis and visualisationExperience in data and project managementStrong interpersonal skills and a proactive attitude with ability to work collaboratively in a cross-functional team environment Some perks of joining Henkel Flexible work scheme with flexible hours, hybrid work modelDiverse national and international growth opportunitiesGlobal wellbeing standards with health and preventive care programsAttractive RemunerationGlobal ExperienceInterns CommunityWe offer you an attractive salary between € 1050-2270. The exact amount of the remuneration depends on the desired duration, the type of internship (voluntary or mandatory) and existing degrees.At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different genders, origins, cultures, religions, sexual orientations, generations and disabilities. If there are any specific accommodations or adjustments you require for the interview process or your on-site appointment, please inform us, and we'll do our best to accommodate your requests. ",
        "job_sum": {
            "Job Title": "Intern / Working Student in Sustainability & Data Analysis",
            "Responsibilities": [
                "Advise, support, and train business partners on reduction potentials in line with methodological standards towards circularity and packaging topics.",
                "Collect and collate data, conduct checks, and aggregate KPIs according to regulations/standards and internal Henkel policies.",
                "Provide feedback and enable data owners on data accuracy, completeness, and quality.",
                "Define calculation methodologies, ensuring compliance with international accounting, reporting standards, and internal strategy.",
                "Prepare KPIs to reporting schedules and reports that offer insights for stakeholders.",
                "Work in gremium and engage in advocacy efforts to drive ESG data initiatives.",
                "Provide subject matter expertise for the development of automation and visualization tools.",
                "Support transversal projects and duties in the field of data analytics."
            ],
            "Requirements": [
                "Student currently pursuing a bachelor’s or master’s degree in topics related to sustainability and data analysis.",
                "Interest and prior exposure to sustainability, reporting frameworks, sustainability accounting, and regulatory compliance.",
                "Strong analytical and problem-solving skills.",
                "Excellent written and verbal communication skills in English language.",
                "Firm knowledge in data analysis and visualization.",
                "Experience in data and project management.",
                "Strong interpersonal skills and a proactive attitude with ability to work collaboratively in a cross-functional team environment."
            ],
            "Location": "Not explicitly stated in the job description.",
            "Language Needs": "Excellent written and verbal communication skills in English language."
        },
        "is_match": true
    },
    {
        "title": "Inverto | A BCG Company",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4320964155",
        "reason": "The job description explicitly states a requirement to communicate in both German and English ('kommunizierst auf Deutsch und Englisch'), which goes against your preference to not be shown jobs that require both languages.",
        "body": " Bei Inverto sind wir auf strategischen Einkauf und Supply Chain Management spezialisiert. Wir arbeiten weltweit mit führenden Unternehmen zusammen, entwickeln transformative Strategien und setzen diese gemeinsam mit unseren Kunden um. Und das kannst du auch – mit unserem anhaltenden Erfolg hast du die Chance, gemeinsam mit uns zu wachsen. In unseren Teams stehen Zusammenarbeit, offener Austausch und das Feiern gemeinsamer Erfolge im Mittelpunkt. Du wirst Teil eines großartigen Umfelds, das dir den Raum gibt, dich weiterzuentwickeln und erfolgreich zu sein. Es gab nie einen besseren Zeitpunkt, um einzusteigen und mit uns die Zukunft zu gestalten. Bist du dabei?How You'll Impact.Analyse und Optimierung der Toolnutzung. Du unterstützt die Analyse, wie bestehende Tools (Office, AI sowie Kollaborations- und Management-Tools) optimal genutzt werden können, um die Effizienz von persönlichen Arbeitsweisen und unseren Projektteams zu steigern. Entwicklung einer optimalen Tool-Strategie. Du wirkst an der Gestaltung von Best Practices und Konzepten mit, um die verschiedenen Anwendungen sinnvoll miteinander zu verknüpfen. Dafür bereitest du Präsentationen oder Dokumentationen auf, die eine direkte Anwendung dieser Best Practices in unseren Teams ermöglichen.Radar für neue Tools und KI-Anwendungen. Neue digitale Tools und KI-Features behältst du im Blick und bewertest deren Potenzial für uns. Dabei begleitest du Testgruppen, bereitest Tests methodisch vor und sammelst strukturiert Feedback. Deine Arbeit unterstützt auf diese Weise eine fundierte Entscheidungsfindung zur Einführung neuer Technologien.Dynamische Zusammenarbeit. Um spezifische Anforderungen zu verstehen und passgenaue Lösungen zu entwickeln, arbeitest du eng mit verschiedenen Fachbereichen zusammen. Ein motiviertes und erfahrenes Team unterstützt dich in einem professionellen und wertschätzenden Arbeitsumfeld, sodass du fachlich und persönlich wachsen kannst.What You'll Bring.Du bist Student:in, idealerweise in den Bereichen Wirtschaft, Informatik, Medien, Kommunikation oder einem anderen Fachgebiet mit relevantem Bezug.Du hast ausgeprägtes Interesse an Tool-Features im Bereich Collaboration und eignest dir Themen schnell an. Idealerweise hast du erste Praxis mit relevanten Anwendungen (z.B. Microsoft 365/Teams/SharePoint, Miro, AI) gesammelt.Du arbeitest strukturiert und analysierst sauber. Inhalte kannst du adressatengerecht aufzubereiten, sodass andere sie schnell verstehen und nutzen können.Du bist kommunikationsstark und teamorientiert, trittst im internationalen Umfeld sicher auf und kommunizierst auf Deutsch und Englisch.TOGETHER, WE BENEFIT. Trainingsangebote, die dir helfen, dich weiterzuentwickeln und als vollwertiges Teammitglied erfolgreich zu seinZugang zu Mental Coaching, um dein Wohlbefinden, deine Resilienz und dein persönliches Wachstum zu fördernEin attraktives Mitarbeiterempfehlungsprogramm, um mit deiner Hilfe unser Team wachsen zu lassenSaisonale Feiern, Teamevents und Get-Together, um die Zusammenarbeit zu stärken und Erfolge zu feiern APPLY NOW! ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4203244333",
        "reason": "The job explicitly requires 'Sehr gute Deutsch- und gute Englischkenntnisse' (Very good German and good English skills). Your preference states: 'If the job says that it requires german and english, do not show it.' Additionally, the job asks for 'Praktische Erfahrung in der Versicherungsbranche' (Practical experience in the insurance industry), which does not align with your preference for 'only entry jobs like working student or intern jobs'.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Berate Kunden: Du berätst unsere Kunden im Bereich Versicherungen bei der Optimierung ihrer Kernprozesse im Rahmen der Einführung von in|sure Kernanwendungen. Steuere Anforderungen: Du verstehst die Kundenanforderungen und ermittelst Abweichungen zur Funktionsweise der Kernanwendungen aus technischer Sicht. Manage Schnittstellen: Auf Basis des Projektziels definierst du die Anpassungsbedarfe an Schnittstellen und kümmerst dich um die Umsetzung, um die Durchgängigkeit zwischen Anwendungen zu ermöglichen. Teste gewissenhaft: Dein Beitrag zu Integrations- und Systemtests ist entscheidend. Du agierst als Trusted Advisor im Abnahmetest des Kunden. Neues entdecken: Es macht dir Freude, dich beim Aufbau eines neuen Geschäftsfelds zu engagieren und kontinuierlich dein Wissen zu vertiefen. DEIN PROFIL Fundierte Ausbildung: Studium der Informatik oder Wirtschaftsinformatik; auch ein anderer Hintergrund ist möglichBerufserfahrung: Praktische Erfahrung in der Versicherungsbranche sowie gute Kenntnisse der Geschäftsprozesse einer Versicherung oder deren IT-Systeme und Schnittstellen helfen dir in deiner Consulting Rolle. Technologieaffinität: Freude an Technologien und IT, idealerweise Erfahrung bei der Einführung von Softwaresystemen in der Versicherungsbranche Konzeptionelle Fähigkeiten: Um tragfähige Lösungen in interdisziplinären Teams zu erarbeiten helfen dir deine ausgeprägten konzeptionellen und analytischen Fähigkeiten. Projektbegeisterung: Du hast Freude an Herausforderungen in Projekten, zudem Überzeugungskraft und Gestaltungswille. Sprachkenntnisse: Sehr gute Deutsch- und gute EnglischkenntnisseUnser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4203244332",
        "reason": "The job explicitly requires 'Sehr gute Deutsch- und gute Englischkenntnisse' (Very good German and good English skills), which goes against your preference of not showing jobs that require both languages. Additionally, it asks for 'Praktische Erfahrung in der Versicherungsbranche' (Practical experience in the insurance industry), indicating it is not an entry-level working student or intern position.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Berate Kunden: Du berätst unsere Kunden im Bereich Versicherungen bei der Optimierung ihrer Kernprozesse im Rahmen der Einführung von in|sure Kernanwendungen. Steuere Anforderungen: Du verstehst die Kundenanforderungen und ermittelst Abweichungen zur Funktionsweise der Kernanwendungen aus technischer Sicht. Manage Schnittstellen: Auf Basis des Projektziels definierst du die Anpassungsbedarfe an Schnittstellen und kümmerst dich um die Umsetzung, um die Durchgängigkeit zwischen Anwendungen zu ermöglichen. Teste gewissenhaft: Dein Beitrag zu Integrations- und Systemtests ist entscheidend. Du agierst als Trusted Advisor im Abnahmetest des Kunden. Neues entdecken: Es macht dir Freude, dich beim Aufbau eines neuen Geschäftsfelds zu engagieren und kontinuierlich dein Wissen zu vertiefen. DEIN PROFIL Fundierte Ausbildung: Studium der Informatik oder Wirtschaftsinformatik; auch ein anderer Hintergrund ist möglichBerufserfahrung: Praktische Erfahrung in der Versicherungsbranche sowie gute Kenntnisse der Geschäftsprozesse einer Versicherung oder deren IT-Systeme und Schnittstellen helfen dir in deiner Consulting Rolle. Technologieaffinität: Freude an Technologien und IT, idealerweise Erfahrung bei der Einführung von Softwaresystemen in der Versicherungsbranche Konzeptionelle Fähigkeiten: Um tragfähige Lösungen in interdisziplinären Teams zu erarbeiten helfen dir deine ausgeprägten konzeptionellen und analytischen Fähigkeiten. Projektbegeisterung: Du hast Freude an Herausforderungen in Projekten, zudem Überzeugungskraft und Gestaltungswille. Sprachkenntnisse: Sehr gute Deutsch- und gute EnglischkenntnisseUnser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "BWI GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4280958771",
        "reason": "The job explicitly states 'Sehr gute Deutschkenntnisse' (very good German skills) as a requirement under 'Dein Profil'. This directly contradicts the user's stated preference 'which I don't know!' regarding German language proficiency.",
        "body": " Sorge gemeinsam mit uns für die digitale Zukunftsfähigkeit der Bundeswehr.Als primärer Digitalisierungspartner der Bundeswehr erbringen wir stabile, sichere und effiziente IT-Services im In- und Ausland, vom Grundbetrieb bis in den einsatznahen Bereich und tragen so zur kontinuierlichen Erhöhung der Führungs- und Einsatzfähigkeit der Bundeswehr bei. Mit über 7.700 Kolleg*innen betreiben und modernisieren wir eine der größten und komplexesten IT-Infrastrukturen in Deutschland. Wir suchen verantwortungsvolle IT-Spezialist*innen, die die Bundeswehr-IT aus Überzeugung in herausfordernden Digitalisierungsvorhaben weiterentwickeln und so einen Beitrag zur Sicherheit Deutschlands leisten wollen.Die Central Design Authority (CDA) ist der zentrale Ein- und Ausgangskanal für alle Angebote des BWI-Bereichs „Chief Digital Office\" und damit verantwortlich für die ordnungsgemäße und qualitativ hochwertige Erstellung von IT-Solutions. Die CDA sorgt damit für die Harmonisierung von kundengerechten Lösungen und deren Betreibbarkeit. Dies geschieht z.B. durch die inhaltliche Steuerung von Angebotsvorhaben, die Orchestrierung von dezentralen Solution-Anteilen sowie durch Beratung und Requirements Engineering. Darüber hinaus entwickelt und implementiert die CDA als Design Authority unternehmensweit gültige Vorgaben für die einheitliche Entwicklung von Solutions über alle Unternehmensgliederungen hinweg.Deine Aufgaben: Unterstützung bei der Koordination von Angeboten Unterstützung des Solution Management bei Entwicklung von Lösungen Begleitung der Auftragssteuerung und selbstständige Übernahme konkreter Aufgaben Selbstständige Abstimmung und Kommunikation bzgl. Aufgabentracking innerhalb der Abteilung Übernahme von Aufgaben im Change-Management, Stakeholder-Management und in der Kommunikation Vorbereitung und Unterstützung bei der Durchführung von Workshops &amp; internen Meetings Unterstützung beim Aufbau eines Wissensmanagements Dein Profil: Eingeschriebene/r Student/in der Wirtschaftswissenschaften, Wirtschaftsinformatik, Informatik oder der Naturwissenschaften verbunden mit persönlicher Affinität zum IT-Bereich Sehr gute Deutschkenntnisse Sichere Anwendung der gängigen Office Produkte Kenntnisse im Umgang mit JIRA und Confluence wünschenswert Strukturierte, sorgfältige und eigenständige Arbeitsweise gepaart mit Motivation, Einsatzbereitschaft, Neugierde und Verantwortungsbewusstsein Ausgeprägte Kommunikations- und Teamfähigkeit sowie ein hohes Maß an Selbstständigkeit im Erarbeiten eigener Lösungsansätze Wir bieten: Spannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen UmfeldVertrauensarbeitszeit - je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglichAttraktive Vergütung ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "C&A",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4341229591",
        "reason": "The job is an 'Intern' position, fitting the user's preference for entry-level roles. It's a corporate job in Data Science/AI, aligning with their interest in corporate jobs and computer engineering background. It is not a dual study program. The description is in English and does not explicitly state a requirement for both German and English, or German alone, thus satisfying the language preference. Having a Bachelor's degree is suitable for an intern position.",
        "body": " The future looks like youWith over 1,300 stores in 17 European countries and more than 25,000 employees, C&amp;A is one of Europe’s leading fashion retailers. Every day, C&amp;A welcomes millions of visitors to its stores in Europe and to its online shop. C&amp;A offers quality and long-lasting fashion at affordable prices forthe many. We are building on more than 180 years of experience in the fashion industry and continuously modernize the company to become an omnichannel fashion retailer.The Data Science Team in our Düsseldorf Headquarter is looking for a full-time Intern (m/f/d) for at least six months to support the team with their day-today business. You will get valuable insights in the data of an internationally operating company. As a Data Science / AI Intern, you will assist in a variety of projects that utilize data analytics, machine learning techniques, and cuttingedge AI technologies. Your role will involve supporting the analysis of complex data sets, aiding in the development of predictive models, and helping implement AI-driven solutions.Your Responsibilities Assist in the analysis and interpretation of data to derive actionable insights Contribute to the feature engineering process that improve the accuracy and performance of our models Support the development and application of predictive and forecasting models Contribute to projects involving natural language processing Research the application of the newest AI technologiesWhat You Bring Proficient in ML and understanding of Deep learning Fundamental understanding of NLP and Generative AI algorithms Strong programming skills in Python and SQL Keen interest in research and solid grasp of StatisticsWhat We OfferThis is an opportunity for you to join us on a truly exciting transformation journey, where you’ll be able to leave footprints that last and contribute significantly to our vision. As well as knowing that you played a key part in the evolution of one of Europe’s most recognizable retail brands, you will also enjoy: Countless learning and development opportunities via our C&amp;A academyMental health and wellness programAn exciting job in an international and inspirational working environmentA positive working atmosphere and a talented team with an open feedback cultureC&amp;A fosters equal opportunity for people of all backgrounds and identities. We are led by a gender-balanced board that is committed to building a diverse and inclusive organization where everyone can become their best self.We do not discriminate based on age, disability, gender identity, sexual orientation, ethnicity, race, religion or belief, parental and family status, or any other protected characteristic. We welcome applications from women, men and non-binary candidates of all ethnicities and socio-economic backgrounds. We encourage people belonging to underrepresented groups to apply.Even if you don't check every box, but see yourself contributing, please apply and help us build an inclusive community.C&amp;A fosters equal opportunity for people of all backgrounds and identities. We are led by a gender-balanced board that is committed to building a diverse and inclusive organization where everyone can become their best self.We do not discriminate based on age, disability, gender identity, sexual orientation, ethnicity, race, religion or belief, parental and family status, or any other protected characteristic. We welcome applications from women, men and non-binary candidates of all ethnicities and socio-economic backgrounds. We encourage people belonging to underrepresented groups to apply.Even if you don't check every box, but see yourself contributing, please apply and help us build an inclusive community. ",
        "job_sum": "- **Job Title:** Intern (m/f/d) - Data Science / AI Intern (full-time for at least six months)\n- **Responsibilities:** Assist in data analysis and interpretation, contribute to feature engineering, support development of predictive/forecasting models, contribute to NLP projects, and research newest AI technologies.\n- **Requirements:** Proficient in ML and understanding of Deep Learning, fundamental understanding of NLP and Generative AI algorithms, strong programming skills in Python and SQL, keen interest in research, and solid grasp of Statistics.\n- **Location:** Düsseldorf Headquarter (Germany).\n- **Language Needs:** Not explicitly stated, but the job description is entirely in English, implying English proficiency is expected.",
        "is_match": true
    },
    {
        "title": "Inverto | A BCG Company",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328270582",
        "reason": "The job explicitly states that it requires 'verhandlungssicheres Deutsch und Englisch' (fluent German and English), which directly contradicts your preference of not showing jobs that require both languages because you do not know German.",
        "body": " Bei Inverto sind wir auf strategischen Einkauf und Supply Chain Management spezialisiert. Wir arbeiten weltweit mit führenden Unternehmen zusammen, entwickeln transformative Strategien und setzen diese gemeinsam mit unseren Kunden um. Und das kannst du auch – mit unserem anhaltenden Erfolg hast du die Chance, gemeinsam mit uns zu wachsen. In unseren Teams stehen Zusammenarbeit, offener Austausch und das Feiern gemeinsamer Erfolge im Mittelpunkt. Du wirst Teil eines großartigen Umfelds, das dir den Raum gibt, dich weiterzuentwickeln und erfolgreich zu sein. Es gab nie einen besseren Zeitpunkt, um einzusteigen und mit uns die Zukunft zu gestalten. Bist du dabei?How You'll Impact.1st Level Support. In enger Zusammenarbeit mit dem IT-Team stehst du unseren Mitarbeitenden aller Standorte im 1st Level Support als wichtige Ansprechperson im operativen Tagesgeschäft zur Seite.Umfassendes Client Management. Du betreust unsere Client-Umgebung mit Windows-Laptops sowie iOS-Smartphones und unterstützt im Rollout.Spannendes Projektmanagement. Je nach Qualifikation greifst du dem Team in technischen und organisatorischen Projekten unter die Arme – zum Beispiel bei der Überarbeitung unserer Office-Infrastruktur oder beim Design eines cloudbasierten Rollout-Prozesses.Dynamisches Arbeitsumfeld. Ein motiviertes IT-Team bietet dir ein professionelles Arbeitsumfeld mit individuellen Entwicklungsmöglichkeiten. Von Anfang an übernimmst du viel Eigenverantwortung, auch in organisatorischen Aufgaben wie Knowledge- und Supplier-Management.What You'll Bring.Du bist Student im fortgeschrittenen Semester, vorzugsweise in den Bereichen Wirtschaftsinformatik, Informatik oder einem verwandten Studiengang und kannst dort (sehr) gute Leistungen vorweisen.Bereits während deines Studiums hast du deine theoretischen Kenntnisse durch praktische Erfahrungen erweitert.Gewissenhaftes Arbeiten, Flexibilität und Begeisterung für die freundliche und professionelle Betreuung der Kolleg:innen sind für dich selbstverständlich.Du arbeitest gerne im Team. Dabei ist dir Bodenständigkeit ebenso wichtig wie wie echter Zusammenhalt und gegenseitige Unterstützung.Du sprichst verhandlungssicheres Deutsch und Englisch. Dabei fühlst dich wohl im internationalen Kontext.TOGETHER, WE BENEFIT. Trainingsangebote, die dir helfen, dich weiterzuentwickeln und als vollwertiges Teammitglied erfolgreich zu seinZugang zu Mental Coaching, um dein Wohlbefinden, deine Resilienz und dein persönliches Wachstum zu fördernEin attraktives Mitarbeiterempfehlungsprogramm, um mit deiner Hilfe unser Team wachsen zu lassenSaisonale Feiern, Teamevents und Get-Together, um die Zusammenarbeit zu stärken und Erfolge zu feiern APPLY NOW! ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Riverty",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4293935826",
        "reason": "The job is advertised as an 'Ausbildung zum Fachinformatiker' (Apprenticeship as IT Specialist). The user explicitly stated 'do not show me dual study programs, because I am studying masters right now, I cannot apply to them.' An apprenticeship, while not strictly a dual study program, is a vocational training program primarily for school leavers, which is conceptually similar in that it's a structured training program for those entering the workforce directly after secondary school, and incompatible with someone pursuing a Master's degree. The requirements also ask for (Fach-)Abitur or a very good Realschulabschluss, which indicates it's not suitable for someone who has already completed a Bachelor's degree.",
        "body": " Du bist aufgeschlossen, kommunikativ, engagiert und steckst voller Tatendrang? Zeit, dass wir uns kennenlernen!Als innovatives und schnellwachsendes Unternehmen suchen wir Auszubildende, die Lust darauf haben ihre Fähigkeiten einzubringen und mit uns die Zukunft zu gestalten.Du bist auf der Suche nach einer abwechslungsreichen Ausbildung? Dann bewirb dich jetzt!Ausbildung zum Fachinformatiker (m/w/d) – Fachrichtung Systemintegrationbei BFS health finance in Dortmund.Auf diese Aufgaben kannst du dich freuen: Du wirst als vollwertiges Teammitglied in allen Arbeitsbereichen der Abteilung von der Clients-Betreuung über die Drucker- &amp; Netzwerkadministration bis zur Erstellung von Systemdokumentationen mitarbeitenDie Einarbeitung und Betreuung erfolgt durch eine:n Ausbildungsbeauftragte:n, der dir die ganze Zeit zur Seite stehtDu agierst als Ansprechpartner:in bei technischen Fragestellungen und stehst den Mitarbeitenden bei Soft- und Hardwarefragen beratend zur SeiteZudem arbeitest du selbständig in deinem eigenen Verantwortungsbereich und beteiligst dich an übergreifenden ProjektenDu bekommst ebenfalls Einblicke in alle Unternehmensbereiche und lernst so das gesamte Unternehmen kennenWas wir von dir erwarten: Du hast (Fach-)Abitur oder einen sehr guten RealschulabschlussDie Welt der IT begeistert dich jeden Tag aufs NeueDu arbeitest gerne in einem Team und tauscht dich regelmäßig in Teamsitzungen mit deinen Kolleg:innen ausDeine Selbständigkeit, Eigeninitiative und Verantwortungsbewusstsein sind bei der Betreuung deines eigenen Aufgabenbereiches für dich unabdingbarWas du von uns erwarten darfst:Bei BFS kannst du dich auf eines besonders freuen: Spaß an deiner Arbeit!Hier findest du eine partnerschaftliche Arbeitsatmosphäre mit kommunikativen und begeisterungsfähigen Kolleg:innen sowie einen umfangreichen und praxisnahen Einblick in die Arbeit eines modernen Unternehmens.Neben einer attraktiven Ausbildungsvergütung und Weihnachtsgeld erwarten dich 30 Urlaubstage pro Kalenderjahr, viele Vergünstigungen im Bertelsmann Haussortiment und weitere Benefits wie kostenloses Obst, Wasser und Kaffee so viel du willst, speziell auf Azubis zugeschnittene Gesundheitsangebote und vieles mehr.Wir beteiligen uns außerdem an den Kosten für deine Schulbücher und deinem Jobticket und bieten dir weitere individuelle Förderungen und Unterstützung bei einem umweltfreundlichen Weg zur Arbeit an. Je nach Ausbildungsabschnitt besteht außerdem die Möglichkeit einige Tage von zu Hause aus zu arbeiten.Unser umfassendes Schulungs- und Weiterbildungskonzept sorgt dafür, dass du dich stetig weiterentwickelst und dich am Ende deiner Ausbildung auf Top-Übernahmechancen freuen kannst.Das klingt nach deiner Traumausbildung? Dann bewirb dich jetzt!Mehr Infos unter meinebfs.de/zukunftWer wir sind:BFS health finance nimmt Mediziner:innen alles ab, was Zeit frisst: Vom Zahlungsstrommanagement über die Sicherung von Honoraren bis hin zur Beratung im Praxismanagement. BFS vertrauen tausende Zahnärzt:innen, Ärzt:innen, Tierärzt:innen, Dentallabore, medizinische Versorgungszentren sowie Chefärzt:innen und Kliniken. Als Spezialist für Finanzdienstleistungen im Gesundheitswesen ist BFS health finance der Wegebereiter für das vernetze Gesundheitssystem der Zukunft in der Unternehmensgruppe Riverty. Riverty ist ein global tätiger Finanzdienstleister und zu Bertelsmann zugehörig.Wir halten was wir versprechen:Weitere Informationen findest du auf riverty.com/karriere. Bist du schon bereit, eine Entscheidung zu treffen? Dann bewirb dich mit wenigen Klicks - wir freuen uns auf deine Online Bewerbung.Wir freuen uns auf Bewerbungen von Menschen, die zu der Diversität bei Riverty beitragen. Dabei verstehen wir Vielfalt insbesondere in den Dimensionen kulturelle oder soziale Herkunft, Religion, Alter, Behinderung, Geschlecht und sexuelle Identität. Unternehmen: BFS Health Finance GmbH | Job ID: 282300Benefits: Bei Riverty kannst du sein, wer du bist. Wir setzen uns dafür ein, eine inklusive Umgebung und eine wertschätzende Kultur zu schaffen, die durch unsere Mitarbeitenden-Netzwerke bereichert wird.Priorisiere deine Gesundheit mit unterstützten Sport- und Freizeitaktivitäten.Nutze unsere zahlreichen Aus- und Weiterbildungsmöglichkeiten! Entwickle deine Fähigkeiten mit Trainingsangeboten der Bertelsmann University, Sprachkursen oder Führungstrainings.Profitiere von unseren Rabatten auf Bertelsmann-Produkte und finanziellen ZusatzleistungenMit unseren vielfältigen Arbeitsmodellen kannst du deine Arbeit nach deinen Wünschen gestalten. Profitiere von mobile Office, flexiblen Arbeitszeiten und Teilzeitmodellen. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4221257598",
        "reason": "The job explicitly states that it requires both German and English language skills ('Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.'), which goes against your preference of not showing jobs that require both languages. Additionally, the role description (e.g., 'Strategie beraten', 'Projektpraxis vorhanden', 'Erfahrung in Verwaltung oder Sozialversicherung') suggests a more experienced professional role, not an entry-level working student or intern position.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "RWE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344539629",
        "reason": "The job explicitly states 'fluent English, German is a plus but not required', which means it does not require both German and English. It is a graduate program, not a dual study program, fitting the entry-level corporate job preference. It requires a completed degree (BSc, MSc, or PhD), which the user has (Bachelor's). The role is for 'graduates' and 'early careers', indicating it is an entry-level position, not a senior one. The responsibilities are clearly corporate IT-related.",
        "body": " Location: Essen, NRW, DE, 45141RWE GroupStart date: September 2026Salary: starting at 54.000,00 € p.a.About The RoleWorking in close partnership with leading technology companies, our IT functions drive efficiency and innovation across the whole of our business. Right from the start, you’ll gain experience and insights into various IT functions, while at the same time learning how we manage the overall IT strategy.The aim is for you to thrive and grow as an IT professional. So, throughout the programme, you will have the chance to work on real projects with real impact.You’ll learn about our global business from the inside – working on meaningful projects in areas including: Connectivity and Unified Communications, RWE’s competence team, integrator and management unit for all IT communication technologiesGroup Cyber Security manages the security for the RWE Group worldwide.IT Solutions (COTS and in house developed solutions) who manage and operates a portfolio of specific digital and application solutions. IT Management &amp; Strategy who develop and own the IT &amp; Digital Strategy and manage the operationalization of strategic initiativesInnovation and Digitalisation that look beyond RWE’s current IT landscapeIT Infrastructure teams that ensure RWE’s IT landscape is always up and runningCorporate IT manage RWE Cloudification Programme (RCP)Digital Solutions (Visualisation &amp; Reporting Tech, Cloud Development)Asset Information Management operate and improve the RWE’s data backboneCIO Office, Vendor Management support the CIO support our CIO and the various IT departments throughout the RWE Group by defining clear responsibilities and assisting them based on their different requirements and needs. … and many moreThere’s the opportunity to complete both technical and non-technical rotations in many of the teams mentioned above. Some examples of more technical roles include supporting our digitalisation and Cloudification Programme, product application ownership and maximising visualisation and reporting technology (such as Tableau, Databricks), data analysis/data engineering support in different projects, development of tools based on machine learning, software development and many more.Whichever team you join, you’ll be welcomed as an equal. Your perspective will be valued. You’ll be trusted to deliver the work you’re given. And with each new rotation, you’ll develop the skills and knowledge you need to become an industry expert.Job Requirements And ExperiencesAre you passionate about IT, digital technologies, and innovative solutions? Committed to building a career in the energy industry? Keen to learn, grow and take ownership and accountability? Then you could be just the kind of exceptional person we’re looking for. Some relevant work experience would be an advantage but is not essential.As well as a keen interest in the energy industry and the readiness to explore our markets and our business, you’ll need: a degree (BSc, MSc or PhD) in IT or a similar statistical or numerate subject such as Mathematics, Engineering or Economics with strong IT acumen.passion and knowledge for ITa positive approach to working in a teamto be motivated by taking on new challengesa commercial and analytical mindthe ability to adapt and learn quicklyan enthusiasm for developing your skills and exploring new opportunitiesfluent English, German is a plus but not requiredWhilst we are looking for technical IT skills, a keen interest in and willingness to learn these skills are also welcomedFrom here, you’ll have a community of support.At RWE, we have the energy to be inclusive and believe diversity drives success. Reaching your full potential means being able to bring your whole self to work and being respected for the different opinions, strengths, and experiences you bring.Our graduate programs have been designed to give you the chance to shape your own career path and personal development, with the support you need to succeed. You’ll be assigned a graduate buddy and a senior mentor within your field who can advise you on rotations and introduce you to key people within the business.We also offer a wide range of development opportunities, including networking events where you’ll meet senior managers and board members. We are committed to developing our Early Careers cohort, encouraging their passion to grow, and helping to develop their skills with their future careers in mind. Our development journey is anchored around a strengths-based program designed specifically for graduates, giving you the chance to shape your own development and experience deeply personalized learning in immersive environments. All this is further complemented by instructor-led training.And after the program? The only way is up! Most of our graduates continue their careers with us long after their programs have finished. The skills you gain will provide the perfect springboard for your future career.Your BenefitsAt RWE, we’ll do everything we can to support you in fulfilling your potential. Our benefits include: Competitive salary plus annual discretionary bonusCompany pension and discounted employee share scheme30 days annual leave plus bank holidays &amp; compensation daysInternational rotations to the UK, Singapore, the US or possibly further afield incl. financial assistance when moving on international assignmentsAn enhanced maternity scheme and family friendly policiesFree on-site health care incl. health centre (gym) on-siteAccess to a modern office &amp; state-of-the-art ITOpen and diverse company culture with various clubs and societies - join any of our employee networks for social interaction (including Diversity Ambassador Programme)Flexible benefits, including discounts at shopsApply before 20/01/2026 with just a few clicks: 91432Please upload your resume and cover letter in English as one document. Should you progress through the interview process, you will be asked to share a copy of your transcript.Find out more on rwe.com/graduatesAny further questions? Reach out to the Global Early Careers Team (rwestearlycareers@rwe.com).We value diversity and therefore welcome all applications – regardless of gender, disability, nationality, ethnic and social origin, religion/belief, age, sexual orientation, and identity. #inclusionmattersAbout UsRWE Supply &amp; Trading is our connection to the world’s energy markets. With headquarters in Essen, Germany, the tight-knit around 2,200-strong team’s drawn from over 90 countries, and operates Europe’s largest and most advanced energy trading floor – trading a mix of electricity, gas, commodities and CO2 emission allowances. They commercially optimise our power plants’ dispatch and take care of the renewables electricity sales, too.Tech-led and customer-focused, the teams agile mindset helps them respond and adapt intelligently to work that never stands still. Each day, there’s a chance to grow as you create the financial foundations to invest in our green future. From well-established graduate programmes to success-related recognition – you’ll experience a culture energised by trust, passion and performance. ",
        "job_sum": "- **Job Title:** IT Graduate Program (Early Careers)\n- **Responsibilities:** Gain experience in various IT functions through technical and non-technical rotations, working on real projects across areas like Connectivity, Cyber Security, IT Solutions, IT Strategy, Innovation & Digitalisation, IT Infrastructure, Cloudification Programme, Data Analysis/Engineering, Machine Learning, and Software Development.\n- **Requirements:** A degree (BSc, MSc, or PhD) in IT or a similar statistical/numerate subject (e.g., Mathematics, Engineering, Economics) with strong IT acumen. Passion for IT, positive team approach, motivation for new challenges, commercial and analytical mindset, ability to adapt and learn quickly, and enthusiasm for skill development. Relevant work experience is an advantage but not essential.\n- **Location:** Essen, NRW, Germany.\n- **Language Needs:** Fluent English. German is a plus but not required.",
        "is_match": true
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4283069717",
        "reason": "The job explicitly requires proficiency in both German and English, which goes against your preference of not showing jobs that require both. Additionally, the role's responsibilities and requirements ('Projektpraxis vorhanden', 'Erfahrung in Verwaltung oder Sozialversicherung') indicate it is not an entry-level 'working student' or 'intern' position, but rather a professional role that requires prior experience, thus not aligning with your preference for entry-level jobs.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "ARKADIA Management Consultants",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4345730872",
        "reason": "The job explicitly requires 'gute Deutschkenntnisse' (good German skills) and 'Sichere Kommunikationsfähigkeit in deutscher und englischer Sprache' (secure communication skills in German and English). The user stated: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!'. Since German is required and the user does not know German, this job does not match the preference.",
        "body": " ARKADIA Management Consultants ist eine mittelständische,inhabergeführte Managementberatung mit Fokus auf die Optimierung derwertschöpfenden Unternehmensfunktionen. Gemeinsam mit unseren Kundenkonzipieren wir maßgeschneiderte Lösungen und füllen diese mit Leben.Führende Unternehmen aus den Branchen Telekommunikation,Finanzdienstleistungen und Energieversorgung gehören zu unseremKundenstamm.Wir sind ein cooles buntgemischt Team und haben gerne auch mal Spaß bei der Arbeit.Aufgaben• Helpdesk &amp; Support für unsere Mitarbeiter unter sorgfältiger Anwendung und Pflege unseres Ticket-Systems (Zendesk).• Zu betreuen sind vor allem Support-Fälle zu mobilen Endgeräten und Desktop-Anwendungen (MS Office, etc.).• Einrichtung und Wartung von Notebooks sowie Durchführung weiterer Hardware- und Softwareinstallationen.• Einrichtung und Pflege von Benutzer-Accounts sowie Pflege und Ergänzung interner Dokumentation.• Wartung von IT-Infrastruktur (Router, WLAN, etc.).Qualifikation– gute Deutschkenntnisse– Eingeschriebener Student, vorzugsweise im Studiengang Informatikoder eines verwandten Studiengangs, alternativ hohe IT-Affinität undrelevante Erfahrung– Kenntnis möglichst vieler der genannten Aufgabenbereiche und Interesse, sich in die übrigen Gebiete einzuarbeiten– Sichere Kommunikationsfähigkeit in deutscher und englischer Sprache– Hohe Zuverlässigkeit, zeitliche Flexibilität und die Möglichkeit, uns für mindestens ein Jahr zu unterstützen– Ausgeprägtes analytisches Denken und lösungsorientiertes Vorgehen– Teamgeist und Freude am Umgang mit Menschen und der Unterstützung von Kollegen bei ProblemfällenBenefits–Ein Werkstudentenjob, der sich flexibel an Deine Vorlesungszeiten anpassen lässt–Nach Absprache kannst Du auch vereinzelt von zu Hause aus (remote) arbeiten–Ein abwechslungsreicher Arbeitsalltag, in dem Du Deine Kenntnisse und Affinität zur IT anwenden kannst–Bei Interesse Mitwirkung bei der Neuorganisation und Optimierung des IT-Bereichs–Flache Hierarchien und eine kollegiale Arbeitsatmosphäre in einem motivierten Team–Je nach Qualifikation bieten wir Dir 14-16 EUR je Arbeitsstunde-Immer ein voller Kühlschrank mit GetränkenWir freuen uns auf deine Bewerbung. ARKADIA Management Consultants ist eine mittelständische,inhabergeführte Managementberatung mit Fokus auf die Optimierung derwertschöpfenden Unternehmensfunktionen. Gemeinsam mit unseren Kundenkonzipieren wir maßgeschneiderte Lösungen und füllen diese mit Leben.Führende Unternehmen aus den Branchen Telekommunikation,Finanzdienstleistungen und Energieversorgung gehören zu unseremKundenstamm.Wir sind ein cooles buntgemischt Team und haben gerne auch mal Spaß bei der Arbeit.• Helpdesk &amp; Support für unsere Mitarbeiter unter sorgfältiger Anwendung und Pflege unseres Ticket-Systems (Zendesk).• Zu betreuen sind vor allem Support-Fälle zu mobilen Endgeräten und Desktop-Anwendungen (MS Office, etc.).• Einrichtung und Wartung von Notebooks sowie Durchführung weiterer Hardware- und Softwareinstallationen.• Einrichtung und Pflege von Benutzer-Accounts sowie Pflege und Ergänzung interner Dokumentation.• Wartung von IT-Infrastruktur (Router, WLAN, etc.).– gute Deutschkenntnisse– Eingeschriebener Student, vorzugsweise im Studiengang Informatikoder eines verwandten Studiengangs, alternativ hohe IT-Affinität undrelevante Erfahrung– Kenntnis möglichst vieler der genannten Aufgabenbereiche und Interesse, sich in die übrigen Gebiete einzuarbeiten– Sichere Kommunikationsfähigkeit in deutscher und englischer Sprache– Hohe Zuverlässigkeit, zeitliche Flexibilität und die Möglichkeit, uns für mindestens ein Jahr zu unterstützen– Ausgeprägtes analytisches Denken und lösungsorientiertes Vorgehen– Teamgeist und Freude am Umgang mit Menschen und der Unterstützung von Kollegen bei Problemfällen–Ein Werkstudentenjob, der sich flexibel an Deine Vorlesungszeiten anpassen lässt–Nach Absprache kannst Du auch vereinzelt von zu Hause aus (remote) arbeiten–Ein abwechslungsreicher Arbeitsalltag, in dem Du Deine Kenntnisse und Affinität zur IT anwenden kannst–Bei Interesse Mitwirkung bei der Neuorganisation und Optimierung des IT-Bereichs–Flache Hierarchien und eine kollegiale Arbeitsatmosphäre in einem motivierten Team–Je nach Qualifikation bieten wir Dir 14-16 EUR je Arbeitsstunde-Immer ein voller Kühlschrank mit GetränkenWir freuen uns auf deine Bewerbung.",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4221260046",
        "reason": "The job explicitly states that it requires language skills in 'both German and English', which directly contradicts your preference of 'If the job says that it requires german and english, do not show it'. Additionally, the role seems to require prior professional 'experience in administration or social insurance' and 'project practice', which goes beyond typical 'working student' or 'intern' entry-level positions you are looking for.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "BWS Consulting Group GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4346271257",
        "reason": "The job explicitly requires 'very good German skills' ('sehr gute Deutschkenntnisse'), which the user does not possess. Additionally, the user specifically requested 'entry jobs like working student or intern jobs,' but this position is for a 'Consultant' (Berater) role, described as full-time/part-time and permanent, which is a professional entry-level role, not an intern or working student position.",
        "body": " KarriereportalBerater (m/w/d) im Bereich IT-Sicherheit/ISMS Dortmund, Hannover, Remote, Wolfsburg ab sofort Vollzeit, Teilzeit unbefristetWir sind ein mittelständisches IT-Beratungshaus mit mehr als 100 Mitarbeitern. Seit über 20 Jahren sind wir erfolgreich in der Umsetzung von IT-Projekten bei Großkunden und im Mittelstand.Für unsere Softwareentwicklungsprojekte am Standort Wolfsburg, Hannover und Dortmund oder per Remote suchen wir dich alsDEINE AUFGABEN Unterstützung unserer Kunden bei der Einführung, Weiterentwicklung und Zertifizierung von Informationssicherheitsmanagementsystemen (ISMS)Wahrnehmung der Funktion des externen Informationssicherheitsbeauftragten (ISB) bei unseren KundenDurchführung von Sensibilisierungs- und Schulungsmaßnahmen zum Thema InformationssicherheitDurchführung von internen Audits nach etablierten Standards und Normen wie ISO-27001DEIN PROFIL abgeschlossene Ausbildung im IT-Bereich (Studium der Informatik / Wirtschaftsinformatik oder Fachinformatiker mit Fachrichtung Systemintegration)erste Erfahrungen bei der Implementierung von ISMS nach ISO 27001 und/oder TISAXFähigkeit, Themen zielgruppengerecht zu kommunizierenhohes Maß an Durchsetzungsvermögensehr gute DeutschkenntnisseWIR BIETEN Aus- und Weiterbildung Barrierefreiheit Betriebsarzt Coaching Firmenhandy 30 Urlaubstage Betriebliche Gesundheitsmanagement Betriebliche Altersvorsorge Betriebliche Krankenversicherung Bikeleasing Flexible Arbeitszeiten Getränke im Büro Gute Verkehrsanbindung Homeoffice Internetnutzung Jobticket Mitarbeiterprämien Mitarbeiterevents Parkplatz Mitarbeiterrabatte Vermögenswirksame Leistungen Zuschüsse zur Kinderbetreuung Interessiert?Dr. Jessica HeineHR Manager &amp; ArbeitspsychologinTel: 05308 7070 111Zurück BewerbenImpressum | Datenschutz | Hinweis gebenpowered by d.vinci ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Toyota Kreditbank/ Toyota Financial Services Germany",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4316336299",
        "reason": "The job explicitly requires 'Fließende Deutsch- und Englischkenntnisse in Wort und Schrift' (Fluent German and English skills in spoken and written word). The user's preference states: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!' This directly contradicts the user's primary language preference.",
        "body": " Aufgaben: Unterstützung im 2nd Level Support bei technischen Anfragen zu Hard- und SoftwareMitarbeit bei der Analyse und Lösung von Störungen als Unterstützung im Ticket-SupportAssistenz bei der Bereitstellung und Administration von Clientsystemen und AnwendungenUnterstützung bei M365-, Windows-, Citrix- und VDI-Systemen im täglichen BetriebMitarbeit im Benutzer- und Berechtigungsmanagement inkl. Onboarding-SupportUnterstützung bei der Betreuung fachspezifischer AnwendungenMithilfe bei der Erstellung und Pflege von IT-Dokumentationen und RichtlinienAssistenz bei Reparatur- und Austauschprozessen sowie Routineaufgaben in der InfrastrukturpflegeWeiterleitung komplexer technischer Probleme an 3rd Level Teams und Unterstützung im Kundenservice für die internen FachabteilungenProfil: Laufendes Studium in Informatik, Wirtschaftsinformatik oder vergleichbare StudienrichtungErste praktische Erfahrungen im IT-Support Grundkenntnisse in Windows 10/11, M365, Citrix/ZENworks oder Nutanix-VDI wünschenswertInteresse an IT-Prozessen, Monitoring und FehlersucheBereitschaft an mehreren Tagen in der Woche vor Ort in Köln zu arbeitenFließende Deutsch- und Englischkenntnisse in Wort und Schrift ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Information und Technik Nordrhein-Westfalen (IT.NRW)",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4256661319",
        "reason": "The user explicitly stated 'do not show me dual study programs, because I am studying masters right now, I cannot apply to them.' This job is clearly advertised as a 'duale Studentin/dualer Student' (dual student) position, leading to a Bachelor of Science degree. This directly contradicts the user's preference.",
        "body": " Deine Mission: NRW digital vorwärts bringenBei IT.NRW geht es um mehr als „nur“ einen Job. Es geht um einen wichtigen gesellschaftlichen Auftrag: ein ganzes Bundesland digital voran zu bringen.Als duale Studentin/dualer Student arbeitest du in agilen Teams mit erfahrenen Kolleginnen und Kollegen und vielen Studierenden gemeinsam an zukunftsweisenden Projekten. Deine Aufgaben bestehen in der Digitalisierung von Verwaltungsvorgängen wie zum Beispiel der Umwandlung von Papier-Anträgen in online-Verfahren. Bring dich jetzt ein und leiste einen wichtigen Beitrag für 18 Millionen Bürgerinnen und Bürger in NRW.Jetzt bewerbenStiftet Sinn: dein Studium Du studierst an der Fachhochschule Rhein-Waal in Kamp-LintfortDein duales Studium gliedert sich in einen Praxisteil im Betrieb und einen Theorieteil (Blockmodell an der Hochschule)Deine Praxisphasen finden dabei in Düsseldorf stattNach 8 Semestern schließt du dein Studium als Bachelor of Science (B.SC.) abWeitere Infos findest du hierBewegt mehr: dein ProfilDu Bringst Mit Abitur oder FachhochschulreifeErfolgreich bestandener Online-EinstellungstestVoraussetzungen Für Eine Verbeamtung ein Alter von nicht mehr als 38 Jahrendie deutsche Staatsangehörigkeit oder die Staatsangehörigkeit eines EU-Mitgliedstaatesdie gesundheitliche Eignung für eine VerbeamtungWünschenswert Sind Zudem Motivation, Lernbereitschaft und LösungsorientierungTeamgeist und ServicedenkenTechnisches Verständnis und IT-AffinitätWir bieten Deine Benefits Du wirst Beamtin bzw. Beamter in der LandesverwaltungFaire VergütungEnge Begleitung durch AusbildendeFlexible Arbeitszeiten zwischen 6:30 und 20:00 Uhr ohne KernarbeitszeitGesundheitsangebote, Betriebssportgemeinschaften (Laufen, Walken, Hallenfußball, Fußball, E-Sports)Eine SAP Zertifizierung ermöglichen wir dir gernVermögenswirksame LeistungenMöglichkeit für alternierende Telearbeit nach dem ersten JahrWir statten dich mit moderner Hardware aus, welche du im Betrieb nutzen kannstWir zahlen deine SemestergebührenAlle weiteren Infos findest du hierIT.NRWDer richtige Schritt: deine BewerbungBewirb dich jetzt einfach online und leiste mit uns gemeinsam einen wichtigen Beitrag für 18 Millionen Menschen in NRW.Jetzt BewerbenBitte reiche deine Bewerbung bis zum 31.01.2026 über unser Bewerbungsportal ein.Zu Deiner Vollständigen Bewerbung Gehören Folgende Unterlagen AnschreibenLebenslaufRelevante ZeugnisseSelbstverständlich achten wir auf den Datenschutz und behandeln deine Unterlagen vertraulich.Bewirb dich bitte ausschließlich über unser Bewerbungsportal (per Mail oder Post übermittelte Unterlagen können leider nicht berücksichtigt werden). Nach dem Absenden deiner Bewerbung erhältst du eine Eingangsbestätigung. Anschließend prüfen wir deine Unterlagen. Stimmen die Voraussetzungen, laden wir dich zum Online-Test ein. Über das weitere Vorgehen unterrichten wir dich zeitnah.Wir freuen uns besonders über Bewerbungen von Frauen und bevorzugen Frauen nach Maßgabe des LGG NRW in Bereichen, in denen sie unterrepräsentiert sind. Bewerbungen schwerbehinderter Menschen sowie gleichgestellter behinderter Menschen im Sinne des 2 SGB IX sind ausdrücklich erwünscht. Wir bekennen uns ausdrücklich zu Vielfalt in unserem Arbeitsumfeld und freuen uns über die Bewerbungen aller Talente – ungeachtet von Alter, Geschlecht und geschlechtlicher Identität, ethnischer, kultureller und sozialer Herkunft, Religion und Weltanschauung, Behinderung, sexueller Orientierung und Identität. Deshalb hat IT.NRW die Charta der Vielfalt unterzeichnet.Dein Draht zu unsSchick uns eine E-Mail an: ausbildung[at]it.nrw.de (ausbildung[at]it[dot]nrw[dot]de) ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Uniper",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328742717",
        "reason": "The job description does not require both German and English, only fluent English with German as a plus, which matches the user's preference. It is not a dual study program and is open to master's students. It is a corporate job within an ESG Risk Team. It requires current enrollment, which fits someone studying a master's degree and having completed a bachelor's. The role involves assisting, indicating an entry-level position suitable for a student. The description is in English and explicitly states language requirements.",
        "body": " Our ESG Risk Team in Düsseldorf is looking for YOU!Your responsibilities Assist in developing and implementing data governance and monitoring concepts for Uniper’s ESG risk processes, focusing on Supply Chain ESG Due DiligenceAssist in creating digital tools to analyse, manage and report ESG due diligence dataBuild and maintain Power BI dashboards, including mapping risk data from internal sources (Excel, SharePoint lists, due diligence software)Digitize additional ESG impact and risk assessment processes, e.g., by enhancing back-end models and Power BI dashboards, and setting up PowerApps interfacesParticipate in various sustainability projects as neededYour profile Currently enrolled in a bachelor's or master's degree program related to Environmental Science, Data Engineering, Information Systems or a related field.Basic understanding of data engineering and database management.Proficiency in Microsoft 365 tools including Power Apps, Excel, Rows, Power BI and SharePoint.Experience or interest in building apps and automate processes using Microsoft 365 tools.Strong analytical and problem-solving skills.Interest in sustainability and environmental, social and governance (ESG) topics is a plus.Excellent communication skills and the ability to work effectively in a team environment. English fluent written and spoken (German is a plus). ",
        "job_sum": [
            {
                "Job Title": "Student Assistant / Intern in ESG Risk Team (Uniper)",
                "Responsibilities": [
                    "Assist in developing and implementing data governance and monitoring concepts for Uniper’s ESG risk processes, focusing on Supply Chain ESG Due Diligence.",
                    "Assist in creating digital tools to analyse, manage and report ESG due diligence data.",
                    "Build and maintain Power BI dashboards, including mapping risk data from internal sources.",
                    "Digitize additional ESG impact and risk assessment processes (e.g., enhancing back-end models, Power BI dashboards, PowerApps interfaces).",
                    "Participate in various sustainability projects as needed."
                ],
                "Requirements": [
                    "Currently enrolled in a bachelor's or master's degree program (Environmental Science, Data Engineering, Information Systems, or related field).",
                    "Basic understanding of data engineering and database management.",
                    "Proficiency in Microsoft 365 tools (Power Apps, Excel, Rows, Power BI, SharePoint).",
                    "Experience or interest in building apps and automating processes using Microsoft 365 tools.",
                    "Strong analytical and problem-solving skills.",
                    "Interest in sustainability and ESG topics is a plus.",
                    "Excellent communication skills and ability to work effectively in a team."
                ],
                "Location": "Düsseldorf, Germany",
                "Language Needs": "Fluent English (written and spoken); German is a plus."
            }
        ],
        "is_match": true
    },
    {
        "title": "Westnetz",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4344884822",
        "reason": "The job is for an 'enrolled student' which fits the user's preference for 'working student' or 'intern' entry-level roles, as they are currently pursuing a Master's degree. It is a corporate job at Westnetz GmbH, a large distribution network operator. The job description is in German but does not explicitly state a German or English language requirement, satisfying the user's specific language criteria ('The job requires german only if it explicitly says that it does. Otherwise, you can show me.'). It is not a dual study program.",
        "body": " Du. Mit uns? Für unser Team Technologie, Standort Dortmund, suchen wir zum nächstmöglichen Zeitpunkt engagierte Verstärkung.Deine Arbeit sollte sinnstiftend sein und Du willst Dich mit all Deinen Facetten einbringen? Dann bist Du bei uns richtig. Wie Du bist, was Du fühlst: Wir sehen Dich.Die Westnetz GmbH, eine 100-prozentige Tochter der Westenergie AG, ist der größte Verteilnetzbetreiber Deutschlands. Mit über 6.000 Mitarbeiter*innen und unserer offenen Unternehmenskultur stellen wir die zuverlässige Versorgung unserer Kundinnen und Kunden sicher – rund um die Uhr, an 365 Tagen im Jahr. Wenn Du mit uns die Energiewende mitgestalten, die Lebensqualität von Menschen verbessern und die regionale Infrastruktur stärken willst, findest Du bei uns Raum zur Verwirklichung.Dafür stehst Du auf: Du bist eingeschriebener Student in den Bereichen Konstruktionstechnik, Maschinenbau, Wirtschaftsingenieurwesen, Elektrotechnik oder einem vergleichbaren StudiengangDu bringst Erfahrung mit CAD-Software und Konstruktionskenntnisse mit sowie erste Erfahrungen im Bereich Augmented RealityDu besitzt ein Grundlagen-Verständnis von Verteilnetzstrukturen, insbesondere im Strom- und GasnetzDu bringst gute Kenntnisse in Bezug auf die Auswertung, Analyse und Darstellung von Daten mitDu besitzt eine gute Kommunikationsfähigkeit und gutes systematisches DenkenDu hast ein selbstbewusstes Auftreten und eine eigenständige ArbeitsweiseDas bringst Du mit: Du hilfst bei der Auswertung und Darstellung von Messergebnissen; insbesondere bei dem Einsatz von Sensorik bei der DrohnenbefliegungDu unterstützt bei dem Vergleich der oben genannten Auswertungen mit anderweitigen Datenquellen bzw. Messverfahren, Datenaufbereitung für die Bewertung der ErgebnisseDu führst Recherchen durch und identifizierst weitere Anwendungsfälle für 3D-Modelle und 3D-Druck innerhalb der WestnetzDu unterstützt bei der Erstellung von 3D-Modellen für Augmented Reality Anwendungen und 3D-Druck sowie Testen der ModelleDu hilfst in weiteren technologischen Themenbereichen mitDas bieten wir Dir: Spannende und herausfordernde Aufgaben in einem wachstumsorientierten und dynamischen UmfeldEine attraktive VergütungFlexible Arbeitszeit (bis zu 20h die Woche)Ein umfassendes Onboarding und abwechslungsreiche TätigkeitenDie Möglichkeit auf Networking, um neue Kontakte für die berufliche Zukunft zu knüpfenBist Du interessiert?Dann bewirb Dich bitte ausschließlich online (Anzeigencode: 241984).Mit unserer offenen und wertschätzenden Unternehmenskultur heißen wir alle Menschen willkommen. Denn wir sind davon überzeugt, dass uns Unterschiede bereichern – sei es in Herkunft, Geschlecht, Alter, Lebens- und Arbeitsstilen, Talenten, Fähigkeiten und Einschränkungen.Wir freuen uns auf Deine vollständige und aussagekräftige Bewerbung mit Lebenslauf und relevanten Zeugnissen. Um Dir den Bewerbungsprozess zu erleichtern, verzichten wir auf ein Anschreiben.Westnetz GmbH Johanna Fitze, +49 231 438-1194Deine Fragen beantworten wir auch gerne unter johanna.fitze@westnetz.deWir sind ein Top-Arbeitgeber!Überzeuge Dich selbst:https://www.kununu.com/de/westnetzWas du sonst noch wissen solltest:Beschäftigungsart: BefristetArbeitsmodell: HybridBeschäftigungsgrad: TeilzeitGesellschaft: Westnetz GmbH ",
        "job_sum": "- **Job Title:** Working Student (Technology/Engineering)\n- **Responsibilities:** Help with evaluation and presentation of measurement results (especially with drone sensor technology), support comparison of evaluations with other data sources/measurement methods, prepare data for result assessment, conduct research for 3D model and 3D printing applications, support creation and testing of 3D models for Augmented Reality and 3D printing, and assist in other technological areas.\n- **Requirements:** Enrolled student in Construction Technology, Mechanical Engineering, Industrial Engineering, Electrical Engineering, or a comparable field; experience with CAD software and construction knowledge; initial experience in Augmented Reality; basic understanding of distribution network structures (electricity/gas); good knowledge of data evaluation, analysis, and presentation; good communication skills and systematic thinking; self-confident and independent working style.\n- **Location:** Dortmund, Germany.\n- **Language Needs:** Not explicitly stated in the job description.",
        "is_match": true
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4283068761",
        "reason": "The job explicitly requires proficiency in both German and English ('sowohl auf Deutsch als auch auf Englisch'), which goes against your preference to exclude jobs requiring both languages. Additionally, the role description and required profile ('Erfahrung in Verwaltung oder Sozialversicherung', 'Projektpraxis vorhanden') suggest a professional position requiring prior experience, not an entry-level working student or intern job.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Schnittstelle gestalten: Du verbindest IT-Kompetenz mit fachlichem Verständnis und stärkst so die Zusammenarbeit von Verwaltung und Technik.Prozesse analysieren: Dabei gehst du Abläufen in Bereichen wie Fallbearbeitung oder Beitragserhebung gezielt auf den Grund.Strategie beraten: Gemeinsam mit Entscheidungstragenden entwickelst du die IT-Landschaft im Rahmen gesetzlicher Vorgaben weiter.Anforderungen umsetzen: Mit Überblick entwickelst du neue Abläufe, die zu Organisation, Technik und rechtlichen Rahmen passen.IT-Lösungen entwickeln: Aus konkreten Anforderungen formst du modulare Architekturen, die nachhaltig funktionieren.Qualität sichern: In Projekten übernimmst du Verantwortung für Tests, Sicherheitsfragen und die termingerechte Umsetzung.DEIN PROFIL Sozialversicherungs-Know-how: Dein Wissen über Strukturen und Abläufe bei Unfallkassen oder Berufsgenossenschaften bringst du gezielt ein.Fachlich fundiert: Ein Studium mit IT-Bezug ergänzt durch Erfahrung in Verwaltung oder Sozialversicherung zeichnet dich aus.Digitalisierung mit Sinn: Du möchtest Prozesse mit gesellschaftlicher Relevanz in eine digitale Zukunft begleiten.Projektpraxis vorhanden: In Verwaltungsprojekten hast du bereits mitgewirkt und kennst fachliche wie technische Anforderungen.Sprachkenntnisse: Mit klarer Sprache überzeugst du intern wie extern – sowohl auf Deutsch als auch auf Englisch.Unser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Jobster",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328648955",
        "reason": "The user explicitly stated, 'show me corporate jobs, I am not interested with cleaning, bar staff, or things like that.' This job is for an extra/actor in a film production, which is not a corporate job.",
        "body": " Filmproduktion sucht Kleindarsteller (auch Schauspieler) im Spielalter 21-28 Jahre für emotionales Filmprojekt gesucht - remote in Deutschland.Nebendarsteller (m/d) für emotionales Filmprojekt gesucht - remoteFür mein neues Filmprojekt BarniFilm suche ich zwei männliche Darsteller für wichtige Rollen. Der Film ist authentisch, emotional und dialogbasiert – wenig Action, kein Studio, kein Kamerateam. Gedreht wird mit einfachen Mitteln (auch Smartphone), dafür mit viel Ausdruck, Nähe und Gefühl. Die Aufnahmen entstehen dort, wo ihr seid – in eurer eigenen Umgebung, mit eurer eigenen Präsenz. So bleibt der Film echt und ortsunabhängig.Das Projekt richtet sich auch an Menschen mit wenig oder keiner Schauspielerfahrung, wenn echtes Interesse, Talent und Ausdruckskraft da sind. Wichtige Nebenrolle : Spielalter 25–35 In der Rolle als Künstler mit psychologischen Fähigkeiten, ruhiger angenehmer Stimme und der Gabe, Sara emotional zu unterstützen Wichtige Kleindarsteller-Rolle : Spielalter 21–28 In der Rolle als IT-Experte / Programmierer#Jobster ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "adesso SE",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4203239754",
        "reason": "The job explicitly requires 'Very good German and good English skills,' which directly contradicts your preference to not show jobs that require both German and English. Additionally, the job asks for 'practical experience in the insurance industry' and 'ideally experience in introducing software systems,' indicating it is not an entry-level position like a working student or intern, which is also against your preference.",
        "body": " Wir gehören zu den Top-Adressen in der IT-Welt und fokussieren uns auf die Optimierung der Kerngeschäftsprozesse unserer Kunden. Durch den smarten Einsatz maßgeschneiderter IT-Lösungen unterstützen wir unsere Kunden dabei, das Beste aus ihrem Business und aktuellen Technologien herauszuholen. Unseren Erfolg aber erreichen wir nur durch eins: die Menschen bei adesso! Sie bringen Ideen, fachliches Know how und Technologien zusammen. Gemeinsam programmieren wir (deine) Zukunft bei adesso.DEINE ROLLE Berate Kunden: Du berätst unsere Kunden im Bereich Versicherungen bei der Optimierung ihrer Kernprozesse im Rahmen der Einführung von in|sure Kernanwendungen. Steuere Anforderungen: Du verstehst die Kundenanforderungen und ermittelst Abweichungen zur Funktionsweise der Kernanwendungen aus technischer Sicht. Manage Schnittstellen: Auf Basis des Projektziels definierst du die Anpassungsbedarfe an Schnittstellen und kümmerst dich um die Umsetzung, um die Durchgängigkeit zwischen Anwendungen zu ermöglichen. Teste gewissenhaft: Dein Beitrag zu Integrations- und Systemtests ist entscheidend. Du agierst als Trusted Advisor im Abnahmetest des Kunden. Neues entdecken: Es macht dir Freude, dich beim Aufbau eines neuen Geschäftsfelds zu engagieren und kontinuierlich dein Wissen zu vertiefen. DEIN PROFIL Fundierte Ausbildung: Studium der Informatik oder Wirtschaftsinformatik; auch ein anderer Hintergrund ist möglichBerufserfahrung: Praktische Erfahrung in der Versicherungsbranche sowie gute Kenntnisse der Geschäftsprozesse einer Versicherung oder deren IT-Systeme und Schnittstellen helfen dir in deiner Consulting Rolle. Technologieaffinität: Freude an Technologien und IT, idealerweise Erfahrung bei der Einführung von Softwaresystemen in der Versicherungsbranche Konzeptionelle Fähigkeiten: Um tragfähige Lösungen in interdisziplinären Teams zu erarbeiten helfen dir deine ausgeprägten konzeptionellen und analytischen Fähigkeiten. Projektbegeisterung: Du hast Freude an Herausforderungen in Projekten, zudem Überzeugungskraft und Gestaltungswille. Sprachkenntnisse: Sehr gute Deutsch- und gute EnglischkenntnisseUnser Versprechen: Du wirst dich bei uns wohlfühlen! Kollegial, familiär und auf Augenhöhe – wir leben Austausch, Teamgeist und einen respektvollen Umgang miteinander. Diversität und verschiedene Blickwinkel werden bei uns genauso geschätzt wie du als Mensch. Das und viel mehr steht für unser ganz besonderes Wir-Gefühl. Für das es sogar ein Wort gibt: adessi.Unsere Kultur und das Zusammenarbeiten sind geprägt von gegenseitiger Wertschätzung, Anerkennung und Unterstützung. Das verbindet uns hierarchieübergreifend – auch im Home-Office. So belegen wir zum wiederholten Mal den 1. Platz beim Wettbewerb „Deutschlands Beste Arbeitgeber in der ITK“!. Unser umfangreiches Trainingsangebot und ein transparentes Laufbahnstufenmodell für alle sorgen dafür, dass deine Entwicklung bei uns nicht stillsteht. Denn gemeinsam zu wachsen und Chancengeber zu sein, das ist programmiert in unserer DNA. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Tagueri AG",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4230623777",
        "reason": "The job explicitly states a requirement for 'very good German skills in spoken and written word' in addition to 'good English skills in spoken and written word'. Your preference clearly states, 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!' Additionally, this is an application for a general talent pool, not a specific entry-level job like a working student or intern role, which violates your preference to 'show me only entry jobs like working student or intern jobs'.",
        "body": " Warum zu unsEmpower People. Create Success. Bei Tagueri stehen die Mitarbeitenden und das Miteinander im Fokus. Wir brennen für unsere Themen, bringen uns proaktiv ein und geben fachlich und persönlich tagtäglich unser Bestes. Gemeinsam feiern wir unsere kleinen und großen Erfolge, freuen uns aufrichtig für- und miteinander und unterstützen uns gegenseitig. Bringe mit uns Deine Karriere voran und nutze die vielfältigen Möglichkeiten, Dich individuell weiterzuentwickeln, Dein Wissen und Deine Ideen zu teilen und auszubauen sowie Projekte eigenverantwortlich zu übernehmen.Was wir gemeinsam vorhabenSollte unter den aktuellen Stellenangeboten gerade nicht das Richtige für Dich dabei sein, dann bewerbe Dich gerne für unseren Talentpool. Sobald wir ein passendes Stellenangebot für Dich haben, finden wir Dich im Talentpool schnell und einfach und nehmen mit Dir Kontakt auf. Interessante Informationen zu Karriere-Events und Veranstaltungen der Tagueri können wir Dir über den Talentpool zukommen lassen. Der Talentpool der Tagueri ist für Dich kostenlos und 100% vertraulich.Womit Du überzeugst Du überzeugst, wenn Du Dich in einem der folgenden Themen wiederfindest: CybersecurityData (BI)KI/AIProgrammierungSoftwareentwicklungAutomatisierungDu hast Erfahrungen in der Organisation und Abwicklung von Projekten gesammelt. Der persönliche Kontakt mit Kunden bringt Dir Spaß.Deine Offenheit, Neugier und Lernbereitschaft zeichnen Dich aus.Du verfügst über sehr gute Deutschkenntnisse in Wort und Schrift.Deine Englischkenntnisse sind gut in Wort und Schrift.Du bist bereit für regelmäßige Dienstreisen innerhalb Deutschlands. Darunter verstehen wir die grundsätzliche Flexibilität unter der Woche beim Kunden vor Ort zu sein.Worauf Du Dich freuen kannst Unsere besondere Unternehmenskultur: Herzliches und wertschätzendes Miteinander, in dem jede Persönlichkeit zählt Offener Austausch und offene Türen - vom Junior bis zum Vorstand Zahlreiche Team- und Unternehmensevents, wie unser jährliches Sommerfest zusammen mit unseren Familien Unsere Benefits für Wohlergehen und Wachstum: Smartes Arbeiten, z.B. mobil und mit flexiblen Arbeitszeitmodellen, Möglichkeit für Sabbaticals und WorkationZusatzleistungen, z.B. Corporate Benefits, attraktive betriebliche Altersvorsorge und JobRadHealth Care Benefits, z.B. vergünstigte Mitgliedschaften für Urban Sports Club und betriebliche Krankenversicherung Unser gemeinsamer Weg: Intensive Einarbeitung durch ein umfangreiches Onboarding und PatenprogrammVielfältige interne Weiterbildungsangebote und externe FördermaßnahmenInternationales Austauschprogramm zur Förderung der persönlichen und beruflichen Weiterentwicklung innerhalb der UnternehmensgruppeUnd vieles mehr.Was Du wissen solltestWir suchen Persönlichkeiten! Sende uns Deine Bewerbung mit Lebenslauf und relevanten Zeugnissen zu. Nutze dafür den \"Jetzt Bewerben\"-Button (Dateigröße max. 35 MB). Gib an, in welchen Bereich Du tätig sein möchtest und welche Erwartungen Du an Deine nächste Position hast.Über unsWir bei Tagueri sind Brückenbauer zwischen strategischer Unternehmensberatung und operativer Umsetzung. Mit rund 600 Mitarbeitenden sind wir deutschlandweit im Einsatz. Zu uns gehört auch der Energiespezialist con|energy consult gmbh. Mit unseren praxisbezogenen Beratungsmethoden und fundierter Technologieexpertise unterstützen wir namhafte Unternehmen aus den Branchen Automotive, Energie, Luft- und Raumfahrt, Bahn und Verteidigung. Die Herausforderungen unserer Kunden sehen wir als Chance, gemeinsam innovative und zukunftsfähige Lösungen im Technologie-, Projekt- und Prozessmanagement zu schaffen.* Wir bekennen uns zu den Grundsätzen der Gleichbehandlung und Nichtdiskriminierung. Die Vielfalt unserer Mitarbeiterinnen und Mitarbeiter in Bezug auf Geschlecht, Hautfarbe, Alter, Herkunft, persönliche Interessen, Religion, sexuelle Orientierung und Geschlechtsidentität betrachten wir als Bereicherung. Diskriminierendes Verhalten wird von uns nicht toleriert. Dieses Bekenntnis zu Vielfalt und Inklusion haben wir durch die Unterzeichnung der Charta der Vielfalt bekräftigt. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Henkel",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4339390266",
        "reason": "The job is for a student currently enrolled in a bachelor's or master's program, aligning with the user's preference for entry-level (intern/working student) roles while studying for a master's. It's a corporate role in sustainability data management, not cleaning or bar staff. The job description is entirely in English and does not explicitly require German or both German and English. It is not a dual study program.",
        "body": " About this Position Support the Sustainability Data team at Henkel Consumer Brands in developing and implementing digital solutions for sustainability data management and reporting, and contribute to projects related to product and corporate carbon footprinting, digital product information, and sustainability reporting.What You´ll Do Help map product-level sustainability attributes into digital formats aligned with upcoming EU regulationsAssist in improving data quality, automation processes, and data integration across different sustainability systems and databasesConduct research on sustainability data standards, digital traceability, and evolving environmental regulations such as CSRD and the Digital Product Passport (DPP)Support the implementation of the DPP including data structuring, traceability, and integration with product systemsContribute to the development of digital documentation for DPP-related processes, including internal guidelines and stakeholder presentationsAnalyze and structure environmental and product data to support transparency and performance trackingCollaborate with cross-functional teams to prepare internal documentation, training materials, and presentations on sustainability data topics What makes you a good fit Student currently enrolled in a bachelor’s or master’s program in sustainability management, environmental science, chemistry, or a related natural science fieldStrong analytical and research skills with attention to detail and data qualityInterest in sustainability data, product footprinting, and environmental reportingFamiliarity with sustainability frameworks such as the Greenhouse Gas Protocol, Life Cycle Assessment (LCA), or CSRD is an advantageExperience or interest in digital traceability, product data management, or regulatory compliance is a plusBasic understanding of data systems, QR code technologies, or digital labeling is beneficialComfortable working with Excel, Power BI, or other data visualization tools to support reporting and analysisCollaborative, proactive, and eager to learn in a dynamic international environment Some perks of joining Henkel Flexible work scheme with flexible hours, hybrid work modelDiverse national and international growth opportunitiesGlobal wellbeing standards with health and preventive care programsAttractive RemunerationGlobal ExperienceInterns CommunityWe offer you an attractive salary between € 1050 - 2270. The exact amount of the remuneration depends on the desired duration, the type of internship (voluntary or mandatory) and existing degrees.At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different genders, origins, cultures, religions, sexual orientations, generations and disabilities. If there are any specific accommodations or adjustments you require for the interview process or your on-site appointment, please inform us, and we'll do our best to accommodate your requests. ",
        "job_sum": "- **Job Title:** Intern/Working Student in Sustainability Data Management\n- **Responsibilities:** Support sustainability data team in digital solution development for data management and reporting, contribute to projects (carbon footprinting, digital product information, sustainability reporting), help map product-level sustainability attributes, improve data quality and automation, research data standards and regulations (CSRD, DPP), support DPP implementation, analyze environmental/product data, collaborate with cross-functional teams.\n- **Requirements:** Currently enrolled in a bachelor’s or master’s program (sustainability management, environmental science, chemistry, or related natural science field), strong analytical and research skills, interest in sustainability data, familiarity with frameworks like GHG Protocol/LCA/CSRD is a plus, experience/interest in digital traceability/product data management is a plus, basic understanding of data systems/QR codes is beneficial, comfortable with Excel/Power BI, collaborative, proactive.\n- **Location:** Not specified in the job description.\n- **Language Needs:** English (implied, as the entire job description is in English and no other language is explicitly required).",
        "is_match": true
    },
    {
        "title": "Provinzial Konzern",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4345262493",
        "reason": "The job is for a 'Werkstudent' (working student) which aligns with the user's preference for entry-level roles like intern/working student. It's an IT role within a corporate group, fitting the 'corporate jobs' preference. The user has a bachelor's degree, which is suitable. Crucially, while the description is in German, it does not *explicitly* state that German language proficiency is a requirement, therefore, according to the user's specific rule ('The job requires german only if it explicitly says that it does. Otherwise, you can show me.'), it matches. It is not a dual study program. All stated preferences are met.",
        "body": " 12.000 Schutzengel • 330 Berufe • 5 Standorte • 33 Nationalitäten • 5.000.000 Kund:innenAls Provinzial Konzern sind wir Versicherer und Arbeitgeber der Region mit gesellschaftlicher Verantwortung. Mit 12.000 Mitarbeiter:innen in verschiedenen Berufsgruppen begeistern wir unsere Kund:innen mit Sicherheit und Verlässlichkeit. Ob in unseren Direktionen in Münster, Düsseldorf, Hamburg, Kiel und Detmold oder vor Ort in den 1.300 Agenturen: wir haben unendlich viele Perspektiven - auch für Dich! Erfahre mehr über uns und finde auch Deine berufliche Heimat im Provinzial KonzernStarte bei uns: nach AbspracheStandort: DüsseldorfUnternehmensbereich: ITDas sind Deine Aufgaben:In unserer Abteilung IT-Textsysteme und Output erstellen wir Textdokumente und testen diese automatisiert mit Hilfe vom Robot Framework. Für diese Herausforderung suchen wir einen engagierten Werkstudenten (all genders) mit technischem Verständnis und Interesse an Testautomatisierung: Du arbeitest dich in das Robot Framework ein; bei Bedarf unterstützen wir Dich mit Schulungen.Du lernst unsere Testprozesse kennen und setzt sie aktiv ein.Du wirkst an der Definition und Automatisierung von Testfällen mit.Du arbeitest eng mit erfahrenen Kolleg:innen zusammen, die Dich bei Deinen Aufgaben unterstützen.Das bringst Du mit: Du studierst in den Bereichen der Informatik, Wirtschaftsinformatik oder einem vergleichbaren Studiengang.Du hast erste Erfahrungen mit Python, HTML, Java Script und CSS gesammelt und idealerweise Vorkenntnisse in Robot Framework.Du arbeitest selbständig und engagiert und bist motiviert, Dich in neue Themengebiete einzuarbeiten.Du bringst eine ausgeprägte Lernbereitschaft und Freude an Teamarbeit mit.Das bieten wir Dir:Kostenloses Mittagessen und Coffee Lounge • Flexible Arbeitszeiten und aktiv gelebte Work-Life-Balance • Home Office • Innovatives Gesundheitsmanagement • Studierendencommunity • Unterstützung von Bachelor- und MasterarbeitenHaben wir Dein Interesse geweckt? Dann freuen wir uns auf Deine Bewerbung.Wir haben eine Vielzahl verschiedener Perspektiven bei uns im Konzern. Auch wenn Du nicht alle Anforderungen erfüllst, bist Du vielleicht genau richtig für diese oder eine andere Aufgabe.Bitte klick auf \"Jetzt bewerben\" und sende uns Deine Unterlagen zu.Immer da, immer nahHelen EngelPersonalTelefon: +49 211 978-1446E-Mail: karriere@provinzial.com ",
        "job_sum": {
            "Job Title": "Working Student (Werkstudent) for Test Automation in IT Text Systems and Output",
            "Responsibilities": [
                "Learn and work with Robot Framework (training provided if needed).",
                "Understand and actively implement test processes.",
                "Participate in the definition and automation of test cases.",
                "Collaborate closely with experienced colleagues."
            ],
            "Requirements": [
                "Enrolled student in Computer Science, Business Informatics, or a comparable field.",
                "First experience with Python, HTML, JavaScript, and CSS (ideally with Robot Framework).",
                "Independent, engaged, and motivated to learn new topics.",
                "Strong willingness to learn and enjoy teamwork."
            ],
            "Location": "Düsseldorf",
            "Language Needs": "Not explicitly stated as a requirement in the job description."
        },
        "is_match": true
    },
    {
        "title": "BWI GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4346023693",
        "reason": "The job matches all user preferences: It does not explicitly require German and English skills, is not a dual study program, is a corporate IT job, aligns with entry-level (student role), and does not require a completed degree but accepts ongoing studies or relevant experience. The user's bachelor's degree is a good fit for 'Erfahrung in einem relevanten Bereich'.",
        "body": " Sorge gemeinsam mit uns für die digitale Zukunftsfähigkeit der Bundeswehr.Als primärer Digitalisierungspartner der Bundeswehr erbringen wir stabile, sichere und effiziente IT-Services im In- und Ausland, vom Grundbetrieb bis in den einsatznahen Bereich und tragen so zur kontinuierlichen Erhöhung der Führungs- und Einsatzfähigkeit der Bundeswehr bei. Mit über 7.700 Kolleg*innen betreiben und modernisieren wir eine der größten und komplexesten IT-Infrastrukturen in Deutschland. Wir suchen verantwortungsvolle IT-Spezialist*innen, die die Bundeswehr-IT aus Überzeugung in herausfordernden Digitalisierungsvorhaben weiterentwickeln und so einen Beitrag zur Sicherheit Deutschlands leisten wollen.Die Abteilung QM stellt für Informationssicherheit und Datenschutz die Konformität (Gesetze/ vertraglich / BWI zentral) in der SSD sicher. Sie übernehmen die dazu notwendigen Rollen, um die Umsetzung der Rahmenbedingungen und Vorgaben sicherzustellen. Für das Qualitäts-, Risiko- und Projektmanagement vertritt sie die Belange der SSD. Für alle voran genannten Punkte stellt sie die Governance sicher und wirkt aktiv an der Optimierung der Prozesse mit.Deine Aufgaben: Analyse und Optimierung bestehender ArbeitsprozesseAutomatisierung von ProzessenUnterstützung bei der Entwicklung eines neuen ToolsDokumentation der automatisierten Workflows in allen Unternehmensbereichen Dein Profil: Laufendes Studium oder Erfa hrung in einem relevanten Bereich (z. B. Informatik, Wirtschaftsinformatik, o.ä.) Erfahrung im Umgang mit Prozessdokumentation und -automatisierung Eine schnelle Auffassungsgabe und die Fähigkeit, eigenständig Lösungen zu entwickeln Wir bieten: Spannende und abwechslungsreiche Aufgaben in einem innovativen und bedeutsamen Umfeld Mitarbeit bei Projekten mit hoher Relevanz für den Kunden Bundeswehr Wir ermöglichen Ihnen Flexibilität, um Beruf und Privatleben in Einklang zu bringen, etwa durch mobiles Arbeiten oder Vertrauensarbeitszeit Attraktive Vergütung ",
        "job_sum": "- **Job Title:** IT Specialist for Process Analysis & Automation (Student/Entry-Level)\n- **Responsibilities:** Analyze and optimize existing work processes, automate processes, support the development of new tools, and document automated workflows across company divisions.\n- **Requirements:** Ongoing studies or experience in a relevant field (e.g., Computer Science, Business Informatics), experience with process documentation and automation, quick comprehension, and the ability to develop independent solutions.\n- **Location:** Not specified (BWI GmbH operates across Germany).\n- **Language Needs:** Not explicitly stated. The job description is in German, but no specific language proficiency (German or English) is listed as a requirement.",
        "is_match": true
    },
    {
        "title": "360 Consulting GmbH",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4350167422",
        "reason": "The job explicitly requires 'Good performance in German, English, Mathematics' (Gute Leistungen in Deutsch, Englisch, Mathematik), which means both German and English are needed. Your preference clearly states: 'If the job says that it requires german and english, do not show it.' Additionally, the internship is described as being for 'retraining or school education' (Umschulung bzw. schulische Ausbildung), which does not align with your current status as a Master's student and falls under the type of programs you stated you cannot apply to.",
        "body": " Suchst Du einen Praktikumsplatz für Deine Umschulung bzw. schulische Ausbildung?Dich zeichnen eine sorgfältige Arbeitsweise, Kommunikationstalent und Freude am Umgang mit modernen Technologien aus?Dann absolviere Dein Praktikum im Rahmen Deiner Umschulung in unserem innovativen Unternehmen in Köln.360 Consulting GmbH ist ein energiegeladenes Unternehmen, das Microsoft Dynamics ERP und CRM Software-Lösungen für mittelständische Unternehmen verschiedenster Branchen anbietet und Kunden professionell bei der Optimierung ihrer Geschäftsprozesse durch den Einsatz von Microsoft Dynamics 365 Lösungen unterstützt.Als Praktikant für Daten -und Prozessanalyse berätst Du beim Kunden Geschäftsprozesse und erstellst Konzepte für die beste Business-IT-Lösung und führst eigenständig erste Inhouse-Projekte mit Dynamics durch.Wir bieten Dir spannende Aufgaben, Praxisnähe und eine zuverlässige Betreuung während Deiner Praktikumszeit, sowie eine Perspektive auf eine spätere Vollzeit-Anstellung.Einstiegszeitpunkt: ab sofortBefristung: mind. 6 Monate (es darf auch 2x3 Monate oder 9 Monate sein)Ansprechpartnerin:Frau Lisa SchuppeliusTel.: +49 (221) 99783106-33360 Consulting GmbHZollstockgürtel 6550969 KölnAufgaben ERP-Systeme unterstützen Unternehmen bei der Abwicklung der Produktion, Supply Chain, Finance und VerkaufDu entwickelst neue Lösungen rund um MS Dynamics 365 für unsere Kundschaft, indem du bestehende Software erweiterst oder sie neu einführstDu führst Customizing und Konfigurationen an der Software durchDu behebst Fehler in bestehenden Systemen unserer KundschaftDu führst Systemtests durch, damit die Software und Schnittstellen funktionierenQualifikation Leidenschaft für IT-Themen und DigitalisierungSelbstständigkeit, Eigeninitiative &amp; TeamfähigkeitHohe Lern- und Leistungsbereitschaft und ein gutes OrganisationsvermögenLogisch-systematisches DenkenErste Erfahrungen in der ProgrammierungGute Leistungen in Deutsch, Englisch, MathematikAnalytisches Denken bei der Identifikation der AnforderungenBenefits Eine angenehme Arbeitsatmosphäre in einer agilen und modernen UmgebungEigenständiges Arbeiten mit Raum zur individuellen EntfaltungEine langfristige PerspektiveArbeit in einer modernen IT-InfrastrukturOffene und transparente UnternehmenskulturKostenlose ParkplätzeDankeschön- und Geschenkaktionen nach erfolgreichen ProjektenPrämien nach bestandener IHK-PrüfungFlexible Arbeitszeiten und Homeoffice-MöglichkeitenWeiterbildungsmöglichkeiten und ZertifizierungenFirmenveranstaltungen und TeameventsMitarbeiterrabatte – z. B. Unterstützung bei der Mitgliedschaft in FitnessstudiosBewirb Dich jetzt online mit Deinen vollständigen Bewerbungsunterlagen (idealerweise mit Angabe des Wunscheinsatzbereichs und des Praktikumszeitraums): AnschreibenLebenslaufZeugnisse und sonstige ReferenzenWir freuen uns schon, dich kennenzulernen! Suchst Du einen Praktikumsplatz für Deine Umschulung bzw. schulische Ausbildung?Dich zeichnen eine sorgfältige Arbeitsweise, Kommunikationstalent und Freude am Umgang mit modernen Technologien aus?Dann absolviere Dein Praktikum im Rahmen Deiner Umschulung in unserem innovativen Unternehmen in Köln.360 Consulting GmbH ist ein energiegeladenes Unternehmen, das Microsoft Dynamics ERP und CRM Software-Lösungen für mittelständische Unternehmen verschiedenster Branchen anbietet und Kunden professionell bei der Optimierung ihrer Geschäftsprozesse durch den Einsatz von Microsoft Dynamics 365 Lösungen unterstützt.Als Praktikant für Daten -und Prozessanalyse berätst Du beim Kunden Geschäftsprozesse und erstellst Konzepte für die beste Business-IT-Lösung und führst eigenständig erste Inhouse-Projekte mit Dynamics durch.Wir bieten Dir spannende Aufgaben, Praxisnähe und eine zuverlässige Betreuung während Deiner Praktikumszeit, sowie eine Perspektive auf eine spätere Vollzeit-Anstellung.Einstiegszeitpunkt: ab sofortBefristung: mind. 6 Monate (es darf auch 2x3 Monate oder 9 Monate sein)Ansprechpartnerin:Frau Lisa SchuppeliusTel.: +49 (221) 99783106-33360 Consulting GmbHZollstockgürtel 6550969 KölnBewirb Dich jetzt online mit Deinen vollständigen Bewerbungsunterlagen (idealerweise mit Angabe des Wunscheinsatzbereichs und des Praktikumszeitraums):Wir freuen uns schon, dich kennenzulernen!",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "CGI",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4315867791",
        "reason": "The job explicitly requires 'Sehr gute Deutschkenntnisse (mindestens C1-Niveau)' (Very good German skills, at least C1-level). The user stated they do not know German and should not be shown jobs that require it.",
        "body": " StellenbeschreibungCGI ist einer der weltweit größten unabhängigen Anbieter von IT- und Geschäftsprozess-Dienstleistungen. Allein in Deutschland sind wir an über 29 Standorten mit rund 4.500 Mitarbeiter:innen vertreten und bieten Dir beste Bedingungen für Deine Karriere in der IT. Als innovatives Unternehmen setzen wir auf die Vernetzung von Systemen und Menschen, die Grundlage für den Erfolg vieler Projekte und Unternehmen. Unsere Kundenprojekte sind überwiegend im Raum Berlin und Köln angesiedelt. Zur Verstärkung unseres Teams suchen wir engagierte und erfahrene IT – Consultant – Open Data und Digital Governance (m/w/d).In dieser Rolle arbeitest du an vielseitigen und zukunftsweisenden IT- und Datenprojekten und begleitest öffentliche Institutionen auf ihrem Weg in die digitale und transparente Verwaltung. Du unterstützt insbesondere die Umsetzung der Open-Data-Verpflichtungen nach 12a EGovG und trägst dazu bei, Daten des Bundes offen, zugänglich und nutzbar zu machen.Aufgaben Beratung von Auftraggeber:innen aus dem öffentlichen Sektor zu Themen wie Open Data, Datenmanagement, IT-Architektur und Digital Governance Mitwirkung bei der Konzeption, Steuerung und Umsetzung von Open-Data-Strategien gemäß12a EGovG („Offene Daten des Bundes“) Unterstützung bei der Erfassung, Pflege und Veröffentlichung von Metadaten und Datensätzen auf GovData sowie weiteren Datenportalen Optimierung und Digitalisierung von Prozessen rund um die Datenbereitstellung in Behörden – von der Datenidentifikation bis zur Veröffentlichung Je nach Erfahrung übernimmst du Verantwortung für eigene Arbeitspakete, Teilprojekte oder ProjektleitungenQualifikation Abgeschlossenes Studium im Bereich (Wirtschafts-)Informatik, Informationsmanagement, Verwaltungswissenschaften, Data Science oder eine vergleichbare Qualifikation Erste Praxis- oder Projekterfahrung in der Beratung, öffentlichen Verwaltung oder IT mit Bezug zu Themen wie Open Data, Datenmanagement oder Digital Governance Erfahrung oder Interesse an Metadatenstandards (z. B. DCAT-AP.de) und Datenportalen wie GovData Verständnis für Prozessoptimierung, Automatisierung und Digitalisierung in der Verwaltung Sehr gute Deutschkenntnisse (mindestens C1-Niveau)WAS WIR BIETEN: Bei uns findest du Kolleg:innen, mit denen die Zusammenarbeit Spaß macht. Wir begegnen uns offen, duzen uns über alle Positionen hinweg und denken nicht in Hierarchien oder Silos. Du profitierst von flexiblen Arbeitszeiten und Hybrid Work: In der Regel arbeitest du zu Hause, kannst aber auch an einen unserer Standorte kommen und bist nur bei Bedarf beim Kunden vor Ort – das könnte etwa einmal in zwei Wochen sein. Das Kundenunternehmen, für das du arbeitest, ist meist ganz in deiner Nähe – weil wir Kundennähe wörtlich nehmen und uns Work-Life-Balance am Herzen liegt. Deine Weiterentwicklung wird individuell gefördert: zum Beispiel mit Trainings, Zertifizierungen, dem Besuch von Konferenzen und Fachvorträgen sowie einem auf dich zugeschnittenen Entwicklungsplan. Einen Teil deines Bruttogehalts kannst du in CGI-Aktien investieren – bis maximal 3 % des Monatsgehalts geben wir für jeden Euro einen weiteren hinzu. Außerdem beteiligen wir dich am Unternehmenserfolg: Du erhältst eine Gewinnbeteiligung, die sich nach deiner individuellen Leistung richtet sowie danach, wie wir als Unternehmen unsere finanziellen Ziele erreichen konnten. Mit Jobticket und Jobbike fördern wir umweltfreundliche Mobilität. Abhängig von deiner Rolle und Projektsituation sind auch Bahncard oder Elektro-Firmenwagen möglich. Sabbatical oder Elternzeit werden unterstützt. Sie sind bei uns kein Karriere-Stopper! Eine Vielzahl an gemeinsamen Events und Freizeitaktivitäten stärkt deine Verbundenheit mit deinen Kolleg:innen.Together, as owners, let’s turn meaningful insights into action.1976 gegründet und nach wie vor familiengeführt, ist CGI heute einer der weltweit größten unabhängigen Anbieter von IT und Business Consulting. Ein hohes Maß an Eigenverantwortung, Teamwork, Respekt und Zusammenhalt machen das Arbeiten bei uns besonders. Bei uns kannst du dein volles Potenzial entfalten!Du darfst dich vom ersten Tag an als Miteigentümer:in von CGI verstehen. Wir lassen unsere Vision gemeinsam Wirklichkeit werden. Wir profitieren von unserem gemeinsamen Erfolg und haben die Möglichkeit und die Verantwortung, die Strategie und Ausrichtung unseres Unternehmens aktiv mitzugestalten.Deine Arbeit schafft Mehrwert. Du findest innovative Lösungen und stärkst dein Netzwerk aus Kolleg:innen und Kunden. Gleichzeitig hast du Zugang zu globalen Ressourcen, um große Ideen zu verwirklichen, neue Chancen zu nutzen und von der immensen Branchen- und Technologie-Kompetenz zu profitieren.Du bringst deine Karriere voran, da du in einem Unternehmen arbeitest, das auf Wachstum und Langlebigkeit ausgelegt ist. Du wirst von Führungskräften unterstützt, die deine Gesundheit und Zufriedenheit fördern – und dir Möglichkeiten bieten, deine Fähigkeiten zu vertiefen und deinen Horizont zu erweitern. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Skaylink",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4346092861",
        "reason": "The job explicitly requires a good command of both German and English, which goes against your preference of not showing jobs that require both. Additionally, this is an 'Ausbildung' (apprenticeship), which is a vocational training program not suitable for someone currently studying a Master's degree, similar to how dual study programs are unsuitable.",
        "body": " Starte deine IT-Karriere als Auszubildende*r Fachinformatiker für IT-Security (m/w/d) in Essen!Du möchtest nicht nur verstehen, wie IT funktioniert, sondern auch dafür sorgen, dass Systeme sicher, stabil und geschützt bleiben? Dann bist du bei uns genau richtig!Als IT-Dienstleister mit starkem Fokus auf Security bilden wir dich praxisnah im Bereich IT-Sicherheit, SOC und moderne Schutzmechanismen aus. Du wirst von Anfang an Teil unseres Security-Teams und legst den Grundstein für eine langfristige Karriere in der Cyber-Security.Neugierig? Dann bewirb dich jetzt und werde Teil unseres Teams! 🚀Was du bei uns machst Du lernst die Grundlagen moderner IT- und Security-Infrastrukturen kennen und arbeitest in sicherheitsnahen IT-Umgebungen. Du unterstützt bei der Dokumentation von Systemen, Prozessen und IT-Sicherheitsmaßnahmen. Du arbeitest an automatisierten Abläufen und technischen Workflows mit und hilfst dabei, diese weiterzuentwickeln. Du unterstützt bei der Umsetzung und Pflege von Berechtigungs- und Sicherheitskonzepten in IT-Umgebungen. Du übernimmst schrittweise Verantwortung für eigene Aufgaben und arbeitest eng mit erfahrenen Kolleg*innen zusammen. Wann du zu uns passt Du hast das Fachabitur abgeschlossen oder bringst einen ähnlichen Abschluss mit. ODER: Dein Studium war dir zu trocken? Kein Problem! Wenn du lieber praxisnah arbeiten möchtest, bieten wir dir die perfekte Möglichkeit, in die Berufswelt einzutauchen.Die IT-Welt ist schnelllebig – deshalb solltest du bereit sein, dich kontinuierlich weiterzuentwickeln und Neues zu lernen.Du bist kommunikativ und möchtest unsere Kunden durch effiziente Unterstützung überzeugen. Dabei scheust du dich nicht, selbstständig Lösungen zu finden.Du hast Spaß und Talent am Organisieren und konntest idealerweise erste Erfahrungen durch Praktika sammeln.Teamgeist, Einsatzbereitschaft und eine Menge Spaß an der Arbeit runden dein Profil ab.Du verfügst über ein gutes Sprachgefühl in Deutsch und Englisch.Hey, wir sind Skaylink.Starte deine Ausbildung bei uns und begleite uns auf unserer Cloud Journey!Bei uns arbeiten Europas beste Expert*innen für Cloud-Lösungen und digitale Transformation zusammen. Die Vielfalt unserer Hintergründe, Kulturen und Kompetenzen ist Trumpf und zentral für unsere hohen Ziele und großen Erfolge. Bei uns spielt es keine Rolle, ob du Bluse, Polo oder Hoodie trägst – was zählt, ist deine Persönlichkeit, Expertise und Leidenschaft. Damit trägst du auf deine eigene Art und Weise dazu bei, dass wir einer der führenden Anbieter im Bereich Cloud-Technologie sind und bleiben!Im Sinne unserer Customer Dedication legen wir viel Wert darauf, Projekte mit Stil und größter Sorgfalt zu begleiten, Schema F ist nicht unser Ding. Daher bieten wir unseren Kund*innen mit maßgeschneiderten Frameworks und innovativen Methoden einen schnellen und sicheren Weg in die Cloud.Was du von uns hast🎯 Purpose – Von Anfang an richtig mit anpacken (in Projekten bei renommierten Unternehmen wie BMW Group, Henkel oder KWS)📖 Entwicklung – Ankommen und Weiterkommen (Skaylink Campus, Entwicklungsgespräche, regelmäßige Befragungen der Mitarbeitenden)🏖️ Erholung – Kraft tanken (30 Tage Urlaub, 24+31.12 frei)🚲 Mobilität – Von A nach B kommen (Zuschuss zum Deutschland-Ticket)💻 Ausstattung – Technik, die dich voranbringt (moderne Windows Laptops)💪 Unterstützung – Fühl dich wohl (Employee Referral Program, Corporate Benefits, Arbeitsplatzbrille, jährlich 5 bezahlte Kind-krank-Tage)🏆 Events – Zusammenkommen und Feiern (Sommer- und Weihnachtsfeier, Teamevents, Cross-Company Tech-Talks)🧩 Miteinander – We are Skaylink!Du + Skaylink = Perfect Match? Dann bewirb dich jetzt für deine Ausbildung bei uns! Wir benötigen deinen Lebenslauf und deine Zeugnisse und sind schon ganz gespannt darauf, von dir zu lesen.Wir freuen uns auf die gemeinsame (Cloud) Journey mit dir!Ready. Set. Skaylink! Du hast noch Fragen, die weder auf unserer Karriereseite noch in den FAQs beantwortet werden? Dann melde dich bei uns!We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Deloitte",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4334566979",
        "reason": "The job explicitly requires 'Deutsch (C1) und Englisch sehr gut in Wort und Schrift'. The user stated: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know! They wont accept anyone that only knows english if they require both of them!'. This job fails the language requirement.",
        "body": " Deloitte bietet führende Prüfungs- und Beratungsleistungen in Audit &amp; Assurance, Tax &amp; Legal, Consulting und Advisory - für nahezu 90 % der Fortune Global 500® und zahlreiche private Unternehmen. Wir liefern innovative Denkansätze, lösen komplexe Herausforderungen und fördern nachhaltiges Wachstum. Mit rund 470.000 Mitarbeitenden weltweit eröffnen wir hervorragende Karrierechancen - getragen von einem starken „Wir“ und einer Vielfalt an Perspektiven und Fähigkeiten.Du bist Absolvent:in oder beabsichtigst, in Kürze dein Studium zu beenden? Unser Trainee-Programm im Team Consulting - Artificial Intelligence &amp; Data ist dein perfektes Sprungbrett in eine Karriere mit Fokus auf datengetriebene Transformationen mit Unterstützung von künstlicher Intelligenz. Sichere unseren gemeinsamen Erfolg und mach mit uns den Unterschied: als Trainee Cloud &amp; Data / Artificial Intelligence &amp; Data (m/w/d).Hard Facts für deinen Einstieg: Beginn: 01.04.2026Dauer: 12 Wochen Trainingsprogramm in unbefristeter FestanstellungBewerbungsschluss: Sonntag, den 08.02.2026Standorte: Berlin, Düsseldorf, Frankfurt (Main), Hamburg, Hannover, Köln, München und Stuttgart.Dein Impact:Als Trainee Cloud &amp; Data (m/w/d) bist du bereit für den Einstieg in die Unternehmensberatung mit Schwerpunkt Cloud &amp; Data Analytics. Nach Abschluss deines zwölfwöchigen Trainings nimmst du nahtlos den Weg ins Projektgeschäft und nutzt deine erlernten Fähigkeiten, um Mehrwert für unsere Kunden zu schaffen. Verantwortung: Führe Artificial Intelligence &amp; Data Projekte im Team zum Erfolg und begleite ihre Lösung vom strategischen Design bis hin zur technischen Umsetzung.Unterstützung: Erarbeite innovative Einsatzmöglichkeiten von Artificial Intelligence Lösungen zur Verbesserung der Effizienz und Effektivität des Data Management.Großkunden: Arbeite mit prestigeträchtigen Kunden an der Analyse und Aufbereitung von multi-strukturierten Datenbeständen.Innovation: Du erlernst die modernsten (Cloud-) Technologien für datengetriebene Transformation und bereitest dich mit umfassenden Trainings auf Zertifizierungen in für dich interessanten Cloud-, Datenmanagement oder Automatisierungstechnologien auf den Berateralltag vor.Dein Skillset: Abschluss eines Studiums in (Wirtschafts-)Informatik, (Wirtschafts-) Ingenieurwesen, Wirtschaftswissenschaften mit Informatikbezug oder vergleichbaren StudiengängenErste berufliche Erfahrungen durch Praktika oder Werkstudententätigkeiten, idealerweise in der Unternehmensberatung im Umfeld von Analytics, Gen AI und Cloud TechnologienProgrammierkenntnisse in Python, SQL, Java oder Scala sowie optional Frameworks wie Spark und DatabricksInteresse an der teamorientierten, agilen Projektarbeit und am Einstieg in die UnternehmensberatungReisebereitschaft sowie Deutsch (C1) und Englisch sehr gut in Wort und SchriftDeine Chance: Spannende Aufgaben in einem innovativen Umfeld mit hochmotivierten Kolleg:innen, die sich schon jetzt auf deine Impulse freuenGute Rahmenbedingungen mit attraktivem Gehalt und zahlreichen Zusatzleistungen, z. B. Firmen-Smartphone zur privaten Nutzung, Fahrradleasing und Corporate BenefitsWork-Life-Balance durch Mobile Working &amp; Teilzeit, EU Remote Working, Sabbaticals, Mitarbeiter:innen-Events, Well-being Angebote wie z. B. Gesundheitstage, Kooperationen mit Fitness-Anbietern und den Familienservice, der dich bei privaten Herausforderungen unterstütztExzellente Weiterbildung an der Deloitte University, in On- und Offline-Seminaren und im Rahmen der Berufsqualifikation, z. B. durch folgende Schulungen: „Microsoft Azure Data Engineer“ und „Google Cloud Platform Data Engineer“Vielfältige Gestaltungsspielräume und aktive Förderung einer inklusiven Unternehmenskultur – u. a. durch unsere Diversity &amp; Inclusion Mitarbeiter:innen-NetzwerkeBist du bereit? Mach mit uns den Unterschied!Unser Recruiting-Team freut sich auf deine Bewerbungsunterlagen (CV sowie Abitur-, Hochschul- und Arbeitszeugnisse) über unser Online-Formular. Ein Anschreiben und ein Bewerbungsfoto sind bei uns nicht erforderlich.Gleiche Chancen für alle: Wir freuen uns über Bewerbungen von Menschen, die so vielfältig sind wie wir – unabhängig von Alter, Behinderung, ethnischer Herkunft und Nationalität, Geschlecht, Religion, sexueller Orientierung oder sozialer Herkunft. Noch Fragen? Alle Infos zu unserem Bewerbungsprozess findest du in unseren Bewerbungs-FAQs.Dein Kontakt bei Fragen rund um KarrierethemenUnser Team Talent Acquisition – Aleksandra, Anja, Julia, Lea, Lisa, Silja und ihre Teams – unterstützt dich gerne bei allen Fragen rund um deine Karriere bei Deloitte. Du erreichst uns per E-Mail unter career@deloitte.de oder telefonisch unter +49 211 87724111.Job-ID: 48207 ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "twomynds",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4350361765",
        "reason": "The job explicitly requires 'Fließende Deutschkenntnisse (C1+)' (fluent German skills), and the user stated that they do not know German. The user's preference is to not show jobs that require German if they do not know it.",
        "body": " Du willst sehen, wie deine Arbeit direkt Management-Entscheidungen beeinflusst und in echten Use Cases Mehrwert schafft – bei Unternehmen, die du aus dem Alltag kennst? Willkommen bei twomynds.Wir sind eine dedizierte Data-&amp;-AI-Beratung sowie ein Service Provider mit End-to-End-Umsetzung und begleiten Unternehmen von der strategischen Zielsetzung bis zur operativen Realisierung – strategisch, umsetzungsstark und ergebnisorientiert. Unsere Mission: Ambitionierte Unternehmen befähigen, Data &amp; AI in geschäftskritischen Mehrwert zu verwandeln – mit strategischer Klarheit, technischer Exzellenz und unternehmerischer Umsetzung.Von der Datenstrategie über KI- und Use-Case-Implementierung in interdisziplinären Teams bis zu skalierbaren Plattformen – wir begleiten unsere Kunden entlang der gesamten Wertschöpfungskette. Wir identifizieren Potenziale in Märkten und Geschäftsmodellen, übersetzen sie in konkrete, priorisierte Maßnahmen für Marketing, Sales und Produkte – und bringen diese gemeinsam mit unseren Kunden messbar in die Umsetzung. Wir sind branchenagnostisch – mit viel Erfahrung in kundennahen digitalen Geschäftsmodellen, insbesondere in Medien und Sport.Was uns auszeichnet End-to-End-Ansatz: Von der Business-Strategie bis zum laufenden Betrieb.Klare Werte: Perform. Grow. Communicate. Dedicate. Balance.Wachstum &amp; Entwicklung: Weiterbildungsbudget, Mentoring &amp; individuelle Karrierepfade.Flexibilität: Moderne Arbeitsmodelle mit Remote-Optionen (1x Woche fixer Office Days)Teamkultur: Diverses, ambitioniertes Team mit Offsites, Urban Sports &amp; Workations.Deine Rolle – Werkstudent:in Business &amp; Data Analyst ConsultantDu hast Lust, Geschäftsmodelle zu verstehen, Kundendaten zu analysieren und gemeinsam mit unseren Kunden die richtigen Wachstumshebel zu finden? Als Werkstudent:in im Bereich Business &amp; Data Analytics baust du die Brücke zwischen Daten, Business und Entscheider:innen.Du arbeitest an strategischen Fragestellungen in Marketing, Sales und CRM, unterstützt das Projektteam bei der Auswertung von Daten und Implementierung von Data &amp; AI Use Cases und leitest daraus konkrete Maßnahmen zur Optimierung ab.Aufgaben Analyse von Kundendaten: Du analysierst Märkte, Kampagnen und Kundendaten (z.B. Customer Journeys), identifizierst Potenziale und unterstützt bei der Ableitung Handlungsempfehlungen für Marketing, Sales und Produkt ab.Mitgestaltung von Data- &amp; AI-Use-Cases: Du unterstützt bei der Entwicklung von Use Cases mit – z. B. Personalisierung, Next Best Action/Offer, Churn Prevention oder Kampagnenoptimierung.Zahlen in Stories &amp; Entscheidungen übersetzen: Du arbeitest mit Reports und Auswertungen, bereitest Zahlen so auf, dass sie verständlich werden, und unterstützt dabei, daraus Entscheidungsgrundlagen zu bauen (Data Analytics).Unterstützung bei Strategie- und Konzeptarbeit: Du arbeitest mit dem Projektteam an Präsentationen, Konzepten und Roadmaps für das Top-Management, strukturierst Inhalte und hilfst, komplexe Themen klar und auf den Punkt zu bringen.Qualifikation Studium: Du bist bist aktuell im Studium in den Bereichen Wirtschaft, (Wirtschafts-)Informatik, Data &amp; Business, Marketing, Sales o. Ä. Praktische Erfahrungen durch Praktika oder Werkstudierendenjobs in Beratung, Marketing, Digital, Analytics oder ähnlichen Bereichen sind von Vorteil – aber keine Voraussetzung.Business-Verständnis &amp; Neugier: Du interessierst dich für Geschäftsmodelle, Marketing- und Sales-Prozesse sowie Data Analytics – und hast Spaß daran, Probleme strukturiert zu zerlegen und Lösungen zu entwickeln.Sicher im Umgang mit Zahlen: Du kannst mit KPIs, Reports und Analysen umgehen, sie einordnen und daraus sinnvolle Schlüsse ziehen. Erfahrung mit BI-Tools (z. B. Power BI) / Data Analytics sind von Vorteil.Arbeit mit großen Datenmengen: Du verarbeitest große Datenmengen in Business-Intelligence-Tools (primär Power BI) und unterstützt bei der Entwicklung von Datenstrategien von der Beschaffung über die Modellierung bis zur intelligenten Visualisierung.Arbeitsweise &amp; Mindset: Hohe Eigenverantwortung, Proaktivität und der Wunsch, Themen end-to-end mit voranzutreiben. Du magst es, in einem ambitionierten Umfeld zu arbeiten und Verantwortung zu übernehmen.KI als Hebel: Du weißt KI für dich zu nutzen: Du setzt KI Tools ein, um Analysen zu beschleunigen, Inhalte zu strukturieren und Prozesse zu optimieren.Sprachen: Fließende Deutschkenntnisse (C1+), gute Englischkenntnisse sind ein Plus.Benefits Du arbeitest in einem jungen, wachsenden Team mit der Möglichkeit, twomynds aktiv mitzugestalten und sehr nah an Geschäftsprozessen und Entscheidungen dabei zu sein.Möglichkeit, schnell Verantwortung zu übernehmen, intern aufzusteigen und dich fachlich wie persönlich weiterzuentwickeln – unterstützt durch Mentoring, Sparring und Weiterbildungsbudget.Flexible Arbeitszeiten und hohe Remote-Flexibilität.Du arbeitest an spannenden Projekten mit bekannten Marken aus Medien, Sport, Telekommunikation und Industrie – von strategischen Konzepten über Enablement bis zur Umsetzung.Schick uns deinen Lebenslauf und wir melden uns garantiert innerhalb von 10 Tagen mit einer Rückmeldung bei dir. Du willst sehen, wie deine Arbeit direkt Management-Entscheidungen beeinflusst und in echten Use Cases Mehrwert schafft – bei Unternehmen, die du aus dem Alltag kennst? Willkommen bei twomynds.Wir sind eine dedizierte Data-&amp;-AI-Beratung sowie ein Service Provider mit End-to-End-Umsetzung und begleiten Unternehmen von der strategischen Zielsetzung bis zur operativen Realisierung – strategisch, umsetzungsstark und ergebnisorientiert. Unsere Mission: Ambitionierte Unternehmen befähigen, Data &amp; AI in geschäftskritischen Mehrwert zu verwandeln – mit strategischer Klarheit, technischer Exzellenz und unternehmerischer Umsetzung.Von der Datenstrategie über KI- und Use-Case-Implementierung in interdisziplinären Teams bis zu skalierbaren Plattformen – wir begleiten unsere Kunden entlang der gesamten Wertschöpfungskette. Wir identifizieren Potenziale in Märkten und Geschäftsmodellen, übersetzen sie in konkrete, priorisierte Maßnahmen für Marketing, Sales und Produkte – und bringen diese gemeinsam mit unseren Kunden messbar in die Umsetzung. Wir sind branchenagnostisch – mit viel Erfahrung in kundennahen digitalen Geschäftsmodellen, insbesondere in Medien und Sport.Was uns auszeichnetDeine Rolle – Werkstudent:in Business &amp; Data Analyst ConsultantDu hast Lust, Geschäftsmodelle zu verstehen, Kundendaten zu analysieren und gemeinsam mit unseren Kunden die richtigen Wachstumshebel zu finden? Als Werkstudent:in im Bereich Business &amp; Data Analytics baust du die Brücke zwischen Daten, Business und Entscheider:innen.Du arbeitest an strategischen Fragestellungen in Marketing, Sales und CRM, unterstützt das Projektteam bei der Auswertung von Daten und Implementierung von Data &amp; AI Use Cases und leitest daraus konkrete Maßnahmen zur Optimierung ab.Schick uns deinen Lebenslauf und wir melden uns garantiert innerhalb von 10 Tagen mit einer Rückmeldung bei dir.",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Deloitte",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4316310994",
        "reason": "This job does not match your preferences for two main reasons: \n1. It explicitly requires 'Deutsch und Englisch sehr gut in Wort und Schrift' (German and English very good in spoken and written word), which goes against your preference of not showing jobs that require both languages. \n2. The job asks for 'Erste Erfahrung (2-5 Jahre)' (First experience (2-5 years)) and is for a 'Quereinsteiger SAP' (SAP Career Changer), which is not an entry-level 'working student' or 'intern' job as you requested.",
        "body": " Deloitte bietet führende Prüfungs- und Beratungsleistungen in Audit &amp; Assurance, Tax &amp; Legal, Consulting und Advisory - für nahezu 90 % der Fortune Global 500® und zahlreiche private Unternehmen. Wir liefern innovative Denkansätze, lösen komplexe Herausforderungen und fördern nachhaltiges Wachstum. Mit rund 470.000 Mitarbeitenden weltweit eröffnen wir hervorragende Karrierechancen - getragen von einem starken „Wir“ und einer Vielfalt an Perspektiven und Fähigkeiten.Du willst im Bereich Consulting – SAP internationale Kunden bei der Planung und Umsetzung komplexer SAP-Transformationen begleiten? Unser multidisziplinäres Team unterstützt Unternehmen in anspruchsvollen Projekten, von der Konzeption bis zum Betrieb. Sichere unseren gemeinsamen Erfolg und mach mit uns den Unterschied: als Quereinsteiger SAP (m/w/d).Standorte: Leipzig, Berlin, Düsseldorf, Frankfurt, Hamburg, Hannover, Köln, Mannheim, München, Stuttgart, Walldorf.Dein Impact:Als Quereinsteiger SAP (m/w/d) baust du deine Erfahrung als SAP Key User oder im Bereich Supply Chain weiter aus: Unser 6-wöchiges Ausbildungsprogramm bereitet dich optimal auf deine kommenden Aufgaben als SAP-Berater:in vor – und passt sich an deine Bedürfnisse hinsichtlich Arbeitszeiten, Remote-Arbeit oder Reisetätigkeit an. Aufgabenvielfalt: Schritt für Schritt übernimmst du umfassende Verantwortung für den SAP-Betrieb und die Systembetreuung und –pflege in einem unserer Supply Chain Bereiche. Schnittstelle: Dabei agierst du als Kontaktpunkt zwischen der Fachbereichsseite, der IT und dem internen Team. Entwicklung: Nach und nach vertiefst du deine Expertise in SAP Supply Chain Modulen (IBP, S4 Procurement, PP, PP/DS, PM, QM, EWM, TM) sowie angrenzenden SAP S/4 HANA Modulen. Weiterentwicklung: Zudem unterstützt du uns bei der Optimierung maßgeschneiderter Services, Produkte und Lösungen für unsere Kunden im nationalen sowie internationalen Umfeld. Eigeninitiative: Als Teil eines multidisziplinären Teams (Offshore / Remote Teams) in einer agilen Atmosphäre hast du die Möglichkeit, deine eigenen Ideen einzubringen und damit für echten Mehrwert zu sorgen. Dein Skillset: Abschluss einer Berufsausbildung oder eines Studiums Erste Erfahrung (2-5 Jahre) in einem der oben genannten Supply Chain Bereiche sowie in der Nutzung von SAP-Lösungen im Bereich Supply Chain (z. B. als SAP Key-User) Großes Interesse und Lernbereitschaft für Technologie und SAP sowie gutes Verständnis der unternehmerischen Wertschöpfungskette Spaß an der Lösung komplexer Herausforderungen und Lust darauf, vorhandenes Know-how auszubauen und sich neue Themen zu erarbeiten Deutsch und Englisch sehr gut in Wort und Schrift Deine Chance: Best-in-class Weiterbildung an der Deloitte University sowie im Rahmen individueller Qualifikationsangebote und TrainingsUmfassende Entwicklungschancen durch strukturierte Karriereplanung, Inclusive Leadership, Entsendungsprogramme, projektbasierte Job-Rotation sowie Förderung sozialen Engagements und Corporate VolunteeringVereinbarkeit von Beruf &amp; Familie dank Mobile Working &amp; Teilzeit, Sabbaticals und Familienservice, z. B. zur Unterstützung für pflegende Angehörige, Elternzeit-Beratung und vielem mehrGesundheit &amp; Fitness im Fokus durch regelmäßige Gesundheitstage, Kooperation mit Fitness-Anbietern und die Unterstützung von Sport- und TeameventsAttraktive Arbeitgeberleistungen inklusive Bike- und Pkw-Leasing, Firmen-Smartphone zur privaten Nutzung sowie flexiblen Arbeitsmodellen wie z. B. Vertrauensarbeitszeit und EU Remote WorkingVielfältige Gestaltungsspielräume und aktive Förderung einer inklusiven Unternehmenskultur - u. a. durch unsere Diversity &amp; Inclusion Mitarbeiter:innen-NetzwerkeBist du bereit? Mach mit uns den Unterschied!Unser Recruiting-Team freut sich auf deine Bewerbungsunterlagen (CV sowie Abitur-, Hochschul- und Arbeitszeugnisse) über unser Online-Formular. Ein Anschreiben und ein Bewerbungsfoto sind bei uns nicht erforderlich.Gleiche Chancen für alle: Wir freuen uns über Bewerbungen von Menschen, die so vielfältig sind wie wir – unabhängig von Alter, Behinderung, ethnischer Herkunft und Nationalität, Geschlecht, Religion, sexueller Orientierung oder sozialer Herkunft. Noch Fragen? Alle Infos zu unserem Bewerbungsprozess findest du in unseren Bewerbungs-FAQs.Dein Kontakt bei Fragen rund um KarrierethemenUnser Team Talent Acquisition – Aleksandra, Anja, Julia, Lea, Lisa, Silja und ihre Teams – unterstützt dich gerne bei allen Fragen rund um deine Karriere bei Deloitte. Du erreichst uns per E-Mail unter career@deloitte.de oder telefonisch unter +49 211 87724111.Job-ID: 48894 ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Randstad Deutschland",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4329250858",
        "reason": "The job explicitly requires 'Sehr gute Deutschkenntnisse in Wort und Schrift' (Very good German skills in spoken and written word). The user stated, 'I don't know [German]!' and clarified that if a job explicitly requires German, it should not be shown.",
        "body": " Wenn die Arbeit als Mitarbeiter im IT-Helpdesk nicht nur ein Beruf, sondern auch Berufung für Sie ist, sind Sie hier absolut richtig! Wir fühlen uns dazu berufen, Sie in einen neuen Job zu bringen, den Sie mit Leidenschaft ausüben und in dem Sie Ihre Potenziale voll ausschöpfen können. Aktuell verstärkt ein Geschäftspartner aus der IT-Branche sein Team am Standort Dortmund. Neben einer direkten Festanstellung gibt es zusätzliche attraktive Benefits. Bewerben Sie sich am besten direkt online! Randstad begrüßt die Bewerbung von Menschen mit einer Behinderung.Ihre Benefits Fester Arbeitsvertrag direkt bei unserem KundenVertrauensvolle Kontakte zu Unternehmen der Region durch langjährige MarktpräsenzZielgerichtete Platzierung Ihres Profils bei den EntscheidungsträgernProfessionelle Betreuung von der Bewerbung bis zum VertragsabschlussGehaltsgestaltung je nach Qualifikation und Berufserfahrung Ihre Aufgaben Qualifizierung und Bearbeitung von Anfragen im Servicebereich Betreuung und Unterstützung der Anwender im IT-HelpdeskAnnahme, Remote-Support und Behebung von kleineren StörungenEntwicklung von erforderlichen ToolsAllgemeiner TelefonsupportInstallation und Roll-out von Desktop-PCs, Notebooks und Monitoren Ihr Profil Erfolgreich abgeschlossene Ausbildung oder Umschulung im IT-Bereich bzw. eine vergleichbare QualifikationBerufserfahrung im IT-Support wünschenswert Gute Kenntnisse in Windows und CitrixErfahrung in der Arbeit mit NetzwerkenSehr gute Deutschkenntnisse in Wort und SchriftKommunikative und dienstleistungsorientierte Arbeitsweise Firmenbeschreibung Randstad ist einer der weltweit führenden Personaldienstleister mit dem Ziel, so spezialisiert und so fair zu werden wie kein anderes Unternehmen in der Welt der Arbeit. Durch die Unternehmensstrategie „partner for talent” finden, fördern und verbinden wir spezialisierte Talente mit Unternehmen – weltweit, vor Ort und immer mit hoher Geschwindigkeit. Wir schaffen leistungsfähige, vielfältige und agile Teams und unterstützen jeden Einzelnen dabei, eine erfolgreiche Karriere mit gleichen Chancen zu erreichen.Randstad Professional ist eine der vier Spezialisierungen von Randstad und konzentriert sich auf die Vermittlung von Fach- und Führungskräften in den Zukunftsbranchen IT, Engineering, Life Science und Office. ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "McKinsey & Company",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4219663268",
        "reason": "The job explicitly states a requirement for 'English and local office language'. Given that Dusseldorf is listed as a potential office location, this implies a requirement for both English and German if applying to that location. The user's preference clearly states: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!' Therefore, this job does not match the user's language preference.",
        "body": " Who You'll Work WithDriving lasting impact and building long-term capabilities with our clients is not easy work. You are the kind of person who thrives in a high performance/high reward culture - doing hard things, picking yourself up when you stumble, and having the resilience to try another way forward.In return for your drive, determination, and curiosity, we'll provide the resources, mentorship, and opportunities you need to become a stronger leader faster than you ever thought possible. Your colleagues—at all levels—will invest deeply in your development, just as much as they invest in delivering exceptional results for clients. Every day, you'll receive apprenticeship, coaching, and exposure that will accelerate your growth in ways you won’t find anywhere else.When you join us, you will have: Continuous learning: Our learning and apprenticeship culture, backed by structured programs, is all about helping you grow while creating an environment where feedback is clear, actionable, and focused on your development. The real magic happens when you take the input from others to heart and embrace the fast-paced learning experience, owning your journey.A voice that matters: From day one, we value your ideas and contributions. You’ll make a tangible impact by offering innovative ideas and practical solutions, all while upholding our unwavering commitment to ethics and integrity. We not only encourage diverse perspectives, but they are critical in driving us toward the best possible outcomes.Global community: With colleagues across 65+ countries and over 100 different nationalities, our firm’s diversity fuels creativity and helps us come up with the best solutions for our clients. Plus, you’ll have the opportunity to learn from exceptional colleagues with diverse backgrounds and experiences.World-class benefits: On top of a competitive salary (based on your location, experience, and skills), we provide a comprehensive benefits package to enable holistic well-being for you and your family.Your ImpactAs a Knowledge Analyst with Energy Solutions, you will help clients in the energy sector and beyond to improve operations and make strategic decisions for the future.In this role, you will provide daily problem-solving, structuring, modeling, and analytical support for our Energy Solutions tools and analyses. You will gather information to develop these tools/benchmarks and synthesize findings into McKinsey-formatted products, such as complex models, summary reports, and standalone presentations for internal and external audiences.You will collaborate with other experts to solve client problems, deepening your knowledge and refining your analytical and thought-partnership skills.You’ll have the opportunity to gain new skills and build on the strengths you bring to the firm. You will receive exceptional training as well as frequent coaching and mentoring from colleagues.You will be based in our Dusseldorf, Madrid, or London office, joining the Energy Solutions team within McKinsey’s Global Energy &amp; Materials practice.As a global leader in energy intelligence and analytics, Energy Solutions leverages distinctive market perspectives, cutting-edge data and technology to empower organizations across the entire energy value chain. Our team of world-class consultants, analysts and data scientists transform data into actionable insights, enabling clients to make well-informed strategic, tactical, and operational decisions. We help organizations capture opportunities, manage risks, and enhance performance.#STEM2025Your Qualifications and Skills University degree in management, engineering, economics, geosciences, petroleum engineering, or other disciplines with a quantitative or technical focusExperience, internships and/or full-time roles, in the oil and gas sector (upstream, midstream, or downstream), including exploration and production, refining, petrochemicals, fuel retail, lubricants or tradingStrong interest in the energy industry, with a particular focus on oil and gas operations, energy markets, and the energy transition; familiarity with topics such as decarbonization is a plusProven ability to collaborate effectively in a team environment and engage with individuals at all organizational levels Capacity to excel in a fast-paced, results-driven team setting, demonstrating a steep learning curve and a strong commitment to coaching and development Advanced problem-solving skills with a strong aptitude for working with numbers and quantitative models Proficiency in Excel and familiarity with Tableau Experience with modeling capability tools such as Python, R, or VBA is a plusAvailability to travelAbility to effectively communicate complex ideas in English and local office language, both verbally and in writing ",
        "job_sum": "no summary",
        "is_match": false
    },
    {
        "title": "Bundesamt für Bevölkerungsschutz und Katastrophenhilfe (BBK)",
        "url": "https://www.linkedin.com/jobs/search/?f_E=1%2C2&f_PP=105890944%2C106491352%2C100984426%2C106515853%2C101024276%2C103990938%2C106285030%2C105645469&f_TPR=r604800&geoId=103480659&keywords=Werkstudent+It&location=North+Rhine-Westphalia&origin=JOB_SEARCH_PAGE_JOB_FILTER&sortBy=DD&currentJobId=4328925268",
        "reason": "The job explicitly requires very good German skills (C2) and basic English skills (A2). The user's preference states: 'If the job says that it requires german and english, do not show it. It means that I need to know both german and english, which I don't know!'",
        "body": " Das BBK ist die Leitbehörde des Bundes für nationales Krisenmanagement in Deutschland. Wir sichern die Qualität des Krisenmanagements in einer zentralen Koordinierungsrolle mit föderalen, internationalen und sektorübergreifenden Partnerinnen und Partnern. Angesichts dieser Aufgabe wächst unser interdisziplinäres Team stetig. Wir suchen engagierte Fachkräfte, die mit uns Deutschland krisenfester machen wollen.Wir suchen zum nächstmöglichen Zeitpunkt unbefristetmehrere IT-Bürosachbearbeiterinnen / IT-Bürosachbearbeiter (m/w/d) im Referat G.4 „Digitalisierung Bevölkerungsschutz“Entgeltgruppe 9a TVöD (Bund)am Dienstort Bonn.Aufgaben Datenmanagement – Sie erschließen Datenquellen, bereiten Daten auf und stellen diese für unsere Analysen und interaktiven Anwendungen bereit.GeoIT-Infrastruktur – Sie unterstützen den Betrieb unserer IT-Infrastruktur bei Tests und Administration.Qualitätssicherung – Sie unterstützen bei der Erstellung von Dokumentation für Produkte und Prozesse.Administrative Querschnittsaufgaben – Sie übernehmen Verwaltungsaufgaben des Referats G.4 und unterstützen beispielsweise bei Beschaffungen, Veranstaltungen, etc.Profil Sie haben erfolgreich eine dreijährige Berufsausbildung mit Bezug zum Aufgabengebiet, z.B. als Fachinformatiker/in, Kaufmann/-frau für Digitalisierungsmanagement, Kaufmann/-frau für IT-System-Management oder vergleichbar abgeschlossen oder stehen kurz vor dessen Abschluss.Sie sind IT-affin und arbeiten sich gerne in die Bedienung von Software ein.Sie arbeiten gründlich und zuverlässig, sind ein Teamplayer und arbeiten gerne mit anderen zusammen.Sie begeistern sich für Daten und digitale Lösungen und zeichnen sich durch Dienstleistungsaffinität und eine hohe Lernbereitschaft aus.Wissen zu Datenbanken, geographischen Informationssysteme (GIS) und Webtechnologien sind von Vorteil.Ein sehr gutes Ausdrucksvermögen in Deutsch und solide Grundkenntnisse in Englisch (Deutsch C 2/Englisch A2 gem. GER) runden Ihr Profil ab.Da unsere Aufgaben sicherheitsrelevant und ereignisorientiert sind, benötigen wir zwingend Ihre Bereitschaft zur erweiterten Sicherheitsüberprüfung und zur Mitwirkung in der Krisenorganisation des BBK. Dies kann auch Dienst zu außergewöhnlichen Zeiten umfassen.Wir bieten Bewerbung von Beamtinnen und Beamten - Sollten Sie sich in einem Beamtenverhältnis befinden, übernehmen wir Sie bis zur Besoldungsgruppe A 9m statusgleich im Wege einer Abordnung mit dem Ziel der Versetzung.Verbeamtung - Wir bieten bei Vorliegen der individuellen Voraussetzungen die Übernahme in ein Beamtenverhältnis an.Weiterbildung - Selbstverständlich fördern wir Sie durch gezielte persönliche und fachliche Weiterbildung.Flexible Arbeitszeit/Teilzeit/ortsunabhängiges Arbeiten - Sie gestalten Ihre Arbeitszeit in Absprache mit Ihrem Team individuell und sind dabei nicht an feste Kernarbeitszeiten gebunden. Aufgrund der Nutzung spezialisierter Technik und Software ist mobile Arbeit nur im geringen Umfang möglich. Gerne vereinbaren wir mit Ihnen ein an Ihre Bedürfnisse angepasstes Teilzeitmodell.Gesundheitsmanagement - Wir fördern Initiativen für Ihre Gesundheit wie das Wellhub-Firmenfitness und Betriebssportgruppen. Für die Vereinbarkeit von Beruf und Pflege steht Ihnen zudem ein qualifizierter Pflege-Guide zur Verfügung und in herausfordernden Lebensphasen können Sie unser Angebot der sozialen Beratung wahrnehmen.(Deutschland-)Jobticket - Der Schutz von Umwelt und Klima ist uns wichtig. Für Ihren Weg zur Arbeit mit öffentlichen Verkehrsmitteln bieten wir ein Jobticket und übernehmen einen Teil der Kosten.Wohnungswechsel - Wenn Sie bisher nicht in unserem Einzugsbereich wohnen und für Ihre Tätigkeit bei uns ein Umzug notwendig wird, unterstützen wir Sie ggf. durch Trennungsgeld, Umzugskostenvergütung und Wohnungsfürsorge.Das ist uns wichtig Diversität und Chancengleichheit - sind Bestandteil unserer Personalpolitik. Deshalb freuen wir uns über Bewerbungen von Menschen aller Geschlechter und Nationalitäten.Gleichstellung von Frauen und Männern - haben wir uns zum Ziel gesetzt. Wir begrüßen deshalb ausdrücklich Bewerbungen von Frauen.Schwerbehinderte Menschen - berücksichtigen wir bei gleicher Eignung vorrangig. Wir verlangen lediglich ein Mindestmaß an körperlicher Eignung.Work-Life-Balance - unterstützen wir auf vielfältige Art.Important notePlease be advised that a valid work permit for Germany is required for non-EU citizens. Unfortunately, applications without a valid work permit and sufficient German language skills may not be considered.LNKD1_DE ",
        "job_sum": "no summary",
        "is_match": false
    }
]